--------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\NSS70\03_NSS70_Table of Means.log
  log type:  text
 opened on:  16 Nov 2020, 09:41:06

. 
. ****************************************************************************
. * Summary table for asset and liability: Table 0
. ****************************************************************************
. use "${root}\Data Output Files\NSS70_All.dta",clear

. 
. *whether the households have asset of debt
. gen asset_dm = (asset > 0)*100

. gen debt_dm = (total_debt > 0)*100 

. 
. *narrow the scope to households with positive debt/asset 
. gen asset_pos =  asset if asset > 0
(1,198 missing values generated)

. gen total_debt_pos = total_debt if total_debt > 0
(65,549 missing values generated)

. 
. *home ownership
. gen own_home = (building_dwelling > 0)*100

. 
. /*
> Quantile of wealth
> Asset: Real Estate, Total Asset
> Liability: Mortgage, Total Liabilities
> */
. 
. global var_tab "asset asset_pos asset_dm total_debt total_debt_pos debt_dm own_home"

. mdesc $var_tab

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
          asset |           0        110,800           0.00
      asset_pos |       1,198        110,800           1.08
       asset_dm |           0        110,800           0.00
     total_debt |           0        110,800           0.00
   total_debt~s |      65,549        110,800          59.16
        debt_dm |           0        110,800           0.00
       own_home |           0        110,800           0.00
----------------+-----------------------------------------------

. 
. xtile qtl = wealth [aw=hhwgt], n(5)

. 
. table qtl [aw = hhwgt], c(med wealth) format(%15.0fc)

---------------------------
5         |
quantiles |
of wealth |     med(wealth)
----------+----------------
        1 |          31,050
        2 |         183,000
        3 |         436,500
        4 |         953,450
        5 |       3,049,504
---------------------------

. 
. 
. //not restrcting the sample to positive asset or liability.
. 
. eststo total : estpost summarize $var_tab [aw = hhwgt] ,de

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum)     e(min)     e(max) 
-------------+--------------------------------------------------------------------------------------------------------------
       asset |    110800   4.80e+08    1500276   1.55e+14   1.24e+07   109.6422   14354.26   7.19e+14          0   1.85e+09 
   asset_pos |    109602   4.69e+08    1534103   1.58e+14   1.26e+07    108.472   14045.81   7.19e+14         20   1.85e+09 
    asset_dm |    110800   4.80e+08   97.79502   215.6381   14.68462  -6.509562    43.3744   4.69e+10          0        100 
  total_debt |    110800   4.80e+08   49879.35   1.57e+11   396045.3   162.2695   65093.77   2.39e+13          0   1.83e+08 
total_debt~s |     45251   1.33e+08     179990   5.43e+11   736606.6   90.47782   19565.65   2.39e+13         30   1.83e+08 
     debt_dm |    110800   4.80e+08   27.71229   2003.276   44.75797   .9959257   1.991868   1.33e+10          0        100 
    own_home |    110800   4.80e+08   81.00553   1538.671    39.2259  -1.580877   3.499173   3.88e+10          0        100 

             |     e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75)     e(p90)     e(p95)     e(p99) 
-------------+---------------------------------------------------------------------------------------------------
       asset |         0      10000      43250     153520     459330    1250800    3181040    5400000   1.47e+07 
   asset_pos |      2167      22000      57000     168750     478150    1283000    3233628    5461550   1.49e+07 
    asset_dm |         0        100        100        100        100        100        100        100        100 
  total_debt |         0          0          0          0          0       9100      90000     219660     825000 
total_debt~s |      2000       5100       9425      20000      52000     148000     377400     635850    2220950 
     debt_dm |         0          0          0          0          0        100        100        100        100 
    own_home |         0          0          0        100        100        100        100        100        100 

. forvalues i = 1/5 {
  2. eststo q`i' : estpost summarize $var_tab [aw = hhwgt] if qtl == `i',de
  3. }

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum)     e(min)     e(max) 
-------------+--------------------------------------------------------------------------------------------------------------
       asset |     17520   9.59e+07   65720.75   1.49e+11   385916.8   139.3442   33637.75   6.31e+12          0   1.02e+08 
   asset_pos |     16322   8.54e+07   73860.97   1.67e+11   408384.6   132.0937    30136.2   6.31e+12         20   1.02e+08 
    asset_dm |     17520   9.59e+07     88.979   980.6937   31.31603  -2.489467   7.197446   8.54e+09          0        100 
  total_debt |     17520   9.59e+07   44888.87   4.87e+11   697982.9   143.2337   33657.21   4.31e+12          0   1.83e+08 
total_debt~s |      6403   2.14e+07   201537.5   2.16e+12    1468310   68.76772   7688.318   4.31e+12        373   1.83e+08 
     debt_dm |     17520   9.59e+07   22.27321   1731.324   41.60918   1.332763   2.776257   2.14e+09          0        100 
    own_home |     17520   9.59e+07   40.70985   2413.831   49.13075   .3781916   1.143029   3.91e+09          0        100 

             |     e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75)     e(p90)     e(p95)     e(p99) 
-------------+---------------------------------------------------------------------------------------------------
       asset |         0          0          0      10000      43250      76500      98250     142900     440300 
   asset_pos |       500       2000       5000      19700      50000      80455     100000     150000     462750 
    asset_dm |         0          0          0        100        100        100        100        100        100 
  total_debt |         0          0          0          0          0          0      58000     149550     647700 
total_debt~s |      1600       4080       7875      17000      49375     137000     342000     588000    2432162 
     debt_dm |         0          0          0          0          0          0        100        100        100 
    own_home |         0          0          0          0          0        100        100        100        100 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum)     e(min)     e(max) 
-------------+--------------------------------------------------------------------------------------------------------------
       asset |     20700   9.59e+07   203236.6   8.01e+09   89486.86   11.99301   529.9524   1.95e+13     100250    5737000 
   asset_pos |     20700   9.59e+07   203236.6   8.01e+09   89486.86   11.99301   529.9524   1.95e+13     100250    5737000 
    asset_dm |     20700   9.59e+07        100          0          0          .          .   9.59e+09        100        100 
  total_debt |     20700   9.59e+07   15399.76   4.70e+09   68585.86   25.38751   1440.847   1.48e+12          0    5481250 
total_debt~s |      7257   2.44e+07   60584.62   1.58e+10   125578.6   15.15291   481.8474   1.48e+12        400    5481250 
     debt_dm |     20700   9.59e+07    25.4186   1895.846   43.54132   1.129134   2.274944   2.44e+09          0        100 
    own_home |     20700   9.59e+07   87.80406   1070.905   32.72468  -2.310486   6.338348   8.42e+09          0        100 

             |     e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75)     e(p90)     e(p95)     e(p99) 
-------------+---------------------------------------------------------------------------------------------------
       asset |    101850     109000     117430     146010     195000     246700     281600     302000     476541 
   asset_pos |    101850     109000     117430     146010     195000     246700     281600     302000     476541 
    asset_dm |       100        100        100        100        100        100        100        100        100 
  total_debt |         0          0          0          0          0       2000      37200      80000     260000 
total_debt~s |      1300       3504       5600      12000      26750      62500     137200     222000     510000 
     debt_dm |         0          0          0          0          0        100        100        100        100 
    own_home |         0          0          0        100        100        100        100        100        100 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum)     e(min)     e(max) 
-------------+--------------------------------------------------------------------------------------------------------------
       asset |     22102   9.60e+07   469666.1   1.94e+10   139149.9   6.661082   165.9623   4.51e+13     291509    5875000 
   asset_pos |     22102   9.60e+07   469666.1   1.94e+10   139149.9   6.661082   165.9623   4.51e+13     291509    5875000 
    asset_dm |     22102   9.60e+07        100          0          0          .          .   9.60e+09        100        100 
  total_debt |     22102   9.60e+07   22172.02   9.08e+09   95312.14   20.36595   747.7997   2.13e+12          0    5432000 
total_debt~s |      8719   2.66e+07   80078.46   2.82e+10   167853.3   12.39832   262.9818   2.13e+12        480    5432000 
     debt_dm |     22102   9.60e+07   27.68787    2002.26   44.74661   .9972881   1.994584   2.66e+09          0        100 
    own_home |     22102   9.60e+07   90.25593   879.4996   29.65636  -2.714888   8.370617   8.66e+09          0        100 

             |     e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75)     e(p90)     e(p95)     e(p99) 
-------------+---------------------------------------------------------------------------------------------------
       asset |    295100     309050     326000     373200     452400     548930     619846     643200     829390 
   asset_pos |    295100     309050     326000     373200     452400     548930     619846     643200     829390 
    asset_dm |       100        100        100        100        100        100        100        100        100 
  total_debt |         0          0          0          0          0       7750      57000     116000     342250 
total_debt~s |      2000       5000       8000      15900      36000      85000     179000     272000     645000 
     debt_dm |         0          0          0          0          0        100        100        100        100 
    own_home |         0          0        100        100        100        100        100        100        100 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum)     e(min)     e(max) 
-------------+--------------------------------------------------------------------------------------------------------------
       asset |     24049   9.59e+07    1043375   9.62e+10   310099.2   2.499622   28.11739   1.00e+14     644490    7674480 
   asset_pos |     24049   9.59e+07    1043375   9.62e+10   310099.2   2.499622   28.11739   1.00e+14     644490    7674480 
    asset_dm |     24049   9.59e+07        100          0          0          .          .   9.59e+09        100        100 
  total_debt |     24049   9.59e+07   43782.09   3.00e+10   173134.3    12.6876   274.1728   4.20e+12          0    6769821 
total_debt~s |     10217   2.99e+07   140309.5   8.25e+10     287269   7.863801   104.6805   4.20e+12         30    6769821 
     debt_dm |     24049   9.59e+07   31.20393   2146.797   46.33354   .8113545   1.658296   2.99e+09          0        100 
    own_home |     24049   9.59e+07   92.87102   662.1036   25.73137  -3.332267   12.10401   8.90e+09          0        100 

             |     e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75)     e(p90)     e(p95)     e(p99) 
-------------+---------------------------------------------------------------------------------------------------
       asset |    651200     678000     702750     805000     989000    1245325    1439500    1516100    1830000 
   asset_pos |    651200     678000     702750     805000     989000    1245325    1439500    1516100    1830000 
    asset_dm |       100        100        100        100        100        100        100        100        100 
  total_debt |         0          0          0          0          0      20000     104825     226000     641600 
total_debt~s |      2000       6385      10450      24380      55000     137300     342708     528000    1240000 
     debt_dm |         0          0          0          0          0        100        100        100        100 
    own_home |         0          0        100        100        100        100        100        100        100 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum)     e(min)     e(max) 
-------------+--------------------------------------------------------------------------------------------------------------
       asset |     26429   9.59e+07    5720419   7.50e+14   2.74e+07    50.8473    3018.59   5.49e+14    1543860   1.85e+09 
   asset_pos |     26429   9.59e+07    5720419   7.50e+14   2.74e+07    50.8473    3018.59   5.49e+14    1543860   1.85e+09 
    asset_dm |     26429   9.59e+07        100          0          0          .          .   9.59e+09        100        100 
  total_debt |     26429   9.59e+07   123169.3   2.46e+11   495809.7   12.67734   283.1655   1.18e+13          0   1.90e+07 
total_debt~s |     12655   3.07e+07     385122   6.68e+11   817181.2   7.866663   109.2783   1.18e+13        700   1.90e+07 
     debt_dm |     26429   9.59e+07   31.98189    2175.43   46.64151   .7726357   1.596966   3.07e+09          0        100 
    own_home |     26429   9.59e+07   93.40572   615.9664   24.81867  -3.497894   13.23527   8.96e+09          0        100 

             |     e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75)     e(p90)     e(p95)     e(p99) 
-------------+---------------------------------------------------------------------------------------------------
       asset |   1564200    1661092    1782200    2170050    3164190    5396420    9661000   1.47e+07   3.37e+07 
   asset_pos |   1564200    1661092    1782200    2170050    3164190    5396420    9661000   1.47e+07   3.37e+07 
    asset_dm |       100        100        100        100        100        100        100        100        100 
  total_debt |         0          0          0          0          0      45695     305250     584121    2146000 
total_debt~s |      5000      12000      22420      52250     150000     372000     843000    1539947    3944000 
     debt_dm |         0          0          0          0          0        100        100        100        100 
    own_home |         0          0        100        100        100        100        100        100        100 

. 
. label var asset "Average HH. Assets"

. label var asset_pos "Average Assets for HHs. Owning Assets"

. 
. label var total_debt "Average HH. Debt"

. label var total_debt_pos "Average Debt for Indebted HHs."

. 
. label var asset_dm "Own Asset (%)"

. label var debt_dm "Own Debt (%)"

. 
. label var own_home "Dwelling Ownership (%)"

. 
. esttab total q1 q2 q3 q4 q5, cells(mean(fmt(%15.0fc))) label collabels(none) varwidth(40) ///
>  mtitles("All" "Q1" "Q2" "Q3" "Q4" "Q5") stats(N, label("Observations") fmt(%15.0gc)) ///
>  title("Table 0.1 Summary Statistics of Assets and Liabilities by Wealth Quintile (mean)") ///
>  addnotes("Notes: Wealth is defined as total assests net total debt." ///
>           "       HHs. with asset on residential building that used as dwelling is defined as owning dwelling")

Table 0.1 Summary Statistics of Assets and Liabilities by Wealth Quintile (mean)
----------------------------------------------------------------------------------------------------------------------
                                                  (1)          (2)          (3)          (4)          (5)          (6)
                                                  All           Q1           Q2           Q3           Q4           Q5
----------------------------------------------------------------------------------------------------------------------
Average HH. Assets                          1,500,276       65,721      203,237      469,666    1,043,375    5,720,419
Average Assets for HHs. Owning Assets       1,534,103       73,861      203,237      469,666    1,043,375    5,720,419
Own Asset (%)                                      98           89          100          100          100          100
Average HH. Debt                               49,879       44,889       15,400       22,172       43,782      123,169
Average Debt for Indebted HHs.                179,990      201,538       60,585       80,078      140,310      385,122
Own Debt (%)                                       28           22           25           28           31           32
Dwelling Ownership (%)                             81           41           88           90           93           93
----------------------------------------------------------------------------------------------------------------------
Observations                                  110,800       17,520       20,700       22,102       24,049       26,429
----------------------------------------------------------------------------------------------------------------------
Notes: Wealth is defined as total assests net total debt.
       HHs. with asset on residential building that used as dwelling is defined as owning dwelling

. 
. esttab total q1 q2 q3 q4 q5, cells(p50(fmt(%15.0fc))) label collabels(none) varwidth(40) ///
>  mtitles("All" "Q1" "Q2" "Q3" "Q4" "Q5") stats(N, label("Observations") fmt(%15.0gc)) ///
>  title("Table 0.2 Summary Statistics of Assets and Liabilities by Wealth Quintile (med)") ///
>  addnotes("Notes: Wealth is defined as total assests net total debt." ///
>           "       HHs. with asset on residential building that used as dwelling is defined as owning dwelling")

Table 0.2 Summary Statistics of Assets and Liabilities by Wealth Quintile (med)
----------------------------------------------------------------------------------------------------------------------
                                                  (1)          (2)          (3)          (4)          (5)          (6)
                                                  All           Q1           Q2           Q3           Q4           Q5
----------------------------------------------------------------------------------------------------------------------
Average HH. Assets                            459,330       43,250      195,000      452,400      989,000    3,164,190
Average Assets for HHs. Owning Assets         478,150       50,000      195,000      452,400      989,000    3,164,190
Own Asset (%)                                     100          100          100          100          100          100
Average HH. Debt                                    0            0            0            0            0            0
Average Debt for Indebted HHs.                 52,000       49,375       26,750       36,000       55,000      150,000
Own Debt (%)                                        0            0            0            0            0            0
Dwelling Ownership (%)                            100            0          100          100          100          100
----------------------------------------------------------------------------------------------------------------------
Observations                                  110,800       17,520       20,700       22,102       24,049       26,429
----------------------------------------------------------------------------------------------------------------------
Notes: Wealth is defined as total assests net total debt.
       HHs. with asset on residential building that used as dwelling is defined as owning dwelling

.  
. ****************************************************************************
. * Housing mortgage loan features
. ****************************************************************************
. use "${r_input}\Visit 1_Block 14",clear

. drop if b14_q1 == "99" //drop the total amount
(73,266 observations deleted)

. 
. *debt, borrowed amount, repay amount.
. gen debt = b14_q17 //outstanding amout at end of June 2012
(47,671 missing values generated)

. gen debt_todt = b14_q16 //outstanding amout at the date of survey
(1,688 missing values generated)

. gen borrow = b14_q5 //original borrowed amount
(1 missing value generated)

. gen repay = b14_q14 //amount (`) repaid (including interest) during 01.07.2012 to date of survey
(43,996 missing values generated)

. 
. *** Two housing mortgage definitions 
. tab b14_q12

    Type of |
   security |      Freq.     Percent        Cum.
------------+-----------------------------------
         01 |      6,806        6.16        6.16
         02 |      1,577        1.43        7.59
         03 |      4,251        3.85       11.44
         04 |     15,648       14.17       25.61
         05 |      9,400        8.51       34.12
         06 |      1,018        0.92       35.04
         07 |        304        0.28       35.32
         08 |      2,121        1.92       37.24
         09 |      4,111        3.72       40.96
         10 |     65,201       59.04      100.00
------------+-----------------------------------
      Total |    110,437      100.00

. gen secure_type = b14_q12
(6 missing values generated)

. 
. tab b14_q11

 Purpose of |
       loan |      Freq.     Percent        Cum.
------------+-----------------------------------
         01 |      6,886        6.24        6.24
         02 |     13,660       12.37       18.60
         03 |      6,167        5.58       24.19
         04 |      4,227        3.83       28.02
         05 |         66        0.06       28.08
         06 |      1,876        1.70       29.77
         07 |        200        0.18       29.95
         08 |      3,707        3.36       33.31
         09 |      7,998        7.24       40.55
         10 |     10,068        9.12       49.67
         11 |     17,313       15.68       65.35
         12 |     38,271       34.65      100.00
------------+-----------------------------------
      Total |    110,439      100.00

. gen loan_purpose = b14_q11
(4 missing values generated)

. 
. * (A) Conservative (label 1)housing loan with immovable property as secure type: B14_Q11 == 11 & (B14_Q12 == 3 | B14_Q12 == 4)
. gen mrtg_1_dm = (loan_purpose == "11" & (secure_type == "04"|secure_type == "03"))

. 
. * (B) Less conservative (let's label 2) housing loan with mortgage: B14_Q11 == 11 & B14_13 != 4
. gen mrtg_2_dm = (loan_purpose == "11" & (b14_q13 != "4"& b14_q13 != ""))

. 
. *** Housing mortgage features 
. 
. *aggregate at household level. 
. egen double debt_total = sum(debt),by(HHID)

. egen double borrow_total = sum(borrow),by(HHID)

. 
. *** Other laon features
. tab b14_q3 [aw = Weight_SS]

    Date of |
borrowing - |
       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1972 | .068661433        0.00        0.00
       1973 | .166560667        0.00        0.00
       1975 | .258793759        0.00        0.00
       1978 | .172179566        0.00        0.00
       1979 |  .37915914        0.00        0.00
       1980 |  .42355915        0.00        0.00
       1981 | .109710261        0.00        0.00
       1982 | .206973275        0.00        0.00
       1983 | .487978062        0.00        0.00
       1984 | 5.39291459        0.00        0.01
       1985 | 4.92282315        0.00        0.01
       1986 | .921260049        0.00        0.01
       1987 | 2.81837543        0.00        0.01
       1988 | 4.37699311        0.00        0.02
       1989 | 11.2401726        0.01        0.03
       1990 | 12.1221539        0.01        0.04
       1991 | 1.90042562        0.00        0.04
       1992 | 24.9979048        0.02        0.06
       1993 | 22.4553342        0.02        0.08
       1994 | 22.8229468        0.02        0.11
       1995 | 32.7070057        0.03        0.13
       1996 | 35.8474002        0.03        0.17
       1997 |32.74288922        0.03        0.20
       1998 | 112.428431        0.10        0.30
       1999 | 89.8188925        0.08        0.38
       2000 | 217.964276        0.20        0.58
       2001 |  193.72347        0.18        0.75
       2002 | 270.489796        0.24        1.00
       2003 | 326.364678        0.30        1.29
       2004 |472.6414318        0.43        1.72
       2005 | 777.277254        0.70        2.43
       2006 | 1,064.5175        0.96        3.39
       2007 | 1,608.6038        1.46        4.85
       2008 | 2,797.3929        2.53        7.38
       2009 | 4,171.3465        3.78       11.16
       2010 | 8,215.2498        7.44       18.59
       2011 |  15,592.81       14.12       32.71
       2012 | 54,426.567       49.28       82.00
       2013 | 19,884.262       18.00      100.00
------------+-----------------------------------
      Total |    110,439      100.00

. tab b14_q2 [aw = Weight_SS]

    Date of |
borrowing - |
      month |      Freq.     Percent        Cum.
------------+-----------------------------------
         01 |  11,816.98       10.70       10.70
         02 | 10,230.102        9.26       19.96
         03 | 10,607.117        9.61       29.57
         04 | 12,278.078       11.12       40.69
         05 | 11,572.801       10.48       51.17
         06 | 11,191.734       10.13       61.30
         07 |8,320.24461        7.53       68.84
         08 | 9,180.2643        8.31       77.15
         09 | 5,802.3886        5.25       82.40
         10 | 6,636.2567        6.01       88.41
         11 | 6,369.0017        5.77       94.18
         12 | 6,428.0317        5.82      100.00
------------+-----------------------------------
      Total |    110,433      100.00

. 
. *interest rate and type
. gen intst_rate = b14_q10/100/12
(539 missing values generated)

. gen intst_type = b14_q9
(34 missing values generated)

. sum intst_rate [aw = Weight_SS],de

                         intst_rate
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs             109,904
25%         .005              0       Sum of Wgt.   349416471

50%          .01                      Mean           .0152051
                        Largest       Std. Dev.      .0195639
75%          .02             .2
90%          .03             .2       Variance       .0003827
95%          .05              1       Skewness       71.32512
99%           .1            4.5       Kurtosis       16004.17

. replace intst_rate  = . if intst_rate > r(p95)
(1,481 real changes made, 1,481 to missing)

. 
. *loan borrowing date. 
. gen month = real(b14_q2)
(10 missing values generated)

. gen year = b14_q3
(4 missing values generated)

. 
. gen date_loan = ym(year,month)
(10 missing values generated)

. format date_loan %tmMCY

. 
. merge m:1 HHID using "${root}\Data Output Files\NSS70_All.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                        37,081
        from master                         0  (_merge==1)
        from using                     37,081  (_merge==2)

    matched                           110,443  (_merge==3)
    -----------------------------------------

. 
. gen loan_age = date_survey - date_loan //laon from borrow to date of survey, in month.
(37,091 missing values generated)

. replace loan_age = . if loan_age < 0 
(198 real changes made, 198 to missing)

. 
. sum loan_age [aw = Weight_SS],de

                          loan_age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            2              0       Obs             110,235
25%            5              0       Sum of Wgt.   350170108

50%           11                      Mean           18.56219
                        Largest       Std. Dev.      24.56695
75%           23            421
90%           44            457       Variance       603.5353
95%           63            476       Skewness        3.76297
99%          123            491       Kurtosis       25.40451

. replace loan_age  = . if loan_age > r(p99)
(1,477 real changes made, 1,477 to missing)

. 
. *houseing mortgage amount
. foreach var in debt debt_todt borrow {
  2.   replace `var' = 0 if mi(`var')
  3. }
(84,752 real changes made)
(38,769 real changes made)
(37,082 real changes made)

. 
. forvalues i = 1/2 {
  2.   foreach var in debt debt_todt borrow repay{
  3.   replace mrtg_`i'_dm = 0 if mi(mrtg_`i'_dm)
  4.   gen mrtg_`i'_`var' = mrtg_`i'_dm*`var'
  5.   }
  6. }
(37,081 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(81,077 missing values generated)
(37,081 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(81,077 missing values generated)

. 
. mdesc mrtg_*

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
      mrtg_1_dm |           0        147,524           0.00
      mrtg_2_dm |           0        147,524           0.00
    mrtg_1_debt |           0        147,524           0.00
   mrtg_1_de~dt |           0        147,524           0.00
   mrtg_1_bor~w |           0        147,524           0.00
   mrtg_1_repay |      81,077        147,524          54.96
    mrtg_2_debt |           0        147,524           0.00
   mrtg_2_de~dt |           0        147,524           0.00
   mrtg_2_bor~w |           0        147,524           0.00
   mrtg_2_repay |      81,077        147,524          54.96
----------------+-----------------------------------------------

. 
. *household feature
. replace urban = urban*100 
(64,079 real changes made)

. 
. *monthly payment. 
. gen date_temp = ym(2012,7)

. gen repay_mt = date_survey - date_temp //01.07.2012 to date of survey

. 
. drop date_temp

. tab repay_mt 

   repay_mt |      Freq.     Percent        Cum.
------------+-----------------------------------
          6 |     18,053       12.24       12.24
          7 |     22,264       15.09       27.33
          8 |     23,828       16.15       43.48
          9 |     20,417       13.84       57.32
         10 |     23,984       16.26       73.58
         11 |     22,178       15.03       88.61
         12 |     16,624       11.27       99.88
         13 |        130        0.09       99.97
         14 |         18        0.01       99.98
         15 |         28        0.02      100.00
------------+-----------------------------------
      Total |    147,524      100.00

. 
. forvalues i=1/2  {
  2. gen double repay_mt_`i' = mrtg_`i'_repay/repay_mt //monthly payment calculation
  3. }
(81,077 missing values generated)
(81,077 missing values generated)

. 
. forvalues i = 1/2 {
  2. mdesc repay_mt_`i' repay_mt mrtg_`i'_repay //check missing values. 54% on repay information
  3. }

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
     repay_mt_1 |      81,077        147,524          54.96
       repay_mt |           0        147,524           0.00
   mrtg_1_repay |      81,077        147,524          54.96
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
     repay_mt_2 |      81,077        147,524          54.96
       repay_mt |           0        147,524           0.00
   mrtg_2_repay |      81,077        147,524          54.96
----------------+-----------------------------------------------

. 
. *loan period estimation 
. forvalues i = 1/2 {
  2. gen double loan_period_`i'= - ln(1 - mrtg_`i'_borrow *intst_rate * (1/repay_mt_`i')) / ln(1+ intst_rate)
  3. sum loan_period_`i' [aw = Weight_SS],de
  4. replace loan_period_`i' = . if loan_period_`i' > r(p99) //exclude the ourliers 
  5. }
(144,269 missing values generated)

                        loan_period_1
-------------------------------------------------------------
      Percentiles      Smallest
 1%      7.53366       2.339866
 5%     15.58093       2.729418
10%     26.20565       3.229259       Obs               3,255
25%     53.33976        3.26585       Sum of Wgt.   8,081,192

50%     102.8545                      Mean           163.7759
                        Largest       Std. Dev.      272.9406
75%     179.0596       2307.234
90%     264.3022       3532.073       Variance       74496.56
95%      371.063       3532.073       Skewness        5.84224
99%      1770.43       3813.385       Kurtosis       46.18742
(11 real changes made, 11 to missing)
(143,571 missing values generated)

                        loan_period_2
-------------------------------------------------------------
      Percentiles      Smallest
 1%      6.69942       2.339866
 5%     11.78581       2.729418
10%     22.08141       3.050778       Obs               3,953
25%     48.85596       3.229259       Sum of Wgt.   9,947,052

50%     97.10983                      Mean           170.1287
                        Largest       Std. Dev.      296.2969
75%     174.4078       2357.645
90%     272.3213       3532.073       Variance       87791.83
95%     450.2782       3532.073       Skewness       5.077065
99%      1770.43       3813.385       Kurtosis       34.51334
(17 real changes made, 17 to missing)

. 
. sum loan_period_*

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
loan_perio~1 |      3,244    145.3515    193.6086   2.339866    1770.43
loan_perio~2 |      3,936    145.2648    212.1959   2.339866    1770.43

. 
. forvalues i = 1/2 {
  2. mdesc loan_period_`i' mrtg_`i'_borrow intst_rate repay_mt_`i' if mrtg_`i'_borrow > 0  //check missing value: 97% loan period miss
> ing. 
  3. }

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
   loan_perio~1 |       1,699          4,943          34.37
   mrtg_1_bor~w |           0          4,943           0.00
     intst_rate |           6          4,943           0.12
     repay_mt_1 |         632          4,943          12.79
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
   loan_perio~2 |       2,977          6,913          43.06
   mrtg_2_bor~w |           0          6,913           0.00
     intst_rate |          11          6,913           0.16
     repay_mt_2 |       1,472          6,913          21.29
----------------+-----------------------------------------------

. 
. 
. *the loan is subsidized 
. gen loan_sub = (b14_q7 != "09")*100 

. 
. *label variables
. label var urban "Urban Household (%)"

. label var hhsize "Household Size"

. label var head_age "Household Head Age"

. label var head_female "Female Household Head (%)"

. label var loan_sub "Subsidized (%)"

. 
. save "${r_output}\b14_hse_mortgage",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Data Output Files\b14_hse_mortgage.dta saved

. 
. ***********************************************
. ***Table 1. Homewoners
. ***********************************************
. use "${r_output}\b14_hse_mortgage",clear

. 
. //keep if building_dwelling > 0 //only focus on home owner.
. 
. foreach type in mrtg_1_dm mrtg_2_dm mrtg_1_debt mrtg_2_debt mrtg_1_borrow mrtg_2_borrow mrtg_1_repay mrtg_2_repay{ 
  2. egen double total_`type' = sum(`type'), by(HHID)
  3. } 

. 
. bys HHID: keep if _n == 1 // keep only one observation for each HH
(36,724 observations deleted)

. 
. /* Table Content:
> a. Value of Residential Real Estate where HH is Dwelling
> b. Value of Land Associated with #a
> c. Value of Building with #a
> d. Size in square of feet of building of #a
> e. Total assets of these people (median median) //using as quintile. 
> f. Percent of assets of residential RE in total assets 
> g) Who are these people? (i) urban, (ii) hh size, (iii) gender, (iv) age
> h. How many (%) of these had a mortgage (paid off) /Mortgage holders
> */
. 
. *Variables to generate
. replace building_dwelling_area = building_dwelling_area*10.76 //change unit from sq me to sq ft
variable building_dwelling_area was int now float
(91,985 real changes made)

. 
. gen real_estate_dwelling_share = real_estate_dwelling/asset*100 //f. Percent of assets of residential RE in total assets 
(1,198 missing values generated)

. 
. forvalues i=1/2  {
  2. gen total_mrtg_`i' = (total_mrtg_`i'_dm > 0)*100 //h. How many (%) of these had a mortgage during the survey period. 
  3. }

. 
. *label the key variables
. label var real_estate_dwelling "Value of Residential Real Estate"

. label var land_resid "Value of Land Associated"

. label var building_dwelling "Value of Building"

. label var building_dwelling_area "Size of Dwelling in sq. ft"

. label var asset "Total asset"

. label var real_estate_dwelling_share "Residential RE in Total Assets (%)"

. label var total_mrtg_1 "Mortgage Holders_1 (%)"

. label var total_mrtg_2 "Mortgage Holders_2 (%)"

. 
. 
. *create the table 
. global var_tab_1 "real_estate_dwelling land_resid building_dwelling building_dwelling_area real_estate_dwelling_share urban hhsize h
> ead_female head_age total_mrtg_1 total_mrtg_2"

. 
. gen homeowner = (building_dwelling > 0 )*100

. xtile qtl = asset [aw=hhwgt] , n(5)

. 
. mdesc $var_tab_1  //check missing values 

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
   real_estat~g |           0        110,800           0.00
     land_resid |           0        110,800           0.00
   building_d~g |           0        110,800           0.00
   building_d~a |      15,312        110,800          13.82
   real_esta~re |       1,198        110,800           1.08
          urban |           0        110,800           0.00
         hhsize |           0        110,800           0.00
    head_female |           0        110,800           0.00
       head_age |           0        110,800           0.00
   total_mrtg_1 |           0        110,800           0.00
   total_mrtg_2 |           0        110,800           0.00
----------------+-----------------------------------------------

. 
. foreach var in $var_tab_1  {
  2. replace `var' = . if building_dwelling == 0 | mi(building_dwelling) //only focus on home owner.
  3. }
(18,737 real changes made, 18,737 to missing)
(18,737 real changes made, 18,737 to missing)
(18,737 real changes made, 18,737 to missing)
(3,425 real changes made, 3,425 to missing)
(17,539 real changes made, 17,539 to missing)
(18,737 real changes made, 18,737 to missing)
(18,737 real changes made, 18,737 to missing)
(18,737 real changes made, 18,737 to missing)
(18,737 real changes made, 18,737 to missing)
(18,737 real changes made, 18,737 to missing)
(18,737 real changes made, 18,737 to missing)

. 
. mdesc $var_tab_1 //check missing valuee

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
   real_estat~g |      18,737        110,800          16.91
     land_resid |      18,737        110,800          16.91
   building_d~g |      18,737        110,800          16.91
   building_d~a |      18,737        110,800          16.91
   real_esta~re |      18,737        110,800          16.91
          urban |      18,737        110,800          16.91
         hhsize |      18,737        110,800          16.91
    head_female |      18,737        110,800          16.91
       head_age |      18,737        110,800          16.91
   total_mrtg_1 |      18,737        110,800          16.91
   total_mrtg_2 |      18,737        110,800          16.91
----------------+-----------------------------------------------

. 
. gen owner = (building_dwelling > 0 & !mi(building_dwelling))*100

. tab owner //obvservations with none of the value mssing. 

      owner |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,737       16.91       16.91
        100 |     92,063       83.09      100.00
------------+-----------------------------------
      Total |    110,800      100.00

. label var owner "Home Ownership (%)"

. 
. qui eststo total : estpost summarize $var_tab_1 owner [aw = hhwgt],de

. forvalues i = 1/5 {
  2. eststo q`i' : estpost summarize $var_tab_1 owner [aw = hhwgt] if qtl == `i',de
  3. }

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum)     e(min)     e(max) 
-------------+--------------------------------------------------------------------------------------------------------------
real_estat~g |      7034   4.01e+07   55906.37   6.68e+08   25844.29    .156499   2.145227   2.24e+12       1000     112000 
  land_resid |      7034   4.01e+07    21919.8   2.80e+08    16739.1    .920389   3.488949   8.78e+11          0     105000 
building_d~g |      7034   4.01e+07   33986.56   3.95e+08   19870.61   .7684804   3.339875   1.36e+12        500     102000 
building_d~a |      7034   4.01e+07   363.2992   125366.5   354.0714   6.084399   77.79827   1.46e+10          0       8608 
real_esta~re |      7034   4.01e+07   78.50543   443.3545   21.05598   -1.10088   3.555952   3.15e+09   3.782506        100 
       urban |      7034   4.01e+07   5.136312   487.3188    22.0753   4.064894   17.52336   2.06e+08          0        100 
      hhsize |      7034   4.01e+07   3.901913   3.864001   1.965706   .6253657   3.658466   1.56e+08          1         14 
 head_female |      7034   4.01e+07   19.15676   1548.915   39.35625   1.567499   3.457052   7.67e+08          0        100 
    head_age |      7034   4.01e+07   43.44139   217.7474   14.75627   .6178879   2.573445   1.74e+09          5        100 
total_mrtg_1 |      7034   4.01e+07   .3554777   35.42644   5.952012   16.68278   279.3152   1.42e+07          0        100 
total_mrtg_2 |      7034   4.01e+07   .7428094   73.73966    8.58718   11.47308   132.6315   2.98e+07          0        100 
       owner |     16543   9.60e+07   41.71803   2431.556   49.31081   .3359191   1.112842   4.01e+09          0        100 

             |     e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75)     e(p90)     e(p95)     e(p99) 
-------------+---------------------------------------------------------------------------------------------------
real_estat~g |      9000      15200      22000      35700      55000      75000      92070     100000     110000 
  land_resid |         0        870       3500       9000      20000      30500      47000      55000      70000 
building_d~g |      3600       8000      10000      20000      30000      45500      60000      70000      92070 
building_d~a |      53.8      96.84      107.6      161.4        269      430.4      699.4     903.84    1495.64 
real_esta~re |  15.47816   35.37415   46.39684   66.32888   85.10638   95.89041   99.88386        100        100 
       urban |         0          0          0          0          0          0          0        100        100 
      hhsize |         1          1          1          2          4          5          6          7         10 
 head_female |         0          0          0          0          0          0        100        100        100 
    head_age |        20         24         26         32         40       54.5         65         71         80 
total_mrtg_1 |         0          0          0          0          0          0          0          0          0 
total_mrtg_2 |         0          0          0          0          0          0          0          0          0 
       owner |         0          0          0          0          0        100        100        100        100 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum)     e(min)     e(max) 
-------------+--------------------------------------------------------------------------------------------------------------
real_estat~g |     17632   8.35e+07   138337.5   4.09e+09   63936.12   .4363815   2.529724   1.15e+13        800     310000 
  land_resid |     17632   8.35e+07   53321.79   2.05e+09   45251.49   1.431811   5.288348   4.45e+12          0     300000 
building_d~g |     17632   8.35e+07   85015.72   2.46e+09   49589.27    .981778   3.800364   7.10e+12        800     300000 
building_d~a |     17632   8.35e+07   511.0184   241639.1    491.568    8.30555   215.0113   4.27e+10          0    30773.6 
real_esta~re |     17632   8.35e+07   68.00297   646.6864   25.43003  -.4467237   1.997353   5.68e+09   .2983961        100 
       urban |     17632   8.35e+07   11.60059   1025.544   32.02411   2.398224    6.75148   9.68e+08          0        100 
      hhsize |     17632   8.35e+07   4.360848    3.85783   1.964136   .8675329   4.831656   3.64e+08          1         18 
 head_female |     17632   8.35e+07   14.81372   1261.997    35.5246   1.981009   4.924396   1.24e+09          0        100 
    head_age |     17632   8.35e+07   45.23486   184.8903   13.59744   .5465431   2.787904   3.78e+09         16        110 
total_mrtg_1 |     17632   8.35e+07   .4528158    45.0791   6.714097   14.75957   218.8449   3.78e+07          0        100 
total_mrtg_2 |     17632   8.35e+07    .986342   97.66687   9.882655   9.919409   99.39467   8.23e+07          0        100 
       owner |     20779   9.58e+07   87.11938   1122.206   33.49934   -2.21618   5.911452   8.35e+09          0        100 

             |     e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75)     e(p90)     e(p95)     e(p99) 
-------------+---------------------------------------------------------------------------------------------------
real_estat~g |     25000      45000      60000      90000     130000     180000     230000     256600     290000 
  land_resid |         0       4000       8000      20000      40000      75000     110000     150000     200000 
building_d~g |     10000      20000      30000      50000      76000     105000     150000     190000     225000 
building_d~a |     86.08     139.88     172.16     247.48     398.12     602.56     957.64     1291.2       2152 
real_esta~re |  12.08139   23.34519   30.98283   47.18137   72.63492   91.62849   98.11617   99.38838        100 
       urban |         0          0          0          0          0          0        100        100        100 
      hhsize |         1          2          2          3          4          5          7          8         10 
 head_female |         0          0          0          0          0          0        100        100        100 
    head_age |        22         26         30         35         43         55         65         70         80 
total_mrtg_1 |         0          0          0          0          0          0          0          0          0 
total_mrtg_2 |         0          0          0          0          0          0          0          0          0 
       owner |         0          0          0        100        100        100        100        100        100 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum)     e(min)     e(max) 
-------------+--------------------------------------------------------------------------------------------------------------
real_estat~g |     19949   8.66e+07   264271.3   2.04e+10     142833   .4884467   2.481027   2.29e+13       1000     672500 
  land_resid |     19949   8.66e+07     100506   9.95e+09    99726.5   1.549241   5.392044   8.70e+12          0     632205 
building_d~g |     19949   8.66e+07   163765.3   1.09e+10   104176.6   .9208009   3.641995   1.42e+13        500     660000 
building_d~a |     19949   8.66e+07    649.078     363828   603.1816    8.26121   193.7581   5.62e+10          0    35023.8 
real_esta~re |     19949   8.66e+07   56.53782   779.0755   27.91192   .0296867   1.687538   4.89e+09   .2499479        100 
       urban |     19949   8.66e+07   18.43304   1503.603   38.77632   1.628197   3.651026   1.60e+09          0        100 
      hhsize |     19949   8.66e+07   4.697229   4.560698   2.135579   1.294665   7.537475   4.07e+08          1         32 
 head_female |     19949   8.66e+07   12.93067   1125.921   33.55475   2.209539   5.882062   1.12e+09          0        100 
    head_age |     19949   8.66e+07   46.45657   173.8417   13.18491   .4354728    2.66452   4.02e+09         13        101 
total_mrtg_1 |     19949   8.66e+07   1.259625   124.3821   11.15267   8.740792   77.40145   1.09e+08          0        100 
total_mrtg_2 |     19949   8.66e+07   2.091113   204.7488   14.30905   6.696475   45.84278   1.81e+08          0        100 
       owner |     22276   9.59e+07    90.2631   878.9223   29.64662  -2.716262   8.378081   8.66e+09          0        100 

             |     e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75)     e(p90)     e(p95)     e(p99) 
-------------+---------------------------------------------------------------------------------------------------
real_estat~g |     35380      69000      90800     147500     250000     360000     465000     530000     610000 
  land_resid |         0       5600      11000      28000      60000     150000     250000     300000     425000 
building_d~g |     15990      35000      50000      80000     150000     220968     300000     360240     480000 
building_d~a |     107.6     172.16      215.2      322.8     494.96     796.24    1194.36       1614       2690 
real_esta~re |  7.593376   14.81369   19.99238   31.79729   54.57973   83.16832   95.33469   98.14687   99.87644 
       urban |         0          0          0          0          0          0        100        100        100 
      hhsize |         1          2          2          3          4          6          7          8         12 
 head_female |         0          0          0          0          0          0        100        100        100 
    head_age |        23         27         30         36         45         55         65         70         80 
total_mrtg_1 |         0          0          0          0          0          0          0          0        100 
total_mrtg_2 |         0          0          0          0          0          0          0          0        100 
       owner |         0          0        100        100        100        100        100        100        100 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum)     e(min)     e(max) 
-------------+--------------------------------------------------------------------------------------------------------------
real_estat~g |     22214   8.90e+07   536183.9   1.24e+11   352685.4   .6995556   2.659942   4.77e+13       2200    1587020 
  land_resid |     22214   8.90e+07   214720.7   5.71e+10   239020.6    1.70017   5.838557   1.91e+13          0    1500000 
building_d~g |     22214   8.90e+07   321463.1   6.10e+10   246898.9   1.359788   4.989918   2.86e+13        120    1540000 
building_d~a |     22214   8.90e+07   780.1746   954226.4   976.8451    41.2077   3600.786   6.95e+10          0     104867 
real_esta~re |     22214   8.90e+07    51.5865   910.5449   30.17524   .1914091   1.621787   4.59e+09   .2374912        100 
       urban |     22214   8.90e+07   28.39518   2033.323   45.09238   .9582687   1.918279   2.53e+09          0        100 
      hhsize |     22214   8.90e+07   4.987754   5.667282   2.380605   1.582085   9.356056   4.44e+08          1         38 
 head_female |     22214   8.90e+07   11.74385   1036.513   32.19493   2.376587   6.648164   1.05e+09          0        100 
    head_age |     22214   8.90e+07   49.48655   173.2041    13.1607   .3361537   2.692888   4.41e+09         16        102 
total_mrtg_1 |     22214   8.90e+07   2.611765   254.3666   15.94888   5.942651    36.3151   2.33e+08          0        100 
total_mrtg_2 |     22214   8.90e+07   3.961393   380.4638   19.50548   4.720688   23.28489   3.53e+08          0        100 
       owner |     24157   9.59e+07   92.82039   666.4416   25.81553  -3.317482   12.00569   8.90e+09          0        100 

             |     e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75)     e(p90)     e(p95)     e(p99) 
-------------+---------------------------------------------------------------------------------------------------
real_estat~g |     50660     100000     140000     240000     465000     780000    1050000    1207870    1450000 
  land_resid |         0       7200      16666      45000     117054     300000     560000     750000    1021500 
building_d~g |     25000      50000      75000     140000     250000     450000     675000     800000    1180000 
building_d~a |     96.84     193.68     247.48     398.12     624.08     903.84    1355.76    1796.92    3593.84 
real_esta~re |   4.92331   10.14814   14.36761   24.66002   45.92828   82.12401   94.95982    97.6483   99.82692 
       urban |         0          0          0          0          0        100        100        100        100 
      hhsize |         1          2          2          3          5          6          8          9         13 
 head_female |         0          0          0          0          0          0        100        100        100 
    head_age |        24         30         33         40         48         60         67         72         82 
total_mrtg_1 |         0          0          0          0          0          0          0          0        100 
total_mrtg_2 |         0          0          0          0          0          0          0          0        100 
       owner |         0          0        100        100        100        100        100        100        100 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum)     e(min)     e(max) 
-------------+--------------------------------------------------------------------------------------------------------------
real_estat~g |     25234   8.94e+07    2921501   7.50e+14   2.74e+07   53.97757   3224.224   2.61e+14       4200   1.85e+09 
  land_resid |     25234   8.94e+07    1146932   9.92e+13    9959669   116.8407   14880.36   1.02e+14          0   1.28e+09 
building_d~g |     25234   8.94e+07    1774569   6.29e+14   2.51e+07    60.3019   4025.099   1.59e+14       2000   1.85e+09 
building_d~a |     25234   8.94e+07   1083.431    1269332   1126.646   18.49416   878.2468   9.68e+10          0    70047.6 
real_esta~re |     25234   8.94e+07   49.17519   1128.463   33.59261   .1449107    1.46615   4.39e+09   .1288436        100 
       urban |     25234   8.94e+07   50.48206   2499.867   49.99867  -.0192832   1.000372   4.51e+09          0        100 
      hhsize |     25234   8.94e+07   5.086649   6.658338   2.580376    1.85493   10.59448   4.55e+08          1         36 
 head_female |     25234   8.94e+07   10.03868   903.1285    30.0521   2.659523    8.07306   8.97e+08          0        100 
    head_age |     25234   8.94e+07    52.4039   165.6974   12.87235   .2018137   2.593634   4.68e+09         13        100 
total_mrtg_1 |     25234   8.94e+07   7.652583   706.7243   26.58429   3.185961   11.15035   6.84e+08          0        100 
total_mrtg_2 |     25234   8.94e+07   9.041154   822.4056   28.67761    2.85656   9.159933   8.08e+08          0        100 
       owner |     27045   9.59e+07   93.16164    637.096   25.24076  -3.420059    12.6968   8.94e+09          0        100 

             |     e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75)     e(p90)     e(p95)     e(p99) 
-------------+---------------------------------------------------------------------------------------------------
real_estat~g |     80000     180000     275000     592150    1485000    2680000    5000000    7150000   1.75e+07 
  land_resid |         0          0      16200     100000     400000    1200000    2400000    4000000    9797919 
building_d~g |     40000      85000     150000     300000     700000    1500000    2500000    4500000    9750000 
building_d~a |    139.88     247.48     355.08     570.28     893.08    1301.96    1893.76    2399.48    4497.68 
real_esta~re |  2.097237   4.936866   7.867903   16.76092   44.69627   84.31703    95.3895   97.56097    99.5575 
       urban |         0          0          0          0        100        100        100        100        100 
      hhsize |         1          2          2          3          5          6          8         10         14 
 head_female |         0          0          0          0          0          0        100        100        100 
    head_age |        26         32         36         43         52         62         70         75         83 
total_mrtg_1 |         0          0          0          0          0          0          0        100        100 
total_mrtg_2 |         0          0          0          0          0          0          0        100        100 
       owner |         0          0        100        100        100        100        100        100        100 

. 
. esttab total q1 q2 q3 q4 q5, cells(mean(fmt(%15.0fc))) label collabels(none) ///
>  mtitles("All" "Q1" "Q2" "Q3" "Q4" "Q5") stats(N, label("Observations") fmt(%15.0gc)) /// 
>  title("Table 1.1 Summary Statistics of Homeowners by Assets Quintile(mean)") varwidth(40) ///
>  addnote("Notes: Households weighted by survey weights." ///
>  "       Homeowners are households own residential building used as dwelling by household members." ///
>  "       Real estate includes dwelling and urban and rural land used as residential area.")

Table 1.1 Summary Statistics of Homeowners by Assets Quintile(mean)
----------------------------------------------------------------------------------------------------------------------
                                                  (1)          (2)          (3)          (4)          (5)          (6)
                                                  All           Q1           Q2           Q3           Q4           Q5
----------------------------------------------------------------------------------------------------------------------
Value of Residential Real Estate              889,216       55,906      138,338      264,271      536,184    2,921,501
Value of Land Associated                      349,122       21,920       53,322      100,506      214,721    1,146,932
Value of Building                             540,094       33,987       85,016      163,765      321,463    1,774,569
Size of Dwelling in sq. ft                        720          363          511          649          780        1,083
Residential RE in Total Assets (%)                 58           79           68           57           52           49
Urban Household (%)                                25            5           12           18           28           50
Household Size                                      5            4            4            5            5            5
Female Household Head (%)                          13           19           15           13           12           10
Household Head Age                                 48           43           45           46           49           52
Mortgage Holders_1 (%)                              3            0            0            1            3            8
Mortgage Holders_2 (%)                              4            1            1            2            4            9
Home Ownership (%)                                 81           42           87           90           93           93
----------------------------------------------------------------------------------------------------------------------
Observations                                  110,800       16,543       20,779       22,276       24,157       27,045
----------------------------------------------------------------------------------------------------------------------
Notes: Households weighted by survey weights.
       Homeowners are households own residential building used as dwelling by household members.
       Real estate includes dwelling and urban and rural land used as residential area.

. 
. esttab total q1 q2 q3 q4 q5, cells(p50(fmt(%15.0fc))) label collabels(none) ///
>  mtitles("All" "Q1" "Q2" "Q3" "Q4" "Q5") stats(N, label("Observations") fmt(%15.0gc)) /// 
>  title("Table 1.2 Summary Statistics of Homeowners by Assets Quintile (med)") varwidth(40) ///
>  addnote("Notes: Households weighted by survey weights." ///
>  "       Homeowners are households own residential building used as dwelling by household members." ///
>  "       Real estate includes dwelling and urban and rural land used as residential area.")

Table 1.2 Summary Statistics of Homeowners by Assets Quintile (med)
----------------------------------------------------------------------------------------------------------------------
                                                  (1)          (2)          (3)          (4)          (5)          (6)
                                                  All           Q1           Q2           Q3           Q4           Q5
----------------------------------------------------------------------------------------------------------------------
Value of Residential Real Estate              250,000       55,000      130,000      250,000      465,000    1,485,000
Value of Land Associated                       70,000       20,000       40,000       60,000      117,054      400,000
Value of Building                             150,000       30,000       76,000      150,000      250,000      700,000
Size of Dwelling in sq. ft                        538          269          398          495          624          893
Residential RE in Total Assets (%)                 60           85           73           55           46           45
Urban Household (%)                                 0            0            0            0            0          100
Household Size                                      4            4            4            4            5            5
Female Household Head (%)                           0            0            0            0            0            0
Household Head Age                                 46           40           43           45           48           52
Mortgage Holders_1 (%)                              0            0            0            0            0            0
Mortgage Holders_2 (%)                              0            0            0            0            0            0
Home Ownership (%)                                100            0          100          100          100          100
----------------------------------------------------------------------------------------------------------------------
Observations                                  110,800       16,543       20,779       22,276       24,157       27,045
----------------------------------------------------------------------------------------------------------------------
Notes: Households weighted by survey weights.
       Homeowners are households own residential building used as dwelling by household members.
       Real estate includes dwelling and urban and rural land used as residential area.

. 
. 
. ***********************************************
. *** Table 2. Table of Mortgages
. ***********************************************
. use "${r_output}\b14_hse_mortgage",clear

. 
. *all of the mortgages are those active during survey period.
. forvalues i = 1/2 {
  2. egen closed_`i' = rowtotal(mrtg_`i'_debt mrtg_`i'_debt_todt mrtg_`i'_repay)
  3. replace closed_`i' = (closed_`i' == 0)*100 //less than 1 percent loan is paid off. 
  4. sum  closed_`i' if mrtg_`i'_borrow > 0  
  5. drop closed_`i'
  6. }
(147,524 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    closed_1 |      4,943    .0606919    2.463074          0        100
(147,524 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    closed_2 |      6,913    .1012585    3.180733          0        100

. 
. /*
> a) value of loan taken at inception (mortgage value) - amount borrowed
> b) Term of loan (calculated) 
> c) Interest rate (given)
> d) Monthly payment (calculate)
> e) Is it subsidized (column 7)
> f) count of mortgages - 100? 200? N. Number of observations 
> g) Who are these people? (i) urban, (ii) hh size, (iii) gender, (iv) age
> */
. 
. replace intst_rate = intst_rate*100*12
(84,996 real changes made)

. 
. label var mrtg_1_borrow "Mortgage Value at Inception_1"

. label var mrtg_2_borrow "Mortgage Value at Inception_2"

. label var loan_period_1 "Term of Loan_1 (mt)"

. label var loan_period_2 "Term of Loan_2 (mt)"

. label var intst_rate "Interest rate (%)"

. label var repay_mt_1 "Monthly Payment_1"

. label var repay_mt_2 "Monthly Payment_2"

. 
. *create the table 
. global var_tab_2 "intst_rate loan_sub urban hhsize head_female head_age"

. 
. forvalues x = 1/2 {
  2. mdesc intst_rate mrtg_`x'_borrow loan_period_`x' repay_mt_`x'
  3. }

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
     intst_rate |      39,101        147,524          26.50
   mrtg_1_bor~w |           0        147,524           0.00
   loan_perio~1 |     144,280        147,524          97.80
     repay_mt_1 |      81,077        147,524          54.96
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
     intst_rate |      39,101        147,524          26.50
   mrtg_2_bor~w |           0        147,524           0.00
   loan_perio~2 |     143,588        147,524          97.33
     repay_mt_2 |      81,077        147,524          54.96
----------------+-----------------------------------------------

. 
. forvalues x = 1/2 {
  2. gen double obs_`x' = (intst_rate + loan_sub + urban + hhsize + head_female + head_age + mrtg_`x'_borrow + loan_period_`x' + repay
> _mt_`x') != . //obsevations will full loan information
  3. mdesc intst_rate loan_sub urban hhsize head_female head_age mrtg_`x'_borrow loan_period_`x' repay_mt_`x' if mrtg_`x'_borrow > 0 &
>  obs_`x' == 1
  4. }

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
     intst_rate |           0          3,244           0.00
       loan_sub |           0          3,244           0.00
          urban |           0          3,244           0.00
         hhsize |           0          3,244           0.00
    head_female |           0          3,244           0.00
       head_age |           0          3,244           0.00
   mrtg_1_bor~w |           0          3,244           0.00
   loan_perio~1 |           0          3,244           0.00
     repay_mt_1 |           0          3,244           0.00
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
     intst_rate |           0          3,936           0.00
       loan_sub |           0          3,936           0.00
          urban |           0          3,936           0.00
         hhsize |           0          3,936           0.00
    head_female |           0          3,936           0.00
       head_age |           0          3,936           0.00
   mrtg_2_bor~w |           0          3,936           0.00
   loan_perio~2 |           0          3,936           0.00
     repay_mt_2 |           0          3,936           0.00
----------------+-----------------------------------------------

. 
. tab year,sort //select the year cut for loan borrow year. 

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       2012 |     52,728       47.74       47.74
       2013 |     19,469       17.63       65.37
       2011 |     15,457       14.00       79.37
       2010 |      8,853        8.02       87.38
       2009 |      4,492        4.07       91.45
       2008 |      2,967        2.69       94.14
       2007 |      1,793        1.62       95.76
       2006 |      1,181        1.07       96.83
       2005 |        910        0.82       97.66
       2004 |        589        0.53       98.19
       2003 |        523        0.47       98.66
       2002 |        329        0.30       98.96
       2000 |        324        0.29       99.25
       2001 |        237        0.21       99.47
       1998 |        137        0.12       99.59
       1999 |         83        0.08       99.67
       1996 |         56        0.05       99.72
       1997 |         55        0.05       99.77
       1995 |         52        0.05       99.82
       1993 |         46        0.04       99.86
       1992 |         36        0.03       99.89
       1994 |         31        0.03       99.92
       1990 |         25        0.02       99.94
       1989 |         11        0.01       99.95
       1987 |         10        0.01       99.96
       1991 |         10        0.01       99.97
       1988 |          9        0.01       99.98
       1985 |          8        0.01       99.98
       1980 |          4        0.00       99.99
       1984 |          3        0.00       99.99
       1986 |          3        0.00       99.99
       1972 |          1        0.00       99.99
       1973 |          1        0.00       99.99
       1975 |          1        0.00      100.00
       1978 |          1        0.00      100.00
       1979 |          1        0.00      100.00
       1981 |          1        0.00      100.00
       1982 |          1        0.00      100.00
       1983 |          1        0.00      100.00
------------+-----------------------------------
      Total |    110,439      100.00

. 
. forvalues i = 2002(2)2013 {
  2. local j = `i' + 1 
  3. dis `i' "-"`j'
  4.   forvalues x = 1/2 {
  5.   qui eststo total_`x' : estpost summarize mrtg_`x'_borrow loan_period_`x' repay_mt_`x' $var_tab_2 [aw = hhwgt] if mrtg_`x'_borro
> w > 0 & obs_`x' == 1,de
  6.   qui eststo yr_`j'_`x' : estpost summarize mrtg_`x'_borrow loan_period_`x' repay_mt_`x' $var_tab_2 [aw = hhwgt] if inrange(year,
> `i',`j') & mrtg_`x'_borrow > 0 & obs_`x' == 1,de
  7.   qui eststo yr_2002_`x' : estpost summarize mrtg_`x'_borrow loan_period_`x' repay_mt_`x' $var_tab_2 [aw = hhwgt] if year<2002 & 
> mrtg_`x'_borrow > 0 & obs_`x' == 1,de
  8.   }
  9. }
2002-2003
2004-2005
2006-2007
2008-2009
2010-2011
2012-2013

. 
. forvalues x = 1/2 {
  2. esttab total_`x' yr_2013_`x' yr_2011_`x' yr_2009_`x' yr_2007_`x' yr_2005_`x' yr_2003_`x' yr_2002_`x', cells(mean(fmt(%15.0fc))) l
> abel collabels(none) ///
>  mtitles("All" "2012-2013" "2010-2011" "2008-2009" "2006-2007" "2004-2005" "2002-2003" "<2002") stats(N, label("Observations") fmt(%
> 15.0gc)) ///
>  title("Table 2.1 Summary Statistics of Mortgages (mean)_`x' by Borrowed Year") varwidth(25) ///
>  addnotes("Notes: Households weighted by survey weights."  ///
>           "       The term of loan is imputed by monthly payment, interest rate, and the mortgage value at inception." ///
>                   "       The monthly payment is estimated by the amount repaid divide during 7/1/2012 to date of survey.")
  3. }

Table 2.1 Summary Statistics of Mortgages (mean)_1 by Borrowed Year
---------------------------------------------------------------------------------------------------------------------------------
                                   (1)          (2)          (3)          (4)          (5)          (6)          (7)          (8)
                                   All    2012-2013    2010-2011    2008-2009    2006-2007    2004-2005    2002-2003        <2002
---------------------------------------------------------------------------------------------------------------------------------
Mortgage Value at Incep~1      668,650      426,549      829,603      815,360      766,296      500,311      397,954      322,039
Term of Loan_1 (mt)                157          119          134          223          182          177          171          117
Monthly Payment_1               11,963        7,216       13,581       16,470       12,301       10,195        8,681        8,674
Interest rate (%)                   11           13           12           12           11           10            9           10
Subsidized (%)                      93           89           94           95           94           91          100           99
Urban Household (%)                 71           48           69           76           87           80           92           83
Household Size                       5            4            5            4            5            5            5            5
Female Household Head (%)            8            8            9            7            8            5            2           17
Household Head Age                  49           47           49           50           50           51           51           53
---------------------------------------------------------------------------------------------------------------------------------
Observations                     3,244          585        1,070          538          424          334          146          147
---------------------------------------------------------------------------------------------------------------------------------
Notes: Households weighted by survey weights.
       The term of loan is imputed by monthly payment, interest rate, and the mortgage value at inception.
       The monthly payment is estimated by the amount repaid divide during 7/1/2012 to date of survey.

Table 2.1 Summary Statistics of Mortgages (mean)_2 by Borrowed Year
---------------------------------------------------------------------------------------------------------------------------------
                                   (1)          (2)          (3)          (4)          (5)          (6)          (7)          (8)
                                   All    2012-2013    2010-2011    2008-2009    2006-2007    2004-2005    2002-2003        <2002
---------------------------------------------------------------------------------------------------------------------------------
Mortgage Value at Incep~2      598,155      308,122      757,134      787,946      728,449      494,361      399,063      323,909
Term of Loan_2 (mt)                160          152          135          211          181          173          171          116
Monthly Payment_2               11,076        5,749       12,598       16,153       12,399       10,780        8,589        9,257
Interest rate (%)                   12           14           12           12           11           10            9           10
Subsidized (%)                      91           84           91           93           95           91          100           98
Urban Household (%)                 68           48           67           76           87           81           92           83
Household Size                       4            4            5            4            5            5            5            5
Female Household Head (%)            9           11           10            7            9            5            2           17
Household Head Age                  49           46           48           50           50           51           51           53
---------------------------------------------------------------------------------------------------------------------------------
Observations                     3,936          892        1,300          619          460          355          154          156
---------------------------------------------------------------------------------------------------------------------------------
Notes: Households weighted by survey weights.
       The term of loan is imputed by monthly payment, interest rate, and the mortgage value at inception.
       The monthly payment is estimated by the amount repaid divide during 7/1/2012 to date of survey.

. 
. forvalues x = 1/2 {
  2. esttab total_`x' yr_2013_`x' yr_2011_`x' yr_2009_`x' yr_2007_`x' yr_2005_`x' yr_2003_`x' yr_2002_`x', cells(p50(fmt(%15.0fc))) la
> bel collabels(none) ///
>  mtitles("All" "2012-2013" "2010-2011" "2008-2009" "2006-2007" "2004-2005" "2002-2003" "<2002") stats(N, label("Observations") fmt(%
> 15.0gc)) ///
>  title("Table 2.2 Summary Statistics of Mortgages (med)_`x' by Borrowed Year") varwidth(25) ///
>  addnotes("Notes: Households weighted by survey weights."///
  3.           "       The term of loan is imputed by monthly payment, interest rate, and the mortgage value at inception." ///
>                   "       The monthly payment is estimated by the amount repaid divide during 7/1/2012 to date of survey.")
  4. }
) required
r(100);

end of do-file

r(100);

