-------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\NSS70\03_NSS70_
> Table of Means.log
  log type:  text
 opened on:  19 Nov 2020, 09:46:44

. 
. ****************************************************************************
. * Summary table for asset and liability: Table 0
. ****************************************************************************
. use "${root}\Data Output Files\NSS70_All.dta",clear

. 
. *whether the households have asset of debt
. gen asset_dm = (asset > 0)*100

. gen debt_dm = (total_debt > 0)*100 

. 
. *narrow the scope to households with positive debt/asset 
. gen asset_pos =  asset if asset > 0
(1,198 missing values generated)

. gen total_debt_pos = total_debt if total_debt > 0
(65,549 missing values generated)

. 
. *home ownership
. gen own_home = (building_dwelling > 0)*100

. 
. *urban hosuehold unit
. replace urban = urban*100
(48,665 real changes made)

. 
. /*
> Quantile of wealth
> Asset: Real Estate, Total Asset
> Liability: Mortgage, Total Liabilities
> */
. 
. global var_tab "asset asset_pos asset_dm total_debt total_debt_pos debt_dm own_home urban hhsize head_femal
> e head_age"

. mdesc $var_tab

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
          asset |           0        110,800           0.00
      asset_pos |       1,198        110,800           1.08
       asset_dm |           0        110,800           0.00
     total_debt |           0        110,800           0.00
   total_debt~s |      65,549        110,800          59.16
        debt_dm |           0        110,800           0.00
       own_home |           0        110,800           0.00
          urban |           0        110,800           0.00
         hhsize |           0        110,800           0.00
    head_female |           0        110,800           0.00
       head_age |           0        110,800           0.00
----------------+-----------------------------------------------

. 
. table qtl [aw = hhwgt], c(med wealth) format(%15.0fc)

---------------------------
5         |
quantiles |
of wealth |     med(wealth)
----------+----------------
        1 |          31,050
        2 |         183,000
        3 |         436,500
        4 |         953,450
        5 |       3,049,504
---------------------------

. 
. //not restrcting the sample to positive asset or liability.
. 
. eststo total : estpost summarize $var_tab [aw = hhwgt] ,de

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
       asset |    110800   4.80e+08    1500276   1.55e+14   1.24e+07   109.6422   14354.26   7.19e+14 
   asset_pos |    109602   4.69e+08    1534103   1.58e+14   1.26e+07    108.472   14045.81   7.19e+14 
    asset_dm |    110800   4.80e+08   97.79502   215.6381   14.68462  -6.509562    43.3744   4.69e+10 
  total_debt |    110800   4.80e+08   49879.35   1.57e+11   396045.3   162.2695   65093.77   2.39e+13 
total_debt~s |     45251   1.33e+08     179990   5.43e+11   736606.6   90.47782   19565.65   2.39e+13 
     debt_dm |    110800   4.80e+08   27.71229   2003.276   44.75797   .9959257   1.991868   1.33e+10 
    own_home |    110800   4.80e+08   81.00553   1538.671    39.2259  -1.580877   3.499173   3.88e+10 
       urban |    110800   4.80e+08   34.91605   2272.495   47.67069   .6328425    1.40049   1.67e+10 
      hhsize |    110800   4.80e+08   4.413097   5.284765   2.298862   1.371278   8.470308   2.12e+09 
 head_female |    110800   4.80e+08   13.84398   1192.753   34.53626    2.09381   5.384039   6.64e+09 
    head_age |    110800   4.80e+08   46.02443   209.2398   14.46512    .250517   2.672187   2.21e+10 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
       asset |         0   1.85e+09          0      10000      43250     153520     459330    1250800 
   asset_pos |        20   1.85e+09       2167      22000      57000     168750     478150    1283000 
    asset_dm |         0        100          0        100        100        100        100        100 
  total_debt |         0   1.83e+08          0          0          0          0          0       9100 
total_debt~s |        30   1.83e+08       2000       5100       9425      20000      52000     148000 
     debt_dm |         0        100          0          0          0          0          0        100 
    own_home |         0        100          0          0          0        100        100        100 
       urban |         0        100          0          0          0          0          0        100 
      hhsize |         1         38          1          1          2          3          4          6 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |         4        110         16         24         28         35         45         56 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
       asset |   3181040    5400000   1.47e+07 
   asset_pos |   3233628    5461550   1.49e+07 
    asset_dm |       100        100        100 
  total_debt |     90000     219660     825000 
total_debt~s |    377400     635850    2220950 
     debt_dm |       100        100        100 
    own_home |       100        100        100 
       urban |       100        100        100 
      hhsize |         7          8         12 
 head_female |       100        100        100 
    head_age |        65         70         80 

. forvalues i = 1/5 {
  2. eststo q`i' : estpost summarize $var_tab [aw = hhwgt] if qtl == `i',de
  3. }

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
       asset |     17520   9.59e+07   65720.75   1.49e+11   385916.8   139.3442   33637.75   6.31e+12 
   asset_pos |     16322   8.54e+07   73860.97   1.67e+11   408384.6   132.0937    30136.2   6.31e+12 
    asset_dm |     17520   9.59e+07     88.979   980.6937   31.31603  -2.489467   7.197446   8.54e+09 
  total_debt |     17520   9.59e+07   44888.87   4.87e+11   697982.9   143.2337   33657.21   4.31e+12 
total_debt~s |      6403   2.14e+07   201537.5   2.16e+12    1468310   68.76772   7688.318   4.31e+12 
     debt_dm |     17520   9.59e+07   22.27321   1731.324   41.60918   1.332763   2.776257   2.14e+09 
    own_home |     17520   9.59e+07   40.70985   2413.831   49.13075   .3781916   1.143029   3.91e+09 
       urban |     17520   9.59e+07   45.42449   2479.206   49.79163   .1837915   1.033779   4.36e+09 
      hhsize |     17520   9.59e+07   3.291639   4.024099   2.006016   .8307773   4.359411   3.16e+08 
 head_female |     17520   9.59e+07   19.68295   1580.967   39.76137   1.524993   3.325604   1.89e+09 
    head_age |     17520   9.59e+07   38.08552   239.5512   15.47744   .5501874   2.821131   3.65e+09 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
       asset |         0   1.02e+08          0          0          0      10000      43250      76500 
   asset_pos |        20   1.02e+08        500       2000       5000      19700      50000      80455 
    asset_dm |         0        100          0          0          0        100        100        100 
  total_debt |         0   1.83e+08          0          0          0          0          0          0 
total_debt~s |       373   1.83e+08       1600       4080       7875      17000      49375     137000 
     debt_dm |         0        100          0          0          0          0          0          0 
    own_home |         0        100          0          0          0          0          0        100 
       urban |         0        100          0          0          0          0          0        100 
      hhsize |         1         30          1          1          1          1          3          5 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |         4        100         11         16         20         27         35         48 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
       asset |     98250     142900     440300 
   asset_pos |    100000     150000     462750 
    asset_dm |       100        100        100 
  total_debt |     58000     149550     647700 
total_debt~s |    342000     588000    2432162 
     debt_dm |       100        100        100 
    own_home |       100        100        100 
       urban |       100        100        100 
      hhsize |         6          7          9 
 head_female |       100        100        100 
    head_age |        60         66         78 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
       asset |     20700   9.59e+07   203236.6   8.01e+09   89486.86   11.99301   529.9524   1.95e+13 
   asset_pos |     20700   9.59e+07   203236.6   8.01e+09   89486.86   11.99301   529.9524   1.95e+13 
    asset_dm |     20700   9.59e+07        100          0          0          .          .   9.59e+09 
  total_debt |     20700   9.59e+07   15399.76   4.70e+09   68585.86   25.38751   1440.847   1.48e+12 
total_debt~s |      7257   2.44e+07   60584.62   1.58e+10   125578.6   15.15291   481.8474   1.48e+12 
     debt_dm |     20700   9.59e+07    25.4186   1895.846   43.54132   1.129134   2.274944   2.44e+09 
    own_home |     20700   9.59e+07   87.80406   1070.905   32.72468  -2.310486   6.338348   8.42e+09 
       urban |     20700   9.59e+07   19.22302   1552.852   39.40625   1.562074   3.440074   1.84e+09 
      hhsize |     20700   9.59e+07   4.267908   3.930266    1.98249   .9112287   5.080924   4.09e+08 
 head_female |     20700   9.59e+07   15.06866   1279.863   35.77518   1.952873   4.813712   1.44e+09 
    head_age |     20700   9.59e+07    44.7874   183.7313   13.55475    .573411   2.838521   4.29e+09 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
       asset |    100250    5737000     101850     109000     117430     146010     195000     246700 
   asset_pos |    100250    5737000     101850     109000     117430     146010     195000     246700 
    asset_dm |       100        100        100        100        100        100        100        100 
  total_debt |         0    5481250          0          0          0          0          0       2000 
total_debt~s |       400    5481250       1300       3504       5600      12000      26750      62500 
     debt_dm |         0        100          0          0          0          0          0        100 
    own_home |         0        100          0          0          0        100        100        100 
       urban |         0        100          0          0          0          0          0          0 
      hhsize |         1         18          1          1          2          3          4          5 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        16        110         22         26         29         35         42         55 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
       asset |    281600     302000     476541 
   asset_pos |    281600     302000     476541 
    asset_dm |       100        100        100 
  total_debt |     37200      80000     260000 
total_debt~s |    137200     222000     510000 
     debt_dm |       100        100        100 
    own_home |       100        100        100 
       urban |       100        100        100 
      hhsize |         7          8         10 
 head_female |       100        100        100 
    head_age |        65         70         80 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
       asset |     22102   9.60e+07   469666.1   1.94e+10   139149.9   6.661082   165.9623   4.51e+13 
   asset_pos |     22102   9.60e+07   469666.1   1.94e+10   139149.9   6.661082   165.9623   4.51e+13 
    asset_dm |     22102   9.60e+07        100          0          0          .          .   9.60e+09 
  total_debt |     22102   9.60e+07   22172.02   9.08e+09   95312.14   20.36595   747.7997   2.13e+12 
total_debt~s |      8719   2.66e+07   80078.46   2.82e+10   167853.3   12.39832   262.9818   2.13e+12 
     debt_dm |     22102   9.60e+07   27.68787    2002.26   44.74661   .9972881   1.994584   2.66e+09 
    own_home |     22102   9.60e+07   90.25593   879.4996   29.65636  -2.714888   8.370617   8.66e+09 
       urban |     22102   9.60e+07   24.78672   1864.375   43.17841   1.167892   2.363971   2.38e+09 
      hhsize |     22102   9.60e+07   4.605934   4.497822   2.120807     1.3824   9.152576   4.42e+08 
 head_female |     22102   9.60e+07   12.55099   1097.622   33.13037   2.260757    6.11102   1.20e+09 
    head_age |     22102   9.60e+07   46.12455   172.8228   13.14621   .4637412   2.683198   4.43e+09 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
       asset |    291509    5875000     295100     309050     326000     373200     452400     548930 
   asset_pos |    291509    5875000     295100     309050     326000     373200     452400     548930 
    asset_dm |       100        100        100        100        100        100        100        100 
  total_debt |         0    5432000          0          0          0          0          0       7750 
total_debt~s |       480    5432000       2000       5000       8000      15900      36000      85000 
     debt_dm |         0        100          0          0          0          0          0        100 
    own_home |         0        100          0          0        100        100        100        100 
       urban |         0        100          0          0          0          0          0          0 
      hhsize |         1         38          1          2          2          3          4          6 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        15        101         23         27         30         36         45         55 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
       asset |    619846     643200     829390 
   asset_pos |    619846     643200     829390 
    asset_dm |       100        100        100 
  total_debt |     57000     116000     342250 
total_debt~s |    179000     272000     645000 
     debt_dm |       100        100        100 
    own_home |       100        100        100 
       urban |       100        100        100 
      hhsize |         7          8         12 
 head_female |       100        100        100 
    head_age |        65         70         80 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
       asset |     24049   9.59e+07    1043375   9.62e+10   310099.2   2.499622   28.11739   1.00e+14 
   asset_pos |     24049   9.59e+07    1043375   9.62e+10   310099.2   2.499622   28.11739   1.00e+14 
    asset_dm |     24049   9.59e+07        100          0          0          .          .   9.59e+09 
  total_debt |     24049   9.59e+07   43782.09   3.00e+10   173134.3    12.6876   274.1728   4.20e+12 
total_debt~s |     10217   2.99e+07   140309.5   8.25e+10     287269   7.863801   104.6805   4.20e+12 
     debt_dm |     24049   9.59e+07   31.20393   2146.797   46.33354   .8113545   1.658296   2.99e+09 
    own_home |     24049   9.59e+07   92.87102   662.1036   25.73137  -3.332267   12.10401   8.90e+09 
       urban |     24049   9.59e+07   32.68609    2200.32   46.90757   .7382292   1.544982   3.13e+09 
      hhsize |     24049   9.59e+07   4.898482   5.571976   2.360503   1.516224   8.337077   4.70e+08 
 head_female |     24049   9.59e+07   11.96756   1053.577   32.45886   2.343473   6.491866   1.15e+09 
    head_age |     24049   9.59e+07    49.0502   173.1484   13.15859   .3564525   2.717114   4.70e+09 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
       asset |    644490    7674480     651200     678000     702750     805000     989000    1245325 
   asset_pos |    644490    7674480     651200     678000     702750     805000     989000    1245325 
    asset_dm |       100        100        100        100        100        100        100        100 
  total_debt |         0    6769821          0          0          0          0          0      20000 
total_debt~s |        30    6769821       2000       6385      10450      24380      55000     137300 
     debt_dm |         0        100          0          0          0          0          0        100 
    own_home |         0        100          0          0        100        100        100        100 
       urban |         0        100          0          0          0          0          0        100 
      hhsize |         1         32          1          2          2          3          5          6 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        13        102         24         30         32         40         48         59 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
       asset |   1439500    1516100    1830000 
   asset_pos |   1439500    1516100    1830000 
    asset_dm |       100        100        100 
  total_debt |    104825     226000     641600 
total_debt~s |    342708     528000    1240000 
     debt_dm |       100        100        100 
    own_home |       100        100        100 
       urban |       100        100        100 
      hhsize |         8          9         13 
 head_female |       100        100        100 
    head_age |        67         71         82 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
       asset |     26429   9.59e+07    5720419   7.50e+14   2.74e+07    50.8473    3018.59   5.49e+14 
   asset_pos |     26429   9.59e+07    5720419   7.50e+14   2.74e+07    50.8473    3018.59   5.49e+14 
    asset_dm |     26429   9.59e+07        100          0          0          .          .   9.59e+09 
  total_debt |     26429   9.59e+07   123169.3   2.46e+11   495809.7   12.67734   283.1655   1.18e+13 
total_debt~s |     12655   3.07e+07     385122   6.68e+11   817181.2   7.866663   109.2783   1.18e+13 
     debt_dm |     26429   9.59e+07   31.98189    2175.43   46.64151   .7726357   1.596966   3.07e+09 
    own_home |     26429   9.59e+07   93.40572   615.9664   24.81867  -3.497894   13.23527   8.96e+09 
       urban |     26429   9.59e+07   52.45935   2494.046   49.94042  -.0984931   1.009701   5.03e+09 
      hhsize |     26429   9.59e+07   5.002131   6.502681   2.550036   1.840202   10.60241   4.80e+08 
 head_female |     26429   9.59e+07    9.94716   895.8039   29.92998   2.676486    8.16358   9.54e+08 
    head_age |     26429   9.59e+07   52.07952   166.5597    12.9058   .2098416   2.613136   4.99e+09 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
       asset |   1543860   1.85e+09    1564200    1661092    1782200    2170050    3164190    5396420 
   asset_pos |   1543860   1.85e+09    1564200    1661092    1782200    2170050    3164190    5396420 
    asset_dm |       100        100        100        100        100        100        100        100 
  total_debt |         0   1.90e+07          0          0          0          0          0      45695 
total_debt~s |       700   1.90e+07       5000      12000      22420      52250     150000     372000 
     debt_dm |         0        100          0          0          0          0          0        100 
    own_home |         0        100          0          0        100        100        100        100 
       urban |         0        100          0          0          0          0        100        100 
      hhsize |         1         36          1          2          2          3          5          6 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        13        100         26         32         35         42         51         61 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
       asset |   9661000   1.47e+07   3.37e+07 
   asset_pos |   9661000   1.47e+07   3.37e+07 
    asset_dm |       100        100        100 
  total_debt |    305250     584121    2146000 
total_debt~s |    843000    1539947    3944000 
     debt_dm |       100        100        100 
    own_home |       100        100        100 
       urban |       100        100        100 
      hhsize |         8         10         14 
 head_female |         0        100        100 
    head_age |        70         74         82 

. 
. label var asset "Average HH. Assets"

. label var asset_pos "Average Assets for HHs. Owning Assets"

. 
. label var total_debt "Average HH. Debt"

. label var total_debt_pos "Average Debt for Indebted HHs."

. 
. label var asset_dm "Own Asset (%)"

. label var debt_dm "Own Debt (%)"

. 
. label var own_home "Dwelling Ownership (%)"

. 
. label var urban "Urban Household (%)"

. label var hhsize "Household Size"

. label var head_age "Household Head Age"

. label var head_female "Female Household Head (%)"

. 
. *household feature
. esttab total q1 q2 q3 q4 q5, cells(mean(fmt(%15.0fc))) label collabels(none) varwidth(40) ///
>  mtitles("All" "Q1" "Q2" "Q3" "Q4" "Q5") stats(N, label("Observations") fmt(%15.0gc)) ///
>  title("Table 0.1 Summary Statistics of Assets and Liabilities by Wealth Quintile (mean)") ///
>  addnotes("Notes: Wealth is defined as total assests net total debt." ///
>           "       HHs. with asset on residential building that used as dwelling is defined as owning dwelli
> ng")

Table 0.1 Summary Statistics of Assets and Liabilities by Wealth Quintile (mean)
-------------------------------------------------------------------------------------------------------------
> ---------
                                                  (1)          (2)          (3)          (4)          (5)    
>       (6)
                                                  All           Q1           Q2           Q3           Q4    
>        Q5
-------------------------------------------------------------------------------------------------------------
> ---------
Average HH. Assets                          1,500,276       65,721      203,237      469,666    1,043,375    
> 5,720,419
Average Assets for HHs. Owning Assets       1,534,103       73,861      203,237      469,666    1,043,375    
> 5,720,419
Own Asset (%)                                      98           89          100          100          100    
>       100
Average HH. Debt                               49,879       44,889       15,400       22,172       43,782    
>   123,169
Average Debt for Indebted HHs.                179,990      201,538       60,585       80,078      140,310    
>   385,122
Own Debt (%)                                       28           22           25           28           31    
>        32
Dwelling Ownership (%)                             81           41           88           90           93    
>        93
Urban Household (%)                                35           45           19           25           33    
>        52
Household Size                                      4            3            4            5            5    
>         5
Female Household Head (%)                          14           20           15           13           12    
>        10
Household Head Age                                 46           38           45           46           49    
>        52
-------------------------------------------------------------------------------------------------------------
> ---------
Observations                                  110,800       17,520       20,700       22,102       24,049    
>    26,429
-------------------------------------------------------------------------------------------------------------
> ---------
Notes: Wealth is defined as total assests net total debt.
       HHs. with asset on residential building that used as dwelling is defined as owning dwelling

. 
. esttab total q1 q2 q3 q4 q5, cells(p50(fmt(%15.0fc))) label collabels(none) varwidth(40) ///
>  mtitles("All" "Q1" "Q2" "Q3" "Q4" "Q5") stats(N, label("Observations") fmt(%15.0gc)) ///
>  title("Table 0.2 Summary Statistics of Assets and Liabilities by Wealth Quintile (med)") ///
>  addnotes("Notes: Wealth is defined as total assests net total debt." ///
>           "       HHs. with asset on residential building that used as dwelling is defined as owning dwelli
> ng")

Table 0.2 Summary Statistics of Assets and Liabilities by Wealth Quintile (med)
-------------------------------------------------------------------------------------------------------------
> ---------
                                                  (1)          (2)          (3)          (4)          (5)    
>       (6)
                                                  All           Q1           Q2           Q3           Q4    
>        Q5
-------------------------------------------------------------------------------------------------------------
> ---------
Average HH. Assets                            459,330       43,250      195,000      452,400      989,000    
> 3,164,190
Average Assets for HHs. Owning Assets         478,150       50,000      195,000      452,400      989,000    
> 3,164,190
Own Asset (%)                                     100          100          100          100          100    
>       100
Average HH. Debt                                    0            0            0            0            0    
>         0
Average Debt for Indebted HHs.                 52,000       49,375       26,750       36,000       55,000    
>   150,000
Own Debt (%)                                        0            0            0            0            0    
>         0
Dwelling Ownership (%)                            100            0          100          100          100    
>       100
Urban Household (%)                                 0            0            0            0            0    
>       100
Household Size                                      4            3            4            4            5    
>         5
Female Household Head (%)                           0            0            0            0            0    
>         0
Household Head Age                                 45           35           42           45           48    
>        51
-------------------------------------------------------------------------------------------------------------
> ---------
Observations                                  110,800       17,520       20,700       22,102       24,049    
>    26,429
-------------------------------------------------------------------------------------------------------------
> ---------
Notes: Wealth is defined as total assests net total debt.
       HHs. with asset on residential building that used as dwelling is defined as owning dwelling

.  
. ****************************************************************************
. * Housing mortgage loan features
. ****************************************************************************
. use "${r_input}\Visit 1_Block 14",clear

. drop if b14_q1 == "99" //drop the total amount
(73,266 observations deleted)

. 
. *debt, borrowed amount, repay amount.
. gen debt = b14_q17 //outstanding amout at end of June 2012
(47,671 missing values generated)

. gen debt_todt = b14_q16 //outstanding amout at the date of survey
(1,688 missing values generated)

. gen borrow = b14_q5 //original borrowed amount
(1 missing value generated)

. gen repay = b14_q14 //amount (`) repaid (including interest) during 01.07.2012 to date of survey
(43,996 missing values generated)

. 
. *** Two housing mortgage definitions 
. tab b14_q12

    Type of |
   security |      Freq.     Percent        Cum.
------------+-----------------------------------
         01 |      6,806        6.16        6.16
         02 |      1,577        1.43        7.59
         03 |      4,251        3.85       11.44
         04 |     15,648       14.17       25.61
         05 |      9,400        8.51       34.12
         06 |      1,018        0.92       35.04
         07 |        304        0.28       35.32
         08 |      2,121        1.92       37.24
         09 |      4,111        3.72       40.96
         10 |     65,201       59.04      100.00
------------+-----------------------------------
      Total |    110,437      100.00

. gen secure_type = b14_q12
(6 missing values generated)

. 
. tab b14_q11

 Purpose of |
       loan |      Freq.     Percent        Cum.
------------+-----------------------------------
         01 |      6,886        6.24        6.24
         02 |     13,660       12.37       18.60
         03 |      6,167        5.58       24.19
         04 |      4,227        3.83       28.02
         05 |         66        0.06       28.08
         06 |      1,876        1.70       29.77
         07 |        200        0.18       29.95
         08 |      3,707        3.36       33.31
         09 |      7,998        7.24       40.55
         10 |     10,068        9.12       49.67
         11 |     17,313       15.68       65.35
         12 |     38,271       34.65      100.00
------------+-----------------------------------
      Total |    110,439      100.00

. gen loan_purpose = b14_q11
(4 missing values generated)

. 
. * (A) Conservative (label 1)housing loan with immovable property as secure type: B14_Q11 == 11 & (B14_Q12 =
> = 3 | B14_Q12 == 4)
. gen mrtg_1_dm = (loan_purpose == "11" & (secure_type == "04"|secure_type == "03"))

. 
. * (B) Less conservative (let's label 2) housing loan with mortgage: B14_Q11 == 11 & B14_13 != 4
. gen mrtg_2_dm = (loan_purpose == "11" & (b14_q13 != "4"& b14_q13 != ""))

. 
. *** Housing mortgage features 
. 
. *aggregate at household level. 
. egen double debt_total = sum(debt),by(HHID)

. egen double borrow_total = sum(borrow),by(HHID)

. 
. *** Other laon features
. tab b14_q3 [aw = Weight_SS]

    Date of |
borrowing - |
       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1972 | .068661433        0.00        0.00
       1973 | .166560667        0.00        0.00
       1975 | .258793759        0.00        0.00
       1978 | .172179566        0.00        0.00
       1979 |  .37915914        0.00        0.00
       1980 |  .42355915        0.00        0.00
       1981 | .109710261        0.00        0.00
       1982 | .206973275        0.00        0.00
       1983 | .487978062        0.00        0.00
       1984 | 5.39291459        0.00        0.01
       1985 | 4.92282315        0.00        0.01
       1986 | .921260049        0.00        0.01
       1987 | 2.81837543        0.00        0.01
       1988 | 4.37699311        0.00        0.02
       1989 | 11.2401726        0.01        0.03
       1990 | 12.1221539        0.01        0.04
       1991 | 1.90042562        0.00        0.04
       1992 | 24.9979048        0.02        0.06
       1993 | 22.4553342        0.02        0.08
       1994 | 22.8229468        0.02        0.11
       1995 | 32.7070057        0.03        0.13
       1996 | 35.8474002        0.03        0.17
       1997 |32.74288922        0.03        0.20
       1998 | 112.428431        0.10        0.30
       1999 | 89.8188925        0.08        0.38
       2000 | 217.964276        0.20        0.58
       2001 |  193.72347        0.18        0.75
       2002 | 270.489796        0.24        1.00
       2003 | 326.364678        0.30        1.29
       2004 |472.6414318        0.43        1.72
       2005 | 777.277254        0.70        2.43
       2006 | 1,064.5175        0.96        3.39
       2007 | 1,608.6038        1.46        4.85
       2008 | 2,797.3929        2.53        7.38
       2009 | 4,171.3465        3.78       11.16
       2010 | 8,215.2498        7.44       18.59
       2011 |  15,592.81       14.12       32.71
       2012 | 54,426.567       49.28       82.00
       2013 | 19,884.262       18.00      100.00
------------+-----------------------------------
      Total |    110,439      100.00

. tab b14_q2 [aw = Weight_SS]

    Date of |
borrowing - |
      month |      Freq.     Percent        Cum.
------------+-----------------------------------
         01 |  11,816.98       10.70       10.70
         02 | 10,230.102        9.26       19.96
         03 | 10,607.117        9.61       29.57
         04 | 12,278.078       11.12       40.69
         05 | 11,572.801       10.48       51.17
         06 | 11,191.734       10.13       61.30
         07 |8,320.24461        7.53       68.84
         08 | 9,180.2643        8.31       77.15
         09 | 5,802.3886        5.25       82.40
         10 | 6,636.2567        6.01       88.41
         11 | 6,369.0017        5.77       94.18
         12 | 6,428.0317        5.82      100.00
------------+-----------------------------------
      Total |    110,433      100.00

. 
. *interest rate and type
. gen intst_rate = b14_q10/100/12
(539 missing values generated)

. gen intst_type = b14_q9
(34 missing values generated)

. sum intst_rate [aw = Weight_SS],de

                         intst_rate
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs             109,904
25%         .005              0       Sum of Wgt.   349416471

50%          .01                      Mean           .0152051
                        Largest       Std. Dev.      .0195639
75%          .02             .2
90%          .03             .2       Variance       .0003827
95%          .05              1       Skewness       71.32512
99%           .1            4.5       Kurtosis       16004.17

. replace intst_rate  = . if intst_rate > r(p95)
(1,481 real changes made, 1,481 to missing)

. 
. *loan borrowing date. 
. gen month = real(b14_q2)
(10 missing values generated)

. gen year = b14_q3
(4 missing values generated)

. 
. gen date_loan = ym(year,month)
(10 missing values generated)

. format date_loan %tmMCY

. 
. merge m:1 HHID using "${root}\Data Output Files\NSS70_All.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                        37,081
        from master                         0  (_merge==1)
        from using                     37,081  (_merge==2)

    matched                           110,443  (_merge==3)
    -----------------------------------------

. 
. gen loan_age = date_survey - date_loan //laon from borrow to date of survey, in month.
(37,091 missing values generated)

. replace loan_age = . if loan_age < 0 
(198 real changes made, 198 to missing)

. 
. sum loan_age [aw = Weight_SS],de

                          loan_age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            2              0       Obs             110,235
25%            5              0       Sum of Wgt.   350170108

50%           11                      Mean           18.56219
                        Largest       Std. Dev.      24.56695
75%           23            421
90%           44            457       Variance       603.5353
95%           63            476       Skewness        3.76297
99%          123            491       Kurtosis       25.40451

. replace loan_age  = . if loan_age > r(p99)
(1,477 real changes made, 1,477 to missing)

. 
. *houseing mortgage amount
. foreach var in debt debt_todt borrow {
  2.   replace `var' = 0 if mi(`var')
  3. }
(84,752 real changes made)
(38,769 real changes made)
(37,082 real changes made)

. 
. forvalues i = 1/2 {
  2.   foreach var in debt debt_todt borrow repay{
  3.   replace mrtg_`i'_dm = 0 if mi(mrtg_`i'_dm)
  4.   gen mrtg_`i'_`var' = mrtg_`i'_dm*`var'
  5.   }
  6. }
(37,081 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(81,077 missing values generated)
(37,081 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(81,077 missing values generated)

. 
. mdesc mrtg_*

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
      mrtg_1_dm |           0        147,524           0.00
      mrtg_2_dm |           0        147,524           0.00
    mrtg_1_debt |           0        147,524           0.00
   mrtg_1_de~dt |           0        147,524           0.00
   mrtg_1_bor~w |           0        147,524           0.00
   mrtg_1_repay |      81,077        147,524          54.96
    mrtg_2_debt |           0        147,524           0.00
   mrtg_2_de~dt |           0        147,524           0.00
   mrtg_2_bor~w |           0        147,524           0.00
   mrtg_2_repay |      81,077        147,524          54.96
----------------+-----------------------------------------------

. 
. *household feature
. replace urban = urban*100 
(64,079 real changes made)

. 
. *monthly payment. 
. gen date_temp = ym(2012,7)

. gen repay_mt = date_survey - date_temp //01.07.2012 to date of survey

. 
. drop date_temp

. tab repay_mt 

   repay_mt |      Freq.     Percent        Cum.
------------+-----------------------------------
          6 |     18,053       12.24       12.24
          7 |     22,264       15.09       27.33
          8 |     23,828       16.15       43.48
          9 |     20,417       13.84       57.32
         10 |     23,984       16.26       73.58
         11 |     22,178       15.03       88.61
         12 |     16,624       11.27       99.88
         13 |        130        0.09       99.97
         14 |         18        0.01       99.98
         15 |         28        0.02      100.00
------------+-----------------------------------
      Total |    147,524      100.00

. 
. forvalues i=1/2  {
  2. gen double repay_mt_`i' = mrtg_`i'_repay/repay_mt //monthly payment calculation
  3. }
(81,077 missing values generated)
(81,077 missing values generated)

. 
. forvalues i = 1/2 {
  2. mdesc repay_mt_`i' repay_mt mrtg_`i'_repay //check missing values. 54% on repay information
  3. }

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
     repay_mt_1 |      81,077        147,524          54.96
       repay_mt |           0        147,524           0.00
   mrtg_1_repay |      81,077        147,524          54.96
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
     repay_mt_2 |      81,077        147,524          54.96
       repay_mt |           0        147,524           0.00
   mrtg_2_repay |      81,077        147,524          54.96
----------------+-----------------------------------------------

. 
. *loan period estimation 
. forvalues i = 1/2 {
  2. gen double loan_period_`i'= - ln(1 - mrtg_`i'_borrow *intst_rate * (1/repay_mt_`i')) / ln(1+ intst_rate)
  3. sum loan_period_`i' [aw = Weight_SS],de
  4. replace loan_period_`i' = . if loan_period_`i' > r(p99) //exclude the ourliers 
  5. }
(144,269 missing values generated)

                        loan_period_1
-------------------------------------------------------------
      Percentiles      Smallest
 1%      7.53366       2.339866
 5%     15.58093       2.729418
10%     26.20565       3.229259       Obs               3,255
25%     53.33976        3.26585       Sum of Wgt.   8,081,192

50%     102.8545                      Mean           163.7759
                        Largest       Std. Dev.      272.9406
75%     179.0596       2307.234
90%     264.3022       3532.073       Variance       74496.56
95%      371.063       3532.073       Skewness        5.84224
99%      1770.43       3813.385       Kurtosis       46.18742
(11 real changes made, 11 to missing)
(143,571 missing values generated)

                        loan_period_2
-------------------------------------------------------------
      Percentiles      Smallest
 1%      6.69942       2.339866
 5%     11.78581       2.729418
10%     22.08141       3.050778       Obs               3,953
25%     48.85596       3.229259       Sum of Wgt.   9,947,052

50%     97.10983                      Mean           170.1287
                        Largest       Std. Dev.      296.2969
75%     174.4078       2357.645
90%     272.3213       3532.073       Variance       87791.83
95%     450.2782       3532.073       Skewness       5.077065
99%      1770.43       3813.385       Kurtosis       34.51334
(17 real changes made, 17 to missing)

. 
. sum loan_period_*

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
loan_perio~1 |      3,244    145.3515    193.6086   2.339866    1770.43
loan_perio~2 |      3,936    145.2648    212.1959   2.339866    1770.43

. 
. forvalues i = 1/2 {
  2. mdesc loan_period_`i' mrtg_`i'_borrow intst_rate repay_mt_`i' if mrtg_`i'_borrow > 0  //check missing va
> lue: 97% loan period missing. 
  3. }

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
   loan_perio~1 |       1,699          4,943          34.37
   mrtg_1_bor~w |           0          4,943           0.00
     intst_rate |           6          4,943           0.12
     repay_mt_1 |         632          4,943          12.79
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
   loan_perio~2 |       2,977          6,913          43.06
   mrtg_2_bor~w |           0          6,913           0.00
     intst_rate |          11          6,913           0.16
     repay_mt_2 |       1,472          6,913          21.29
----------------+-----------------------------------------------

. 
. 
. *the loan is subsidized 
. gen loan_sub = (b14_q7 != "09")*100 

. 
. *label variables
. label var urban "Urban Household (%)"

. label var hhsize "Household Size"

. label var head_age "Household Head Age"

. label var head_female "Female Household Head (%)"

. label var loan_sub "Subsidized (%)"

. 
. save "${r_output}\b14_hse_mortgage",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Data Output Files\b14_hse_mortgage.
> dta saved

. 
. ***********************************************
. ***Table 1. Homewoners
. ***********************************************
. use "${r_output}\b14_hse_mortgage",clear

. 
. //keep if building_dwelling > 0 //only focus on home owner.
. 
. foreach type in mrtg_1_dm mrtg_2_dm mrtg_1_debt mrtg_2_debt mrtg_1_borrow mrtg_2_borrow mrtg_1_repay mrtg_2
> _repay{ 
  2. egen double total_`type' = sum(`type'), by(HHID)
  3. } 

. 
. bys HHID: keep if _n == 1 // keep only one observation for each HH
(36,724 observations deleted)

. 
. /* Table Content:
> a. Value of Residential Real Estate where HH is Dwelling
> b. Value of Land Associated with #a
> c. Value of Building with #a
> d. Size in square of feet of building of #a
> e. Total assets of these people (median median) //using as quintile. 
> f. Percent of assets of residential RE in total assets 
> g) Who are these people? (i) urban, (ii) hh size, (iii) gender, (iv) age
> h. How many (%) of these had a mortgage (paid off) /Mortgage holders
> */
. 
. *Variables to generate
. replace building_dwelling_area = building_dwelling_area*10.76 //change unit from sq me to sq ft
variable building_dwelling_area was int now float
(91,985 real changes made)

. 
. gen double real_estate_dwelling_share = real_estate_dwelling/asset*100 //f. Percent of assets of residentia
> l RE in total assets 
(1,198 missing values generated)

. 
. gen double land_re_share = land_resid/real_estate_dwelling*100 //percent of land to RE value
(17,442 missing values generated)

. 
. gen double dwell_sqft = building_dwelling/building_dwelling_area*100 //value of dwelling per sq.ft
(18,815 missing values generated)

. 
. forvalues i=1/2  {
  2. gen total_mrtg_`i' = (total_mrtg_`i'_dm > 0)*100 //h. How many (%) of these had a mortgage during the su
> rvey period. 
  3. }

. 
. *label the key variables
. label var real_estate_dwelling "Value of Residential Real Estate"

. label var land_resid "Value of Land Associated"

. label var land_re_share "Residential land in RE asset (%)"

. label var building_dwelling "Value of Building"

. label var building_dwelling_area "Size of Dwelling in sq. ft"

. label var dwell_sqft "Value of dwelling per sq.ft (%)"

. label var asset "Total asset"

. label var real_estate_dwelling_share "Residential RE in Total Assets (%)"

. label var total_mrtg_1 "Mortgage Holders_1 (%)"

. label var total_mrtg_2 "Mortgage Holders_2 (%)"

. 
. 
. *create the table 
. global var_tab_1 "real_estate_dwelling land_resid land_re_share building_dwelling building_dwelling_area dw
> ell_sqft real_estate_dwelling_share urban hhsize head_female head_age total_mrtg_1 total_mrtg_2"

. 
. gen homeowner = (building_dwelling > 0 )*100

. 
. mdesc $var_tab_1  //check missing values 

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
   real_estat~g |           0        110,800           0.00
     land_resid |           0        110,800           0.00
   land_re_sh~e |      17,442        110,800          15.74
   building_d~g |           0        110,800           0.00
   building_d~a |      15,312        110,800          13.82
     dwell_sqft |      18,815        110,800          16.98
   real_esta~re |       1,198        110,800           1.08
          urban |           0        110,800           0.00
         hhsize |           0        110,800           0.00
    head_female |           0        110,800           0.00
       head_age |           0        110,800           0.00
   total_mrtg_1 |           0        110,800           0.00
   total_mrtg_2 |           0        110,800           0.00
----------------+-----------------------------------------------

. 
. foreach var in $var_tab_1  {
  2. replace `var' = . if building_dwelling == 0 | mi(building_dwelling) //only focus on home owner.
  3. }
(18,737 real changes made, 18,737 to missing)
(18,737 real changes made, 18,737 to missing)
(1,295 real changes made, 1,295 to missing)
(18,737 real changes made, 18,737 to missing)
(3,425 real changes made, 3,425 to missing)
(14 real changes made, 14 to missing)
(17,539 real changes made, 17,539 to missing)
(18,737 real changes made, 18,737 to missing)
(18,737 real changes made, 18,737 to missing)
(18,737 real changes made, 18,737 to missing)
(18,737 real changes made, 18,737 to missing)
(18,737 real changes made, 18,737 to missing)
(18,737 real changes made, 18,737 to missing)

. 
. mdesc $var_tab_1 //check missing valuee

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
   real_estat~g |      18,737        110,800          16.91
     land_resid |      18,737        110,800          16.91
   land_re_sh~e |      18,737        110,800          16.91
   building_d~g |      18,737        110,800          16.91
   building_d~a |      18,737        110,800          16.91
     dwell_sqft |      18,829        110,800          16.99
   real_esta~re |      18,737        110,800          16.91
          urban |      18,737        110,800          16.91
         hhsize |      18,737        110,800          16.91
    head_female |      18,737        110,800          16.91
       head_age |      18,737        110,800          16.91
   total_mrtg_1 |      18,737        110,800          16.91
   total_mrtg_2 |      18,737        110,800          16.91
----------------+-----------------------------------------------

. 
. gen owner = (building_dwelling > 0 & !mi(building_dwelling))*100

. tab owner //obvservations with none of the value mssing. 

      owner |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     18,737       16.91       16.91
        100 |     92,063       83.09      100.00
------------+-----------------------------------
      Total |    110,800      100.00

. label var owner "Home Ownership (%)"

. 
. qui eststo total : estpost summarize $var_tab_1 owner [aw = hhwgt],de

. forvalues i = 1/5 {
  2. eststo q`i' : estpost summarize $var_tab_1 owner [aw = hhwgt] if qtl == `i',de
  3. }

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
real_estat~g |      7467   3.91e+07   76634.72   8.99e+10   299778.5   39.15154   2396.634   2.99e+12 
  land_resid |      7467   3.91e+07   28804.96   1.59e+10   126055.3   78.54951    11006.4   1.13e+12 
land_re_sh~e |      7467   3.91e+07   37.88381   481.1712   21.93561   .1970409    2.37877   1.48e+09 
building_d~g |      7467   3.91e+07   47829.77   3.76e+10   193840.6   30.10737   1057.884   1.87e+12 
building_d~a |      7467   3.91e+07   371.3216   140838.8   375.2849   7.225453   126.0444   1.45e+10 
  dwell_sqft |      7444   3.90e+07      16796   1.09e+09    33026.9   20.46288   615.3334   6.55e+11 
real_esta~re |      7467   3.91e+07   77.11732   470.5207   21.69149  -1.020772   3.339948   3.01e+09 
       urban |      7467   3.91e+07   6.410125   600.0032   24.49496   3.559327   13.66881   2.50e+08 
      hhsize |      7467   3.91e+07   3.947864   3.723953   1.929755   .6654757   4.441319   1.54e+08 
 head_female |      7467   3.91e+07   17.44244   1440.198   37.94994   1.715931    3.94442   6.81e+08 
    head_age |      7467   3.91e+07   43.43885   209.9419   14.48937   .5931253   2.559566   1.70e+09 
total_mrtg_1 |      7467   3.91e+07   1.105505    109.343   10.45672    9.35241   88.46758   4.32e+07 
total_mrtg_2 |      7467   3.91e+07   1.736147   170.6234   13.06229   7.390296   55.61647   6.78e+07 
       owner |     17520   9.59e+07   40.70985   2413.831   49.13075   .3781916   1.143029   3.91e+09 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
real_estat~g |      1000   3.00e+07       8750      15000      22000      35000      55000      75000 
  land_resid |         0   2.00e+07          0        700       3045       9000      20000      32000 
land_re_sh~e |         0   98.03922          0   1.960784   9.090909    20.2454       37.5   54.54545 
building_d~g |       500   1.00e+07       3500       8000      10000      20000      30000      48300 
building_d~a |         0      14526       53.8      96.84     118.36      161.4        269      430.4 
  dwell_sqft |  61.95787    1467423   988.6894   2065.262   2904.275    5808.55   10723.48   20652.62 
real_esta~re |  .8297894        100   13.06165   32.87311   43.94977   63.98104   83.33333    95.2381 
       urban |         0        100          0          0          0          0          0          0 
      hhsize |         1         30          1          1          2          2          4          5 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |         5        100         20         25         26         32         40         55 
total_mrtg_1 |         0        100          0          0          0          0          0          0 
total_mrtg_2 |         0        100          0          0          0          0          0          0 
       owner |         0        100          0          0          0          0          0        100 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
real_estat~g |     96000     140000     400000 
  land_resid |     50000      60000     140000 
land_re_sh~e |  66.66667   75.75758   88.23529 
building_d~g |     70000     100000     250000 
building_d~a |    710.16     946.88     1721.6 
  dwell_sqft |  32801.22   44144.98    90491.1 
real_esta~re |  99.73753        100        100 
       urban |         0        100        100 
      hhsize |         6          7          9 
 head_female |       100        100        100 
    head_age |        65         70         80 
total_mrtg_1 |         0          0        100 
total_mrtg_2 |         0          0        100 
       owner |       100        100        100 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
real_estat~g |     17728   8.42e+07   137157.6   5.19e+09   72074.98   3.095476   61.34073   1.15e+13 
  land_resid |     17728   8.42e+07      52175   2.07e+09   45532.69   1.830308   10.38501   4.39e+12 
land_re_sh~e |     17728   8.42e+07   36.81133   479.9447   21.90764   .3656375   2.451853   3.10e+09 
building_d~g |     17728   8.42e+07    84982.6   3.19e+09   56471.56   3.508932    60.3064   7.16e+12 
building_d~a |     17728   8.42e+07   502.9033   220862.7   469.9603   8.193042   234.7577   4.23e+10 
  dwell_sqft |     17701   8.41e+07    25086.8   5.59e+08    23653.6    3.57116   28.71418   2.11e+12 
real_esta~re |     17728   8.42e+07   68.57666   644.2262   25.38161  -.4836316   2.030494   5.77e+09 
       urban |     17728   8.42e+07   11.07743   985.0888   31.38613   2.480311   7.151941   9.33e+08 
      hhsize |     17728   8.42e+07   4.345231   3.972575   1.993132   .8661168   4.803171   3.66e+08 
 head_female |     17728   8.42e+07   15.60319   1316.934   36.28958   1.895739   4.593826   1.31e+09 
    head_age |     17728   8.42e+07   45.21334   186.6183   13.66083   .5440515   2.785346   3.81e+09 
total_mrtg_1 |     17728   8.42e+07   .6315829   62.76293   7.922306   12.46349   156.3387   5.32e+07 
total_mrtg_2 |     17728   8.42e+07   1.176938   116.3152   10.78495   9.054177   82.97813   9.91e+07 
       owner |     20700   9.59e+07   87.80406   1070.905   32.72468  -2.310486   6.338348   8.42e+09 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
real_estat~g |       800    2925000      24000      45000      60000      90000     125000     180000 
  land_resid |         0    1400000          0       4000       8000      20000      40000      75000 
land_re_sh~e |         0     99.631          0   4.397706   9.090909   18.82353   35.48387   52.63158 
building_d~g |       500    2400000      10000      20000      30000      48000      75000     100000 
building_d~a |         0    30773.6      86.08     129.12      161.4     247.48     398.12      591.8 
  dwell_sqft |  111.8037     464684   1659.586   3872.367   5789.506   10138.56   18966.69   31864.05 
real_esta~re |  .2374912        100   12.37875   23.45059   31.17048   47.80876   74.00257   91.86017 
       urban |         0        100          0          0          0          0          0          0 
      hhsize |         1         18          1          2          2          3          4          5 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        16        110         22         26         30         35         43         55 
total_mrtg_1 |         0        100          0          0          0          0          0          0 
total_mrtg_2 |         0        100          0          0          0          0          0          0 
       owner |         0        100          0          0          0        100        100        100 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
real_estat~g |    230000     252800     313000 
  land_resid |    108000     150000     200000 
land_re_sh~e |  66.66667   76.19048         90 
building_d~g |    150000     200000     250000 
building_d~a |    936.12     1291.2       2152 
  dwell_sqft |   50692.8   67843.87   114383.8 
real_esta~re |  98.24748   99.42363        100 
       urban |       100        100        100 
      hhsize |         7          8         10 
 head_female |       100        100        100 
    head_age |        65         70         80 
total_mrtg_1 |         0          0          0 
total_mrtg_2 |         0          0        100 
       owner |       100        100        100 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
real_estat~g |     19935   8.66e+07   262622.9   2.34e+10   153014.3   2.091353   32.87099   2.27e+13 
  land_resid |     19935   8.66e+07    99177.2   9.87e+09   99327.04   1.756308   8.089129   8.59e+12 
land_re_sh~e |     19935   8.66e+07    35.6766   522.0416   22.84823   .4111343   2.371849   3.09e+09 
building_d~g |     19935   8.66e+07   163445.7   1.31e+10   114350.5   3.833185   92.04689   1.42e+13 
building_d~a |     19935   8.66e+07   646.8413   346523.8   588.6627   6.635625   138.5895   5.60e+10 
  dwell_sqft |     19920   8.66e+07   37895.97   1.68e+09    40991.4   8.166284   231.9693   3.28e+12 
real_esta~re |     19935   8.66e+07   56.63024   788.3421   28.07743   .0191817    1.68804   4.91e+09 
       urban |     19935   8.66e+07   18.45953   1505.274   38.79786   1.625928   3.643641   1.60e+09 
      hhsize |     19935   8.66e+07     4.6897   4.580582   2.140229   1.396645   9.268834   4.06e+08 
 head_female |     19935   8.66e+07   12.82167   1117.828   33.43393   2.224044   5.946372   1.11e+09 
    head_age |     19935   8.66e+07   46.50749   174.6704   13.21629   .4408982   2.654644   4.03e+09 
total_mrtg_1 |     19935   8.66e+07   1.338945   132.1083   11.49384   8.467542   72.69927   1.16e+08 
total_mrtg_2 |     19935   8.66e+07   2.190851    214.296   14.63885   6.531981   43.66677   1.90e+08 
       owner |     22102   9.60e+07   90.25593   879.4996   29.65636  -2.714888   8.370617   8.66e+09 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
real_estat~g |      1000    4500000      35000      65800      90000     144000     245000     356000 
  land_resid |         0    1600000          0       5000      10800      27600      60000     150000 
land_re_sh~e |         0   99.90917          0   3.314917   6.404287   16.66667   33.33333   51.11111 
building_d~g |       500    4500000      15000      34819      48825      80000     150000     220000 
building_d~a |         0    35023.8      107.6      161.4      215.2      322.8     494.96     796.24 
  dwell_sqft |  162.6394    3252788   2294.736   4792.054   7148.985   13814.93   27881.04   48681.18 
real_esta~re |  .2499479        100   7.324068   14.33007   19.86974   31.84713   54.96183   83.57159 
       urban |         0        100          0          0          0          0          0          0 
      hhsize |         1         38          1          2          2          3          4          6 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        15        101         23         27         30         36         45         55 
total_mrtg_1 |         0        100          0          0          0          0          0          0 
total_mrtg_2 |         0        100          0          0          0          0          0          0 
       owner |         0        100          0          0        100        100        100        100 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
real_estat~g |    460000     530000     620000 
  land_resid |    250000     300000     418500 
land_re_sh~e |  67.36292    76.4526   90.72165 
building_d~g |    300000     375000     500000 
building_d~a |   1194.36       1614       2690 
  dwell_sqft |  79925.65   103263.1   185873.6 
real_esta~re |   95.6057   98.33333    99.9001 
       urban |       100        100        100 
      hhsize |         7          8         12 
 head_female |       100        100        100 
    head_age |        65         70         80 
total_mrtg_1 |         0          0        100 
total_mrtg_2 |         0          0        100 
       owner |       100        100        100 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
real_estat~g |     22187   8.90e+07   539233.9   1.37e+11   370607.2   1.450927   10.59223   4.80e+13 
  land_resid |     22187   8.90e+07   216955.2   6.02e+10   245356.7   2.010154   9.347307   1.93e+13 
land_re_sh~e |     22187   8.90e+07   37.26211   570.6756   23.88882   .3299513   2.198219   3.32e+09 
building_d~g |     22187   8.90e+07   322278.7   6.75e+10   259903.8   2.351892   20.84999   2.87e+13 
building_d~a |     22187   8.90e+07   786.1235   984347.7    992.143   39.88284   3393.128   7.00e+10 
  dwell_sqft |     22176   8.90e+07   68290.52   1.99e+10   140920.1   12.01601   224.4971   6.08e+12 
real_esta~re |     22187   8.90e+07   51.87042   903.4583   30.05758   .1861991   1.622113   4.62e+09 
       urban |     22187   8.90e+07   28.72114   2047.302   45.24713    .940583   1.884696   2.56e+09 
      hhsize |     22187   8.90e+07   4.983967   5.659438   2.378957   1.516325   8.321434   4.44e+08 
 head_female |     22187   8.90e+07   11.92835   1050.597   32.41292   2.349218   6.518826   1.06e+09 
    head_age |     22187   8.90e+07   49.38593    174.282   13.20159   .3373413   2.695587   4.40e+09 
total_mrtg_1 |     22187   8.90e+07   2.875078   279.2543    16.7109   5.640148   32.81127   2.56e+08 
total_mrtg_2 |     22187   8.90e+07   4.181623   400.6944   20.01735   4.577969    21.9578   3.72e+08 
       owner |     24049   9.59e+07   92.87102   662.1036   25.73137  -3.332267   12.10401   8.90e+09 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
real_estat~g |      4500    5963000      55000     101800     140000     240000     462192     775000 
  land_resid |         0    3500000          0       7500      16800      45000     120000     300000 
land_re_sh~e |         0    99.8004          0   2.200489   6.616239   17.24138   34.88372   55.55556 
building_d~g |       120    5500000      25000      50000      75000     139400     250000     450000 
building_d~a |         0     104867      96.84     193.68     247.48     398.12     624.08      914.6 
  dwell_sqft |  9.293681    3485130   2859.594   6591.262   10047.22   20425.67   41305.24   72284.18 
real_esta~re |  .5171225        100    4.92331   10.50103   14.79734   25.07599   46.45401   82.21549 
       urban |         0        100          0          0          0          0          0        100 
      hhsize |         1         32          1          2          2          3          5          6 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        13        102         24         30         33         40         48         60 
total_mrtg_1 |         0        100          0          0          0          0          0          0 
total_mrtg_2 |         0        100          0          0          0          0          0          0 
       owner |         0        100          0          0        100        100        100        100 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
real_estat~g |   1050000    1214600    1480000 
  land_resid |    560000     750000    1046250 
land_re_sh~e |  71.42857   79.99991   90.90909 
building_d~g |    669600     800000    1200000 
building_d~a |   1355.76    1796.92    3593.84 
  dwell_sqft |  123915.7   181340.1     633660 
real_esta~re |  94.97965   97.71698   99.82692 
       urban |       100        100        100 
      hhsize |         8          9         13 
 head_female |       100        100        100 
    head_age |        67         72         82 
total_mrtg_1 |         0          0        100 
total_mrtg_2 |         0          0        100 
       owner |       100        100        100 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
real_estat~g |     24746   8.96e+07    2904116   7.48e+14   2.74e+07   54.04563   3232.359   2.60e+14 
  land_resid |     24746   8.96e+07    1140934   9.89e+13    9947061   116.9908   14918.42   1.02e+14 
land_re_sh~e |     24746   8.96e+07   41.23595   703.7526   26.52834   .1398678   2.045214   3.69e+09 
building_d~g |     24746   8.96e+07    1763181   6.27e+14   2.50e+07   60.37883    4035.34   1.58e+14 
building_d~a |     24746   8.96e+07   1080.632    1265911   1125.127   18.50142   880.5023   9.68e+10 
  dwell_sqft |     24730   8.96e+07     183970   6.31e+11   794632.5   37.55801   2162.265   1.65e+13 
real_esta~re |     24746   8.96e+07   49.04199    1131.46   33.63719   .1549149   1.467229   4.39e+09 
       urban |     24746   8.96e+07   49.89455    2500.09    50.0009   .0042179   1.000018   4.47e+09 
      hhsize |     24746   8.96e+07   5.085172   6.622623   2.573446   1.842898   10.55366   4.56e+08 
 head_female |     24746   8.96e+07   10.02797   902.2736   30.03787   2.661496   8.083561   8.98e+08 
    head_age |     24746   8.96e+07   52.43729   166.1658   12.89053   .2013257   2.591044   4.70e+09 
total_mrtg_1 |     24746   8.96e+07   6.799423   633.7357   25.17411   3.432213   12.78009   6.09e+08 
total_mrtg_2 |     24746   8.96e+07   8.089904   743.5739   27.26855    3.07394   10.44911   7.25e+08 
       owner |     26429   9.59e+07   93.40572   615.9664   24.81867  -3.497894   13.23527   8.96e+09 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
real_estat~g |      4200   1.85e+09      80000     178400     270000     578000    1451790    2650000 
  land_resid |         0   1.28e+09          0          0      17004      97402     400000    1200000 
land_re_sh~e |         0   99.81796          0          0   3.614458   19.73271    40.0859   61.07156 
building_d~g |      2000   1.85e+09      40000      85000     150000     300000     660000    1460000 
building_d~a |         0    70047.6     139.88     247.48     355.08     559.52     893.08    1301.96 
  dwell_sqft |   464.684   5.65e+07   4040.731   10434.52    16897.6   36510.89   74349.44   148698.9 
real_esta~re |  .1288436        100   2.102804   4.936866   7.881995   16.65073   44.04727   84.34354 
       urban |         0        100          0          0          0          0          0        100 
      hhsize |         1         36          1          2          2          3          5          6 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        13        100         26         32         36         43         52         62 
total_mrtg_1 |         0        100          0          0          0          0          0          0 
total_mrtg_2 |         0        100          0          0          0          0          0          0 
       owner |         0        100          0          0        100        100        100        100 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
real_estat~g |   5000000    7130000   1.75e+07 
  land_resid |   2400000    4000000    9759795 
land_re_sh~e |  79.06977   86.53846     94.375 
building_d~g |   2500000    4350000    9728000 
building_d~a |   1893.76    2399.48    4497.68 
  dwell_sqft |  319470.3   557620.8    1822290 
real_esta~re |  95.43889   97.58063   99.58506 
       urban |       100        100        100 
      hhsize |         8         10         14 
 head_female |       100        100        100 
    head_age |        70         75         83 
total_mrtg_1 |         0        100        100 
total_mrtg_2 |         0        100        100 
       owner |       100        100        100 

. 
. esttab total q1 q2 q3 q4 q5, cells(mean(fmt(%15.0fc))) label collabels(none) ///
>  mtitles("All" "Q1" "Q2" "Q3" "Q4" "Q5") stats(N, label("Observations") fmt(%15.0gc)) /// 
>  title("Table 1.1 Summary Statistics of Homeowners by Wealth Quintile(mean)") varwidth(40) ///
>  addnote("Notes: Households weighted by survey weights." ///
>  "       Homeowners are households own residential building used as dwelling by household members." ///
>  "       Real estate includes dwelling and urban and rural land used as residential area.")

Table 1.1 Summary Statistics of Homeowners by Wealth Quintile(mean)
-------------------------------------------------------------------------------------------------------------
> ---------
                                                  (1)          (2)          (3)          (4)          (5)    
>       (6)
                                                  All           Q1           Q2           Q3           Q4    
>        Q5
-------------------------------------------------------------------------------------------------------------
> ---------
Value of Residential Real Estate              889,216       76,635      137,158      262,623      539,234    
> 2,904,116
Value of Land Associated                      349,122       28,805       52,175       99,177      216,955    
> 1,140,934
Residential land in RE asset (%)                   38           38           37           36           37    
>        41
Value of Building                             540,094       47,830       84,983      163,446      322,279    
> 1,763,181
Size of Dwelling in sq. ft                        720          371          503          647          786    
>     1,081
Value of dwelling per sq.ft (%)                73,660       16,796       25,087       37,896       68,291    
>   183,970
Residential RE in Total Assets (%)                 58           77           69           57           52    
>        49
Urban Household (%)                                25            6           11           18           29    
>        50
Household Size                                      5            4            4            5            5    
>         5
Female Household Head (%)                          13           17           16           13           12    
>        10
Household Head Age                                 48           43           45           47           49    
>        52
Mortgage Holders_1 (%)                              3            1            1            1            3    
>         7
Mortgage Holders_2 (%)                              4            2            1            2            4    
>         8
Home Ownership (%)                                 81           41           88           90           93    
>        93
-------------------------------------------------------------------------------------------------------------
> ---------
Observations                                  110,800       17,520       20,700       22,102       24,049    
>    26,429
-------------------------------------------------------------------------------------------------------------
> ---------
Notes: Households weighted by survey weights.
       Homeowners are households own residential building used as dwelling by household members.
       Real estate includes dwelling and urban and rural land used as residential area.

. 
. esttab total q1 q2 q3 q4 q5, cells(p50(fmt(%15.0fc))) label collabels(none) ///
>  mtitles("All" "Q1" "Q2" "Q3" "Q4" "Q5") stats(N, label("Observations") fmt(%15.0gc)) /// 
>  title("Table 1.2 Summary Statistics of Homeowners by Wealth Quintile (med)") varwidth(40) ///
>  addnote("Notes: Households weighted by survey weights." ///
>  "       Homeowners are households own residential building used as dwelling by household members." ///
>  "       Real estate includes dwelling and urban and rural land used as residential area.")

Table 1.2 Summary Statistics of Homeowners by Wealth Quintile (med)
-------------------------------------------------------------------------------------------------------------
> ---------
                                                  (1)          (2)          (3)          (4)          (5)    
>       (6)
                                                  All           Q1           Q2           Q3           Q4    
>        Q5
-------------------------------------------------------------------------------------------------------------
> ---------
Value of Residential Real Estate              250,000       55,000      125,000      245,000      462,192    
> 1,451,790
Value of Land Associated                       70,000       20,000       40,000       60,000      120,000    
>   400,000
Residential land in RE asset (%)                   36           38           35           33           35    
>        40
Value of Building                             150,000       30,000       75,000      150,000      250,000    
>   660,000
Size of Dwelling in sq. ft                        538          269          398          495          624    
>       893
Value of dwelling per sq.ft (%)                30,305       10,723       18,967       27,881       41,305    
>    74,349
Residential RE in Total Assets (%)                 60           83           74           55           46    
>        44
Urban Household (%)                                 0            0            0            0            0    
>         0
Household Size                                      4            4            4            4            5    
>         5
Female Household Head (%)                           0            0            0            0            0    
>         0
Household Head Age                                 46           40           43           45           48    
>        52
Mortgage Holders_1 (%)                              0            0            0            0            0    
>         0
Mortgage Holders_2 (%)                              0            0            0            0            0    
>         0
Home Ownership (%)                                100            0          100          100          100    
>       100
-------------------------------------------------------------------------------------------------------------
> ---------
Observations                                  110,800       17,520       20,700       22,102       24,049    
>    26,429
-------------------------------------------------------------------------------------------------------------
> ---------
Notes: Households weighted by survey weights.
       Homeowners are households own residential building used as dwelling by household members.
       Real estate includes dwelling and urban and rural land used as residential area.

. 
. 
. ***********************************************
. *** Table 2. Table of Mortgages
. ***********************************************
. use "${r_output}\b14_hse_mortgage",clear

. 
. *all of the mortgages are those active during survey period.
. forvalues i = 1/2 {
  2. egen closed_`i' = rowtotal(mrtg_`i'_debt mrtg_`i'_debt_todt mrtg_`i'_repay)
  3. replace closed_`i' = (closed_`i' == 0)*100 //less than 1 percent loan is paid off. 
  4. sum  closed_`i' if mrtg_`i'_borrow > 0  
  5. drop closed_`i'
  6. }
(147,524 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    closed_1 |      4,943    .0606919    2.463074          0        100
(147,524 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    closed_2 |      6,913    .1012585    3.180733          0        100

. 
. /*
> a) value of loan taken at inception (mortgage value) - amount borrowed
> b) Term of loan (calculated) 
> c) Interest rate (given)
> d) Monthly payment (calculate)
> e) Is it subsidized (column 7)
> f) count of mortgages - 100? 200? N. Number of observations 
> g) Who are these people? (i) urban, (ii) hh size, (iii) gender, (iv) age
> */
. 
. replace intst_rate = intst_rate*100*12
(84,996 real changes made)

. 
. label var mrtg_1_borrow "Mortgage Value at Inception_1"

. label var mrtg_2_borrow "Mortgage Value at Inception_2"

. label var loan_period_1 "Term of Loan_1 (mt)"

. label var loan_period_2 "Term of Loan_2 (mt)"

. label var intst_rate "Interest rate (%)"

. label var repay_mt_1 "Monthly Payment_1"

. label var repay_mt_2 "Monthly Payment_2"

. 
. *create the table 
. global var_tab_2 "intst_rate loan_sub urban hhsize head_female head_age"

. 
. forvalues x = 1/2 {
  2. mdesc intst_rate mrtg_`x'_borrow loan_period_`x' repay_mt_`x'
  3. }

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
     intst_rate |      39,101        147,524          26.50
   mrtg_1_bor~w |           0        147,524           0.00
   loan_perio~1 |     144,280        147,524          97.80
     repay_mt_1 |      81,077        147,524          54.96
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
     intst_rate |      39,101        147,524          26.50
   mrtg_2_bor~w |           0        147,524           0.00
   loan_perio~2 |     143,588        147,524          97.33
     repay_mt_2 |      81,077        147,524          54.96
----------------+-----------------------------------------------

. 
. forvalues x = 1/2 {
  2. gen double obs_`x' = (intst_rate + loan_sub + urban + hhsize + head_female + head_age + mrtg_`x'_borrow 
> + loan_period_`x' + repay_mt_`x') != . //obsevations will full loan information
  3. mdesc intst_rate loan_sub urban hhsize head_female head_age mrtg_`x'_borrow loan_period_`x' repay_mt_`x'
>  if mrtg_`x'_borrow > 0 & obs_`x' == 1
  4. }

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
     intst_rate |           0          3,244           0.00
       loan_sub |           0          3,244           0.00
          urban |           0          3,244           0.00
         hhsize |           0          3,244           0.00
    head_female |           0          3,244           0.00
       head_age |           0          3,244           0.00
   mrtg_1_bor~w |           0          3,244           0.00
   loan_perio~1 |           0          3,244           0.00
     repay_mt_1 |           0          3,244           0.00
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
     intst_rate |           0          3,936           0.00
       loan_sub |           0          3,936           0.00
          urban |           0          3,936           0.00
         hhsize |           0          3,936           0.00
    head_female |           0          3,936           0.00
       head_age |           0          3,936           0.00
   mrtg_2_bor~w |           0          3,936           0.00
   loan_perio~2 |           0          3,936           0.00
     repay_mt_2 |           0          3,936           0.00
----------------+-----------------------------------------------

. 
. tab year,sort //select the year cut for loan borrow year. 

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       2012 |     52,728       47.74       47.74
       2013 |     19,469       17.63       65.37
       2011 |     15,457       14.00       79.37
       2010 |      8,853        8.02       87.38
       2009 |      4,492        4.07       91.45
       2008 |      2,967        2.69       94.14
       2007 |      1,793        1.62       95.76
       2006 |      1,181        1.07       96.83
       2005 |        910        0.82       97.66
       2004 |        589        0.53       98.19
       2003 |        523        0.47       98.66
       2002 |        329        0.30       98.96
       2000 |        324        0.29       99.25
       2001 |        237        0.21       99.47
       1998 |        137        0.12       99.59
       1999 |         83        0.08       99.67
       1996 |         56        0.05       99.72
       1997 |         55        0.05       99.77
       1995 |         52        0.05       99.82
       1993 |         46        0.04       99.86
       1992 |         36        0.03       99.89
       1994 |         31        0.03       99.92
       1990 |         25        0.02       99.94
       1989 |         11        0.01       99.95
       1987 |         10        0.01       99.96
       1991 |         10        0.01       99.97
       1988 |          9        0.01       99.98
       1985 |          8        0.01       99.98
       1980 |          4        0.00       99.99
       1984 |          3        0.00       99.99
       1986 |          3        0.00       99.99
       1972 |          1        0.00       99.99
       1973 |          1        0.00       99.99
       1975 |          1        0.00      100.00
       1978 |          1        0.00      100.00
       1979 |          1        0.00      100.00
       1981 |          1        0.00      100.00
       1982 |          1        0.00      100.00
       1983 |          1        0.00      100.00
------------+-----------------------------------
      Total |    110,439      100.00

. 
. forvalues i = 2002(2)2013 {
  2. local j = `i' + 1 
  3. dis `i' "-"`j'
  4.   forvalues x = 1/2 {
  5.   qui eststo total_`x' : estpost summarize mrtg_`x'_borrow loan_period_`x' repay_mt_`x' $var_tab_2 [aw =
>  hhwgt] if mrtg_`x'_borrow > 0 & obs_`x' == 1,de
  6.   qui eststo yr_`j'_`x' : estpost summarize mrtg_`x'_borrow loan_period_`x' repay_mt_`x' $var_tab_2 [aw 
> = hhwgt] if inrange(year,`i',`j') & mrtg_`x'_borrow > 0 & obs_`x' == 1,de
  7.   qui eststo yr_2002_`x' : estpost summarize mrtg_`x'_borrow loan_period_`x' repay_mt_`x' $var_tab_2 [aw
>  = hhwgt] if year<2002 & mrtg_`x'_borrow > 0 & obs_`x' == 1,de
  8.   }
  9. }
2002-2003
2004-2005
2006-2007
2008-2009
2010-2011
2012-2013

. 
. forvalues x = 1/2 {
  2. esttab total_`x' yr_2013_`x' yr_2011_`x' yr_2009_`x' yr_2007_`x' yr_2005_`x' yr_2003_`x' yr_2002_`x', ce
> lls(mean(fmt(%15.0fc))) label collabels(none) ///
>  mtitles("All" "2012-2013" "2010-2011" "2008-2009" "2006-2007" "2004-2005" "2002-2003" "<2002") stats(N, la
> bel("Observations") fmt(%15.0gc)) ///
>  title("Table 2.1 Summary Statistics of Mortgages (mean)_`x' by Borrowed Year") varwidth(25) ///
>  addnotes("Notes: Households weighted by survey weights."  ///
>           "       The term of loan is imputed by monthly payment, interest rate, and the mortgage value at 
> inception." ///
>                   "       The monthly payment is estimated by the amount repaid divide during 7/1/2012 to d
> ate of survey.")
  3. }

Table 2.1 Summary Statistics of Mortgages (mean)_1 by Borrowed Year
-------------------------------------------------------------------------------------------------------------
> --------------------
                                   (1)          (2)          (3)          (4)          (5)          (6)      
>     (7)          (8)
                                   All    2012-2013    2010-2011    2008-2009    2006-2007    2004-2005    20
> 02-2003        <2002
-------------------------------------------------------------------------------------------------------------
> --------------------
Mortgage Value at Incep~1      668,650      426,549      829,603      815,360      766,296      500,311      
> 397,954      322,039
Term of Loan_1 (mt)                157          119          134          223          182          177      
>     171          117
Monthly Payment_1               11,963        7,216       13,581       16,470       12,301       10,195      
>   8,681        8,674
Interest rate (%)                   11           13           12           12           11           10      
>       9           10
Subsidized (%)                      93           89           94           95           94           91      
>     100           99
Urban Household (%)                 71           48           69           76           87           80      
>      92           83
Household Size                       5            4            5            4            5            5      
>       5            5
Female Household Head (%)            8            8            9            7            8            5      
>       2           17
Household Head Age                  49           47           49           50           50           51      
>      51           53
-------------------------------------------------------------------------------------------------------------
> --------------------
Observations                     3,244          585        1,070          538          424          334      
>     146          147
-------------------------------------------------------------------------------------------------------------
> --------------------
Notes: Households weighted by survey weights.
       The term of loan is imputed by monthly payment, interest rate, and the mortgage value at inception.
       The monthly payment is estimated by the amount repaid divide during 7/1/2012 to date of survey.

Table 2.1 Summary Statistics of Mortgages (mean)_2 by Borrowed Year
-------------------------------------------------------------------------------------------------------------
> --------------------
                                   (1)          (2)          (3)          (4)          (5)          (6)      
>     (7)          (8)
                                   All    2012-2013    2010-2011    2008-2009    2006-2007    2004-2005    20
> 02-2003        <2002
-------------------------------------------------------------------------------------------------------------
> --------------------
Mortgage Value at Incep~2      598,155      308,122      757,134      787,946      728,449      494,361      
> 399,063      323,909
Term of Loan_2 (mt)                160          152          135          211          181          173      
>     171          116
Monthly Payment_2               11,076        5,749       12,598       16,153       12,399       10,780      
>   8,589        9,257
Interest rate (%)                   12           14           12           12           11           10      
>       9           10
Subsidized (%)                      91           84           91           93           95           91      
>     100           98
Urban Household (%)                 68           48           67           76           87           81      
>      92           83
Household Size                       4            4            5            4            5            5      
>       5            5
Female Household Head (%)            9           11           10            7            9            5      
>       2           17
Household Head Age                  49           46           48           50           50           51      
>      51           53
-------------------------------------------------------------------------------------------------------------
> --------------------
Observations                     3,936          892        1,300          619          460          355      
>     154          156
-------------------------------------------------------------------------------------------------------------
> --------------------
Notes: Households weighted by survey weights.
       The term of loan is imputed by monthly payment, interest rate, and the mortgage value at inception.
       The monthly payment is estimated by the amount repaid divide during 7/1/2012 to date of survey.

. 
. forvalues x = 1/2 {
  2. esttab total_`x' yr_2013_`x' yr_2011_`x' yr_2009_`x' yr_2007_`x' yr_2005_`x' yr_2003_`x' yr_2002_`x', ce
> lls(p50(fmt(%15.0fc))) label collabels(none) ///
>  mtitles("All" "2012-2013" "2010-2011" "2008-2009" "2006-2007" "2004-2005" "2002-2003" "<2002") stats(N, la
> bel("Observations") fmt(%15.0gc)) ///
>  title("Table 2.2 Summary Statistics of Mortgages (med)_`x' by Borrowed Year") varwidth(25) ///
>  addnotes("Notes: Households weighted by survey weights." ///
>           "       The term of loan is imputed by monthly payment, interest rate, and the mortgage value at 
> inception." ///
>                   "       The monthly payment is estimated by the amount repaid divide during 7/1/2012 to d
> ate of survey.")
  3. }

Table 2.2 Summary Statistics of Mortgages (med)_1 by Borrowed Year
-------------------------------------------------------------------------------------------------------------
> --------------------
                                   (1)          (2)          (3)          (4)          (5)          (6)      
>     (7)          (8)
                                   All    2012-2013    2010-2011    2008-2009    2006-2007    2004-2005    20
> 02-2003        <2002
-------------------------------------------------------------------------------------------------------------
> --------------------
Mortgage Value at Incep~1      400,000      150,000      400,000      500,000      500,000      450,000      
> 210,000      248,000
Term of Loan_1 (mt)                102           71           92          119          132          143      
>     145           96
Monthly Payment_1                6,250        3,200        8,750        7,091        7,636        5,500      
>   3,000        3,988
Interest rate (%)                   11           13           11           12           11           10      
>      10           10
Subsidized (%)                     100          100          100          100          100          100      
>     100          100
Urban Household (%)                100            0          100          100          100          100      
>     100          100
Household Size                       4            4            4            4            4            4      
>       5            4
Female Household Head (%)            0            0            0            0            0            0      
>       0            0
Household Head Age                  48           44           46           48           47           50      
>      50           55
-------------------------------------------------------------------------------------------------------------
> --------------------
Observations                     3,244          585        1,070          538          424          334      
>     146          147
-------------------------------------------------------------------------------------------------------------
> --------------------
Notes: Households weighted by survey weights.
       The term of loan is imputed by monthly payment, interest rate, and the mortgage value at inception.
       The monthly payment is estimated by the amount repaid divide during 7/1/2012 to date of survey.

Table 2.2 Summary Statistics of Mortgages (med)_2 by Borrowed Year
-------------------------------------------------------------------------------------------------------------
> --------------------
                                   (1)          (2)          (3)          (4)          (5)          (6)      
>     (7)          (8)
                                   All    2012-2013    2010-2011    2008-2009    2006-2007    2004-2005    20
> 02-2003        <2002
-------------------------------------------------------------------------------------------------------------
> --------------------
Mortgage Value at Incep~2      300,000      150,000      400,000      450,000      500,000      450,000      
> 250,000      250,000
Term of Loan_2 (mt)                 97           71           87          110          131          143      
>     145           96
Monthly Payment_2                5,556        3,200        7,809        6,500        7,042        5,500      
>   3,000        4,000
Interest rate (%)                   11           13           11           12           11           10      
>      10           10
Subsidized (%)                     100          100          100          100          100          100      
>     100          100
Urban Household (%)                100            0          100          100          100          100      
>     100          100
Household Size                       4            4            4            4            4            4      
>       5            4
Female Household Head (%)            0            0            0            0            0            0      
>       0            0
Household Head Age                  47           44           46           48           48           50      
>      50           55
-------------------------------------------------------------------------------------------------------------
> --------------------
Observations                     3,936          892        1,300          619          460          355      
>     154          156
-------------------------------------------------------------------------------------------------------------
> --------------------
Notes: Households weighted by survey weights.
       The term of loan is imputed by monthly payment, interest rate, and the mortgage value at inception.
       The monthly payment is estimated by the amount repaid divide during 7/1/2012 to date of survey.

. 
. 
. 
. *******************************************************************
. *** Table 3. Table of Mortgages feature by wealth quintile
. *******************************************************************
. 
. *check the cases where one household have several mortgages. 
. use "${r_output}\b14_hse_mortgage",clear

. 
. forvalues i = 1/2 { 
  2. egen double mrtg_`i'_n = sum(mrtg_`i'_dm) if mrtg_`i'_borrow > 0, by(HHID)
  3. } 
(142581 missing values generated)
(140611 missing values generated)

. 
. 
. forvalues i = 1/2 { 
  2. tab mrtg_`i'_n if mrtg_`i'_borrow > 0 //more than 70% only with 1 housing mortgage
  3. }

   mrtg_1_n |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      4,397       88.95       88.95
          2 |        470        9.51       98.46
          3 |         51        1.03       99.49
          4 |         20        0.40       99.90
          5 |          5        0.10      100.00
------------+-----------------------------------
      Total |      4,943      100.00

   mrtg_2_n |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      5,447       78.79       78.79
          2 |        940       13.60       92.39
          3 |        294        4.25       96.64
          4 |        104        1.50       98.15
          5 |         30        0.43       98.58
          6 |         36        0.52       99.10
          7 |          7        0.10       99.20
          8 |         16        0.23       99.44
         11 |         11        0.16       99.59
         12 |         12        0.17       99.77
         16 |         16        0.23      100.00
------------+-----------------------------------
      Total |      6,913      100.00

. 
. br HHID mrtg_1_borrow if mrtg_1_n > 1 & mrtg_1_borrow  > 0 //there are cases with multiple same amount mort
> gages.

. 
. *generate the mortgage status by household wealth status. 
. use "${r_output}\b14_hse_mortgage",clear

. 
. label var mrtg_1_borrow "Mortgage Value at Inception_1"

. label var mrtg_2_borrow "Mortgage Value at Inception_2"

. label var loan_period_1 "Term of Loan_1 (mt)"

. label var loan_period_2 "Term of Loan_2 (mt)"

. label var intst_rate "Interest rate (%)"

. label var repay_mt_1 "Monthly Payment_1"

. label var repay_mt_2 "Monthly Payment_2"

. 
. replace intst_rate = intst_rate*100*12
(84,996 real changes made)

. 
. *check the missings. 
. forvalues x = 1/2 {
  2. gen double obs_`x' = (intst_rate + loan_sub + urban + hhsize + head_female + head_age + mrtg_`x'_borrow 
> + loan_period_`x' + repay_mt_`x') != . //obsevations will full loan information
  3. mdesc intst_rate loan_sub urban hhsize head_female head_age mrtg_`x'_borrow loan_period_`x' repay_mt_`x'
>  if mrtg_`x'_borrow > 0 & obs_`x' == 1
  4. }

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
     intst_rate |           0          3,244           0.00
       loan_sub |           0          3,244           0.00
          urban |           0          3,244           0.00
         hhsize |           0          3,244           0.00
    head_female |           0          3,244           0.00
       head_age |           0          3,244           0.00
   mrtg_1_bor~w |           0          3,244           0.00
   loan_perio~1 |           0          3,244           0.00
     repay_mt_1 |           0          3,244           0.00
----------------+-----------------------------------------------

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
     intst_rate |           0          3,936           0.00
       loan_sub |           0          3,936           0.00
          urban |           0          3,936           0.00
         hhsize |           0          3,936           0.00
    head_female |           0          3,936           0.00
       head_age |           0          3,936           0.00
   mrtg_2_bor~w |           0          3,936           0.00
   loan_perio~2 |           0          3,936           0.00
     repay_mt_2 |           0          3,936           0.00
----------------+-----------------------------------------------

. 
. *creat the tables. 
. forvalues i = 1(1)5 {
  2.   forvalues x = 1/2 {
  3.     eststo total_`x' : estpost summarize mrtg_`x'_borrow loan_period_`x' repay_mt_`x' $var_tab_2 [aw = h
> hwgt] if mrtg_`x'_borrow > 0 & obs_`x' == 1,de
  4.     eststo qtl_`i'_`x' : estpost summarize mrtg_`x'_borrow loan_period_`x' repay_mt_`x' $var_tab_2 [aw =
>  hhwgt] if qtl == `i' & mrtg_`x'_borrow > 0 & obs_`x' == 1,de
  5.   }
  6. }

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
mrtg_1_bor~w |      3244    8055622   668649.6   7.57e+11   870066.4   3.162255   18.34676   5.39e+12 
loan_perio~1 |      3244    8055622   156.6183   56647.67   238.0077   5.202478   33.69549   1.26e+09 
  repay_mt_1 |      3244    8055622   11962.84   3.20e+08   17895.26   4.781253   37.62635   9.64e+10 
  intst_rate |      3244    8055622    11.4829     17.645   4.200596   3.425555   28.09928   9.25e+07 
    loan_sub |      3244    8055622   93.35135   620.8519    24.9169  -3.480211   13.11187   7.52e+08 
       urban |      3244    8055622   71.31094   2046.475   45.23798  -.9423157   1.887959   5.74e+08 
      hhsize |      3244    8055622   4.505855    3.64478   1.909131   1.652205    9.36588   3.63e+07 
 head_female |      3244    8055622   8.317444   762.7996   27.61883   3.018881   10.11364   6.70e+07 
    head_age |      3244    8055622     49.295   133.7609   11.56551   .5640014   2.950771   3.97e+08 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
mrtg_1_bor~w |      7000   1.00e+07      20000      40000      58000     150000     400000     800000 
loan_perio~1 |  2.339866    1770.43    7.53366   15.37438   26.20565   53.24054   101.8687    178.182 
  repay_mt_1 |        70   249639.2   333.3333        732   1454.545       3200       6250    13095.5 
  intst_rate |        .5         60          4          5        7.5         10         11       12.5 
    loan_sub |         0        100          0          0        100        100        100        100 
       urban |         0        100          0          0          0          0        100        100 
      hhsize |         1         20          1          2          3          3          4          5 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        21         95         28         33         36         40         48         56 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
mrtg_1_bor~w |   1800000    2500000    4000000 
loan_perio~1 |  264.3022   359.8298    1770.43 
  repay_mt_1 |     27392      40000    86617.3 
  intst_rate |        15         16         34 
    loan_sub |       100        100        100 
       urban |       100        100        100 
      hhsize |         7          8         10 
 head_female |         0        100        100 
    head_age |        65         71         80 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
mrtg_1_bor~w |       140     801451   566658.8   7.63e+11   873404.8   1.992444   6.978048   4.54e+11 
loan_perio~1 |       140     801451   127.4407   34020.57   184.4467    6.46876   54.37986   1.02e+08 
  repay_mt_1 |       140     801451   9203.334   1.80e+08   13416.83    2.48698   11.49215   7.38e+09 
  intst_rate |       140     801451   11.33444   23.46936   4.844518   .5289854    4.70861    9084002 
    loan_sub |       140     801451   95.56304   427.0601   20.66543  -4.425423   20.58436   7.66e+07 
       urban |       140     801451   56.32501   2477.692   49.77642  -.2550494    1.06505   4.51e+07 
      hhsize |       140     801451   4.929478   3.838789   1.959283   .9225103   2.896951    3950735 
 head_female |       140     801451    10.6236   956.3299   30.92458   2.555752    7.53187    8514294 
    head_age |       140     801451   45.24364   84.13095   9.172292   .7614096   2.555272   3.63e+07 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
mrtg_1_bor~w |      7000    6400000      35000      53000      58000      58000     150000     520000 
loan_perio~1 |  6.162185    1770.43    14.4696   28.32143   39.72497   70.97903   70.97903   136.0733 
  repay_mt_1 |        70     122682        305        305        732       1115       3200      12000 
  intst_rate |         2         30          5          5          5          5         12         15 
    loan_sub |         0        100          0        100        100        100        100        100 
       urban |         0        100          0          0          0          0        100        100 
      hhsize |         1         12          2          2          3          4          4          7 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        22         80         30         36         38         39         40         55 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
mrtg_1_bor~w |   2300000    2300000    3000000 
loan_perio~1 |  224.1378   378.0414   889.5972 
  repay_mt_1 |     28000   28571.43      55000 
  intst_rate |        15         15         30 
    loan_sub |       100        100        100 
       urban |       100        100        100 
      hhsize |         8          9          9 
 head_female |       100        100        100 
    head_age |        60         60         70 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
mrtg_2_bor~w |      3936    9896665   598155.2   7.73e+11   879192.5   4.556622   45.06712   5.92e+12 
loan_perio~2 |      3936    9896665   159.6134    64553.1    254.073   4.682896   27.50433   1.58e+09 
  repay_mt_2 |      3936    9896665   11076.18   3.24e+08   17989.93   5.287554   45.51959   1.10e+11 
  intst_rate |      3936    9896665   11.97241   26.61682   5.159149   3.234454   21.86497   1.18e+08 
    loan_sub |      3936    9896665   90.86772   830.0403   28.81042   -2.83737    9.05067   8.99e+08 
       urban |      3936    9896665   68.47413   2159.255   46.46779  -.7952379   1.632403   6.78e+08 
      hhsize |      3936    9896665   4.483355   3.518761   1.875836   1.694868   9.526407   4.44e+07 
 head_female |      3936    9896665   8.992342     818.58   28.61084   2.866946   9.219382   8.90e+07 
    head_age |      3936    9896665   48.70849   137.5817   11.72952   .5357805   2.978689   4.82e+08 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
mrtg_2_bor~w |       450   1.50e+07       6000      25000      45000     100000     300000     650000 
loan_perio~2 |  2.339866    1770.43    6.69942   11.76915   22.08141   48.68794   97.05794   173.4209 
  repay_mt_2 |  23.14286   249639.2        150        625       1000       2600   5555.556      12500 
  intst_rate |       .12         60          4          5          8         10      11.25         13 
    loan_sub |         0        100          0          0        100        100        100        100 
       urban |         0        100          0          0          0          0        100        100 
      hhsize |         1         20          1          2          3          3          4          5 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        21         95         28         32         35         40         47         56 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
mrtg_2_bor~w |   1500000    2400000    3800000 
loan_perio~2 |  264.7641   407.5601    1770.43 
  repay_mt_2 |  25833.33      36000    86617.3 
  intst_rate |        15         24         36 
    loan_sub |       100        100        100 
       urban |       100        100        100 
      hhsize |         7          8         10 
 head_female |         0        100        100 
    head_age |        65         70         80 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
mrtg_2_bor~w |       192   948390.4     503524   6.78e+11   823336.8   2.217571   8.124882   4.78e+11 
loan_perio~2 |       192   948390.4   140.3237   54498.79   233.4498   5.304246   34.21569   1.33e+08 
  repay_mt_2 |       192   948390.4   8429.764   1.71e+08   13090.42   2.815362   13.59187   7.99e+09 
  intst_rate |       192   948390.4   12.77554   40.11684   6.333785   .9718367   4.858628   1.21e+07 
    loan_sub |       192   948390.4   85.82702   1222.793   34.96846  -2.054462   5.220815   8.14e+07 
       urban |       192   948390.4    59.6841   2418.816   49.18146  -.3948406   1.155899   5.66e+07 
      hhsize |       192   948390.4   4.748403   3.720092   1.928754   1.082044   3.461688    4503340 
 head_female |       192   948390.4   9.598984   872.3012   29.53475   2.742982   8.523951    9103585 
    head_age |       192   948390.4   44.07337   91.82184   9.582371   .6967402    2.65697   4.18e+07 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
mrtg_2_bor~w |       450    6400000       7000      40000      53000      58000     150000     400000 
loan_perio~2 |  6.162185    1770.43    7.83507   26.15824   32.12103   70.97903   71.64953   118.2269 
  repay_mt_2 |  23.14286     122682        305        305        732   1166.667       3200   7268.556 
  intst_rate |         2         60          5          5          5          8         13         15 
    loan_sub |         0        100          0          0          0        100        100        100 
       urban |         0        100          0          0          0          0        100        100 
      hhsize |         1         14          2          3          3          4          4          6 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        22         80         28         33         33         39         39         55 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
mrtg_2_bor~w |   2000000    2300000    3000000 
loan_perio~2 |  240.0464   378.0414   1729.999 
  repay_mt_2 |     28000   28571.43      55000 
  intst_rate |        24         24         30 
    loan_sub |       100        100        100 
       urban |       100        100        100 
      hhsize |         8          9          9 
 head_female |         0        100        100 
    head_age |        58         60         70 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
mrtg_1_bor~w |      3244    8055622   668649.6   7.57e+11   870066.4   3.162255   18.34676   5.39e+12 
loan_perio~1 |      3244    8055622   156.6183   56647.67   238.0077   5.202478   33.69549   1.26e+09 
  repay_mt_1 |      3244    8055622   11962.84   3.20e+08   17895.26   4.781253   37.62635   9.64e+10 
  intst_rate |      3244    8055622    11.4829     17.645   4.200596   3.425555   28.09928   9.25e+07 
    loan_sub |      3244    8055622   93.35135   620.8519    24.9169  -3.480211   13.11187   7.52e+08 
       urban |      3244    8055622   71.31094   2046.475   45.23798  -.9423157   1.887959   5.74e+08 
      hhsize |      3244    8055622   4.505855    3.64478   1.909131   1.652205    9.36588   3.63e+07 
 head_female |      3244    8055622   8.317444   762.7996   27.61883   3.018881   10.11364   6.70e+07 
    head_age |      3244    8055622     49.295   133.7609   11.56551   .5640014   2.950771   3.97e+08 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
mrtg_1_bor~w |      7000   1.00e+07      20000      40000      58000     150000     400000     800000 
loan_perio~1 |  2.339866    1770.43    7.53366   15.37438   26.20565   53.24054   101.8687    178.182 
  repay_mt_1 |        70   249639.2   333.3333        732   1454.545       3200       6250    13095.5 
  intst_rate |        .5         60          4          5        7.5         10         11       12.5 
    loan_sub |         0        100          0          0        100        100        100        100 
       urban |         0        100          0          0          0          0        100        100 
      hhsize |         1         20          1          2          3          3          4          5 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        21         95         28         33         36         40         48         56 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
mrtg_1_bor~w |   1800000    2500000    4000000 
loan_perio~1 |  264.3022   359.8298    1770.43 
  repay_mt_1 |     27392      40000    86617.3 
  intst_rate |        15         16         34 
    loan_sub |       100        100        100 
       urban |       100        100        100 
      hhsize |         7          8         10 
 head_female |         0        100        100 
    head_age |        65         71         80 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
mrtg_1_bor~w |       117   249703.8   162930.8   1.88e+11   434128.6   9.550348   105.0641   4.07e+10 
loan_perio~1 |       117   249703.8   217.6229   174546.7   417.7879   2.901435   10.67176   5.43e+07 
  repay_mt_1 |       117   249703.8   5518.085   5.02e+08   22401.72   8.920952   84.04443   1.38e+09 
  intst_rate |       117   249703.8   14.57512    59.1204   7.688979   1.374678   5.274454    3639463 
    loan_sub |       117   249703.8   76.80479   1796.861    42.3894  -1.270132   2.613237   1.92e+07 
       urban |       117   249703.8   35.54988   2310.946    48.0723   .6037685   1.364536    8876939 
      hhsize |       117   249703.8   4.731294   4.246621   2.060733   1.198546   5.423005    1181422 
 head_female |       117   249703.8   14.81518   1272.908   35.67783   1.980847   4.923754    3699405 
    head_age |       117   249703.8   46.40948   104.4045   10.21785   .4087787   2.951561   1.16e+07 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
mrtg_1_bor~w |      8000    5000000      10000      15000      20000      30000      74000     170000 
loan_perio~1 |  2.339866    1770.43   2.339866   11.00122   20.83169   34.12438   54.98609   134.9512 
  repay_mt_1 |  233.3333   216666.7   233.3333        400        500   909.0909   2222.222       3500 
  intst_rate |         2         48          2          4          6         11         13         16 
    loan_sub |         0        100          0          0          0        100        100        100 
       urban |         0        100          0          0          0          0          0        100 
      hhsize |         1         14          2          2          2          3          4          5 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        28         72         29         30         33         39         47         52 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
mrtg_1_bor~w |    250000     500000    1150000 
loan_perio~1 |  540.2268    1770.43    1770.43 
  repay_mt_1 |      6000      12000   216666.7 
  intst_rate |        24         36         36 
    loan_sub |       100        100        100 
       urban |       100        100        100 
      hhsize |         7          9          9 
 head_female |       100        100        100 
    head_age |        60         67         72 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
mrtg_2_bor~w |      3936    9896665   598155.2   7.73e+11   879192.5   4.556622   45.06712   5.92e+12 
loan_perio~2 |      3936    9896665   159.6134    64553.1    254.073   4.682896   27.50433   1.58e+09 
  repay_mt_2 |      3936    9896665   11076.18   3.24e+08   17989.93   5.287554   45.51959   1.10e+11 
  intst_rate |      3936    9896665   11.97241   26.61682   5.159149   3.234454   21.86497   1.18e+08 
    loan_sub |      3936    9896665   90.86772   830.0403   28.81042   -2.83737    9.05067   8.99e+08 
       urban |      3936    9896665   68.47413   2159.255   46.46779  -.7952379   1.632403   6.78e+08 
      hhsize |      3936    9896665   4.483355   3.518761   1.875836   1.694868   9.526407   4.44e+07 
 head_female |      3936    9896665   8.992342     818.58   28.61084   2.866946   9.219382   8.90e+07 
    head_age |      3936    9896665   48.70849   137.5817   11.72952   .5357805   2.978689   4.82e+08 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
mrtg_2_bor~w |       450   1.50e+07       6000      25000      45000     100000     300000     650000 
loan_perio~2 |  2.339866    1770.43    6.69942   11.76915   22.08141   48.68794   97.05794   173.4209 
  repay_mt_2 |  23.14286   249639.2        150        625       1000       2600   5555.556      12500 
  intst_rate |       .12         60          4          5          8         10      11.25         13 
    loan_sub |         0        100          0          0        100        100        100        100 
       urban |         0        100          0          0          0          0        100        100 
      hhsize |         1         20          1          2          3          3          4          5 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        21         95         28         32         35         40         47         56 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
mrtg_2_bor~w |   1500000    2400000    3800000 
loan_perio~2 |  264.7641   407.5601    1770.43 
  repay_mt_2 |  25833.33      36000    86617.3 
  intst_rate |        15         24         36 
    loan_sub |       100        100        100 
       urban |       100        100        100 
      hhsize |         7          8         10 
 head_female |         0        100        100 
    head_age |        65         70         80 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
mrtg_2_bor~w |       174   403218.3   125206.9   1.21e+11   347209.7   11.82467   163.2125   5.05e+10 
loan_perio~2 |       174   403218.3   203.8381   157346.3    396.669   2.972423   11.34542   8.22e+07 
  repay_mt_2 |       174   403218.3   4160.521   3.15e+08   17757.72   11.27001   134.4982   1.68e+09 
  intst_rate |       174   403218.3   13.95754   66.88389   8.178257    1.05688    4.42974    5627936 
    loan_sub |       174   403218.3   73.37413   1964.943   44.32767  -1.057651   2.118625   2.96e+07 
       urban |       174   403218.3   31.77179   2180.263   46.69328    .783017   1.613116   1.28e+07 
      hhsize |       174   403218.3   4.281343   3.727649   1.930712   1.232341   5.811004    1726316 
 head_female |       174   403218.3   10.90313   977.0504    31.2578   2.508794   7.294048    4396343 
    head_age |       174   403218.3   43.74934   118.3463   10.87871   .5774804   2.836371   1.76e+07 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
mrtg_2_bor~w |      5000    5000000       5000      10000      15000      30000      50000     120000 
loan_perio~2 |  2.339866    1770.43   5.861933   11.27347   14.88621   34.12438   54.55329   87.50858 
  repay_mt_2 |       100   216666.7        100        300        500   727.2727       1500   3182.667 
  intst_rate |         2         50          2          2          3         10         13         16 
    loan_sub |         0        100          0          0          0          0        100        100 
       urban |         0        100          0          0          0          0          0        100 
      hhsize |         1         14          2          2          2          3          4          5 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        27         72         28         30         30         35         43         50 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
mrtg_2_bor~w |    250000     350000    1000000 
loan_perio~2 |  595.9769   889.5972    1770.43 
  repay_mt_2 |  5833.333   9927.273      50000 
  intst_rate |        24         36         36 
    loan_sub |       100        100        100 
       urban |       100        100        100 
      hhsize |         7          8          9 
 head_female |       100        100        100 
    head_age |        60         63         72 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
mrtg_1_bor~w |      3244    8055622   668649.6   7.57e+11   870066.4   3.162255   18.34676   5.39e+12 
loan_perio~1 |      3244    8055622   156.6183   56647.67   238.0077   5.202478   33.69549   1.26e+09 
  repay_mt_1 |      3244    8055622   11962.84   3.20e+08   17895.26   4.781253   37.62635   9.64e+10 
  intst_rate |      3244    8055622    11.4829     17.645   4.200596   3.425555   28.09928   9.25e+07 
    loan_sub |      3244    8055622   93.35135   620.8519    24.9169  -3.480211   13.11187   7.52e+08 
       urban |      3244    8055622   71.31094   2046.475   45.23798  -.9423157   1.887959   5.74e+08 
      hhsize |      3244    8055622   4.505855    3.64478   1.909131   1.652205    9.36588   3.63e+07 
 head_female |      3244    8055622   8.317444   762.7996   27.61883   3.018881   10.11364   6.70e+07 
    head_age |      3244    8055622     49.295   133.7609   11.56551   .5640014   2.950771   3.97e+08 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
mrtg_1_bor~w |      7000   1.00e+07      20000      40000      58000     150000     400000     800000 
loan_perio~1 |  2.339866    1770.43    7.53366   15.37438   26.20565   53.24054   101.8687    178.182 
  repay_mt_1 |        70   249639.2   333.3333        732   1454.545       3200       6250    13095.5 
  intst_rate |        .5         60          4          5        7.5         10         11       12.5 
    loan_sub |         0        100          0          0        100        100        100        100 
       urban |         0        100          0          0          0          0        100        100 
      hhsize |         1         20          1          2          3          3          4          5 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        21         95         28         33         36         40         48         56 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
mrtg_1_bor~w |   1800000    2500000    4000000 
loan_perio~1 |  264.3022   359.8298    1770.43 
  repay_mt_1 |     27392      40000    86617.3 
  intst_rate |        15         16         34 
    loan_sub |       100        100        100 
       urban |       100        100        100 
      hhsize |         7          8         10 
 head_female |         0        100        100 
    head_age |        65         71         80 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
mrtg_1_bor~w |       253   488941.7   322642.2   2.17e+11   465505.6   3.518094   19.38707   1.58e+11 
loan_perio~1 |       253   488941.7    163.736   68078.74    260.919   3.248873    14.9269   8.01e+07 
  repay_mt_1 |       253   488941.7    6403.13   5.63e+07   7500.449   3.882852   26.76044   3.13e+09 
  intst_rate |       253   488941.7   13.53538   55.85344   7.473516   3.460248   18.99859    6618010 
    loan_sub |       253   488941.7   84.26825   1330.948   36.48216  -1.882354   4.543258   4.12e+07 
       urban |       253   488941.7   60.49571   2399.324   48.98289  -.4293955    1.18438   2.96e+07 
      hhsize |       253   488941.7   4.390727   2.644237   1.626111   .8952156   5.572476    2146809 
 head_female |       253   488941.7   6.590674   618.0734   24.86108   3.499073   13.24351    3222455 
    head_age |       253   488941.7   47.82163   145.7716   12.07359   .4427659   3.027601   2.34e+07 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
mrtg_1_bor~w |      7000    3500000      10000      25000      30000      50000     180000     400000 
loan_perio~1 |  4.253687    1770.43   4.253687   11.76915    16.5211   31.61879   71.73294   155.6685 
  repay_mt_1 |  272.7273      68000   333.3333    585.875       1000       1875   4714.286   8571.429 
  intst_rate |         3         60          4          7          9       10.2         12         14 
    loan_sub |         0        100          0          0          0        100        100        100 
       urban |         0        100          0          0          0          0        100        100 
      hhsize |         1         14          2          2          2          3          4          5 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        24         80         25         28         34         39         47         55 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
mrtg_1_bor~w |    725000    1200000    2000000 
loan_perio~1 |   346.551   889.5972    1183.21 
  repay_mt_1 |     12500      16875      36000 
  intst_rate |        22         24         60 
    loan_sub |       100        100        100 
       urban |       100        100        100 
      hhsize |         6          7          8 
 head_female |         0        100        100 
    head_age |        64         72         80 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
mrtg_2_bor~w |      3936    9896665   598155.2   7.73e+11   879192.5   4.556622   45.06712   5.92e+12 
loan_perio~2 |      3936    9896665   159.6134    64553.1    254.073   4.682896   27.50433   1.58e+09 
  repay_mt_2 |      3936    9896665   11076.18   3.24e+08   17989.93   5.287554   45.51959   1.10e+11 
  intst_rate |      3936    9896665   11.97241   26.61682   5.159149   3.234454   21.86497   1.18e+08 
    loan_sub |      3936    9896665   90.86772   830.0403   28.81042   -2.83737    9.05067   8.99e+08 
       urban |      3936    9896665   68.47413   2159.255   46.46779  -.7952379   1.632403   6.78e+08 
      hhsize |      3936    9896665   4.483355   3.518761   1.875836   1.694868   9.526407   4.44e+07 
 head_female |      3936    9896665   8.992342     818.58   28.61084   2.866946   9.219382   8.90e+07 
    head_age |      3936    9896665   48.70849   137.5817   11.72952   .5357805   2.978689   4.82e+08 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
mrtg_2_bor~w |       450   1.50e+07       6000      25000      45000     100000     300000     650000 
loan_perio~2 |  2.339866    1770.43    6.69942   11.76915   22.08141   48.68794   97.05794   173.4209 
  repay_mt_2 |  23.14286   249639.2        150        625       1000       2600   5555.556      12500 
  intst_rate |       .12         60          4          5          8         10      11.25         13 
    loan_sub |         0        100          0          0        100        100        100        100 
       urban |         0        100          0          0          0          0        100        100 
      hhsize |         1         20          1          2          3          3          4          5 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        21         95         28         32         35         40         47         56 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
mrtg_2_bor~w |   1500000    2400000    3800000 
loan_perio~2 |  264.7641   407.5601    1770.43 
  repay_mt_2 |  25833.33      36000    86617.3 
  intst_rate |        15         24         36 
    loan_sub |       100        100        100 
       urban |       100        100        100 
      hhsize |         7          8         10 
 head_female |         0        100        100 
    head_age |        65         70         80 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
mrtg_2_bor~w |       359   807276.8   222684.3   1.49e+11   385773.8   4.406357   29.10842   1.80e+11 
loan_perio~2 |       359   807276.8   177.4124   77636.74   278.6337   3.106043   14.20877   1.43e+08 
  repay_mt_2 |       359   807276.8   4731.732   4.23e+07   6500.409   4.323391   33.11605   3.82e+09 
  intst_rate |       359   807276.8   15.13292   71.07325   8.430495   2.115034   8.552751   1.22e+07 
    loan_sub |       359   807276.8   78.35268   1700.864   41.24153  -1.376877   2.895789   6.33e+07 
       urban |       359   807276.8   49.82178   2506.951   50.06947   .0071287   1.000051   4.02e+07 
      hhsize |       359   807276.8   4.272749   2.410682   1.552637   .9339997    5.38891    3449291 
 head_female |       359   807276.8   13.02434   1135.964   33.70407   2.197199   5.827682   1.05e+07 
    head_age |       359   807276.8   46.51658   164.3906   12.82149   .3580847    2.66778   3.76e+07 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
mrtg_2_bor~w |      3500    3500000       5000      10000      18000      40000     100000     200000 
loan_perio~2 |  4.253687    1770.43   4.253687   7.886332    12.0744   33.02221   72.56257   161.7472 
  repay_mt_2 |  64.44444      68000   109.0909      187.5   433.3333       1100       2500       6000 
  intst_rate |         3         60          4          7          8       10.5         12       14.5 
    loan_sub |         0        100          0          0          0        100        100        100 
       urban |         0        100          0          0          0          0          0        100 
      hhsize |         1         14          2          2          2          3          4          5 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        23         80         25         27         28         38         46         55 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
mrtg_2_bor~w |    500000    1000000    1900000 
loan_perio~2 |  595.9769   889.5972   1739.811 
  repay_mt_2 |  10940.18   15555.17   31227.27 
  intst_rate |        30         36         36 
    loan_sub |       100        100        100 
       urban |       100        100        100 
      hhsize |         6          7          8 
 head_female |       100        100        100 
    head_age |        65         70         75 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
mrtg_1_bor~w |      3244    8055622   668649.6   7.57e+11   870066.4   3.162255   18.34676   5.39e+12 
loan_perio~1 |      3244    8055622   156.6183   56647.67   238.0077   5.202478   33.69549   1.26e+09 
  repay_mt_1 |      3244    8055622   11962.84   3.20e+08   17895.26   4.781253   37.62635   9.64e+10 
  intst_rate |      3244    8055622    11.4829     17.645   4.200596   3.425555   28.09928   9.25e+07 
    loan_sub |      3244    8055622   93.35135   620.8519    24.9169  -3.480211   13.11187   7.52e+08 
       urban |      3244    8055622   71.31094   2046.475   45.23798  -.9423157   1.887959   5.74e+08 
      hhsize |      3244    8055622   4.505855    3.64478   1.909131   1.652205    9.36588   3.63e+07 
 head_female |      3244    8055622   8.317444   762.7996   27.61883   3.018881   10.11364   6.70e+07 
    head_age |      3244    8055622     49.295   133.7609   11.56551   .5640014   2.950771   3.97e+08 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
mrtg_1_bor~w |      7000   1.00e+07      20000      40000      58000     150000     400000     800000 
loan_perio~1 |  2.339866    1770.43    7.53366   15.37438   26.20565   53.24054   101.8687    178.182 
  repay_mt_1 |        70   249639.2   333.3333        732   1454.545       3200       6250    13095.5 
  intst_rate |        .5         60          4          5        7.5         10         11       12.5 
    loan_sub |         0        100          0          0        100        100        100        100 
       urban |         0        100          0          0          0          0        100        100 
      hhsize |         1         20          1          2          3          3          4          5 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        21         95         28         33         36         40         48         56 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
mrtg_1_bor~w |   1800000    2500000    4000000 
loan_perio~1 |  264.3022   359.8298    1770.43 
  repay_mt_1 |     27392      40000    86617.3 
  intst_rate |        15         16         34 
    loan_sub |       100        100        100 
       urban |       100        100        100 
      hhsize |         7          8         10 
 head_female |         0        100        100 
    head_age |        65         71         80 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
mrtg_1_bor~w |       736    1632125   396728.5   2.65e+11   514746.3   3.538173   20.93284   6.48e+11 
loan_perio~1 |       736    1632125   173.7313   103454.8   321.6439   4.025013   19.20153   2.84e+08 
  repay_mt_1 |       736    1632125   8485.125   1.80e+08   13417.28   7.162394   89.15702   1.38e+10 
  intst_rate |       736    1632125   11.71088   29.09281   5.393775   2.767052   15.76351   1.91e+07 
    loan_sub |       736    1632125   87.95569   1060.807   32.57003  -2.332297   6.439611   1.44e+08 
       urban |       736    1632125   61.74803   2365.197   48.63329  -.4834557   1.233729   1.01e+08 
      hhsize |       736    1632125   4.591441   5.587087   2.363702   2.259391   12.43945    7493807 
 head_female |       736    1632125   9.306949    845.224   29.07274     2.8013    8.84728   1.52e+07 
    head_age |       736    1632125    52.5056    168.531   12.98195   .3778783   2.400048   8.57e+07 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
mrtg_1_bor~w |     10000    4500000      20000      20000      30000     100000     278000     450000 
loan_perio~1 |  2.729418    1770.43    4.47923   9.346294   19.63176   35.99211   84.91321   173.4209 
  repay_mt_1 |  266.6667   249639.2        400        570      916.5   2181.818       4200   9916.667 
  intst_rate |         2         60          4          5          7        9.5         11         13 
    loan_sub |         0        100          0          0          0        100        100        100 
       urban |         0        100          0          0          0          0        100        100 
      hhsize |         1         20          2          2          2          3          4          6 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        21         95         31         33         37         42         50         65 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
mrtg_1_bor~w |    900000    1500000    2425000 
loan_perio~1 |  308.0538   445.0961    1770.43 
  repay_mt_1 |  21428.57      28125   56888.89 
  intst_rate |        16         20         36 
    loan_sub |       100        100        100 
       urban |       100        100        100 
      hhsize |         7          9         17 
 head_female |         0        100        100 
    head_age |        70         77         82 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
mrtg_2_bor~w |      3936    9896665   598155.2   7.73e+11   879192.5   4.556622   45.06712   5.92e+12 
loan_perio~2 |      3936    9896665   159.6134    64553.1    254.073   4.682896   27.50433   1.58e+09 
  repay_mt_2 |      3936    9896665   11076.18   3.24e+08   17989.93   5.287554   45.51959   1.10e+11 
  intst_rate |      3936    9896665   11.97241   26.61682   5.159149   3.234454   21.86497   1.18e+08 
    loan_sub |      3936    9896665   90.86772   830.0403   28.81042   -2.83737    9.05067   8.99e+08 
       urban |      3936    9896665   68.47413   2159.255   46.46779  -.7952379   1.632403   6.78e+08 
      hhsize |      3936    9896665   4.483355   3.518761   1.875836   1.694868   9.526407   4.44e+07 
 head_female |      3936    9896665   8.992342     818.58   28.61084   2.866946   9.219382   8.90e+07 
    head_age |      3936    9896665   48.70849   137.5817   11.72952   .5357805   2.978689   4.82e+08 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
mrtg_2_bor~w |       450   1.50e+07       6000      25000      45000     100000     300000     650000 
loan_perio~2 |  2.339866    1770.43    6.69942   11.76915   22.08141   48.68794   97.05794   173.4209 
  repay_mt_2 |  23.14286   249639.2        150        625       1000       2600   5555.556      12500 
  intst_rate |       .12         60          4          5          8         10      11.25         13 
    loan_sub |         0        100          0          0        100        100        100        100 
       urban |         0        100          0          0          0          0        100        100 
      hhsize |         1         20          1          2          3          3          4          5 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        21         95         28         32         35         40         47         56 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
mrtg_2_bor~w |   1500000    2400000    3800000 
loan_perio~2 |  264.7641   407.5601    1770.43 
  repay_mt_2 |  25833.33      36000    86617.3 
  intst_rate |        15         24         36 
    loan_sub |       100        100        100 
       urban |       100        100        100 
      hhsize |         7          8         10 
 head_female |         0        100        100 
    head_age |        65         70         80 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
mrtg_2_bor~w |       936    2091162   356985.3   2.78e+11   526818.2   3.669742   20.67894   7.47e+11 
loan_perio~2 |       936    2091162   195.1284   121462.1   348.5142   3.347879   13.86029   4.08e+08 
  repay_mt_2 |       936    2091162   7413.202   1.52e+08   12343.08   7.450976   99.75605   1.55e+10 
  intst_rate |       936    2091162   11.97784   28.61961    5.34973   2.705215   16.18486   2.50e+07 
    loan_sub |       936    2091162   88.56974   1013.458   31.83485   -2.42441   6.877763   1.85e+08 
       urban |       936    2091162   56.46817   2460.792   49.60637  -.2609192   1.068079   1.18e+08 
      hhsize |       936    2091162   4.628252   5.191987   2.278593   2.285077   12.62294    9678424 
 head_female |       936    2091162   9.734484    879.628   29.65852   2.716726   8.380601   2.04e+07 
    head_age |       936    2091162   50.91168   166.7273   12.91229   .4130706   2.538268   1.06e+08 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
mrtg_2_bor~w |      3000    4500000       4000      20000      20000      50000     200000     400000 
loan_perio~2 |  2.729418    1770.43   5.513911   9.346294   18.32412   35.86497   84.91321   176.8743 
  repay_mt_2 |      72.5   249639.2       72.5        400   587.2727   1818.182       3690       7940 
  intst_rate |         2         60          4          5          7        9.9      11.24         13 
    loan_sub |         0        100          0          0          0        100        100        100 
       urban |         0        100          0          0          0          0        100        100 
      hhsize |         1         20          1          2          2          3          4          5 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        21         95         28         32         35         41         49         60 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
mrtg_2_bor~w |    800000    1400000    3000000 
loan_perio~2 |  340.4933    1183.21    1770.43 
  repay_mt_2 |  19254.55      28125   49142.86 
  intst_rate |        17         24         36 
    loan_sub |       100        100        100 
       urban |       100        100        100 
      hhsize |         7          9         14 
 head_female |         0        100        100 
    head_age |        68         75         80 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
mrtg_1_bor~w |      3244    8055622   668649.6   7.57e+11   870066.4   3.162255   18.34676   5.39e+12 
loan_perio~1 |      3244    8055622   156.6183   56647.67   238.0077   5.202478   33.69549   1.26e+09 
  repay_mt_1 |      3244    8055622   11962.84   3.20e+08   17895.26   4.781253   37.62635   9.64e+10 
  intst_rate |      3244    8055622    11.4829     17.645   4.200596   3.425555   28.09928   9.25e+07 
    loan_sub |      3244    8055622   93.35135   620.8519    24.9169  -3.480211   13.11187   7.52e+08 
       urban |      3244    8055622   71.31094   2046.475   45.23798  -.9423157   1.887959   5.74e+08 
      hhsize |      3244    8055622   4.505855    3.64478   1.909131   1.652205    9.36588   3.63e+07 
 head_female |      3244    8055622   8.317444   762.7996   27.61883   3.018881   10.11364   6.70e+07 
    head_age |      3244    8055622     49.295   133.7609   11.56551   .5640014   2.950771   3.97e+08 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
mrtg_1_bor~w |      7000   1.00e+07      20000      40000      58000     150000     400000     800000 
loan_perio~1 |  2.339866    1770.43    7.53366   15.37438   26.20565   53.24054   101.8687    178.182 
  repay_mt_1 |        70   249639.2   333.3333        732   1454.545       3200       6250    13095.5 
  intst_rate |        .5         60          4          5        7.5         10         11       12.5 
    loan_sub |         0        100          0          0        100        100        100        100 
       urban |         0        100          0          0          0          0        100        100 
      hhsize |         1         20          1          2          3          3          4          5 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        21         95         28         33         36         40         48         56 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
mrtg_1_bor~w |   1800000    2500000    4000000 
loan_perio~1 |  264.3022   359.8298    1770.43 
  repay_mt_1 |     27392      40000    86617.3 
  intst_rate |        15         16         34 
    loan_sub |       100        100        100 
       urban |       100        100        100 
      hhsize |         7          8         10 
 head_female |         0        100        100 
    head_age |        65         71         80 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
mrtg_1_bor~w |      1998    4883400   836771.7   9.25e+11   961870.9    3.00993   16.67427   4.09e+12 
loan_perio~1 |      1998    4883400   151.8553   37268.55   193.0506   6.320159   51.79823   7.42e+08 
  repay_mt_1 |      1998    4883400   14464.23   3.91e+08    19775.3    4.11024   27.13202   7.06e+10 
  intst_rate |      1998    4883400   11.06745   5.895081   2.427979   1.869668   21.92156   5.40e+07 
    loan_sub |      1998    4883400   96.54721   333.5239   18.26264  -5.098811   26.99787   4.71e+08 
       urban |      1998    4883400   79.87793   1608.114    40.1013  -1.490496   3.221578   3.90e+08 
      hhsize |      1998    4883400   4.407726   2.997319   1.731277   1.254754       6.23   2.15e+07 
 head_female |      1998    4883400   7.448892   689.7484   26.26306   3.241188    11.5053   3.64e+07 
    head_age |      1998    4883400   49.18192   124.0616   11.13829   .5404746     3.0606   2.40e+08 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
mrtg_1_bor~w |      8000   1.00e+07      40000     100000     150000     300000     500000    1000000 
loan_perio~1 |  3.229259    1770.43   8.904614   18.32317   26.70295   63.17465   123.3028   180.1059 
  repay_mt_1 |  258.3333   233333.3        750       2000   2684.143       4400       8200      15000 
  intst_rate |        .5         36          5       7.25        8.5         10         11         12 
    loan_sub |         0        100          0        100        100        100        100        100 
       urban |         0        100          0          0          0        100        100        100 
      hhsize |         1         16          1          2          3          3          4          5 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        25         90         28         32         36         41         48         56 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
mrtg_1_bor~w |   2000000    2500000    4480000 
loan_perio~1 |  255.9691   308.9471    1770.43 
  repay_mt_1 |     31500   49583.33     120000 
  intst_rate |        14         14      17.25 
    loan_sub |       100        100        100 
       urban |       100        100        100 
      hhsize |         7          8         10 
 head_female |         0        100        100 
    head_age |        65         70         79 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
mrtg_2_bor~w |      3936    9896665   598155.2   7.73e+11   879192.5   4.556622   45.06712   5.92e+12 
loan_perio~2 |      3936    9896665   159.6134    64553.1    254.073   4.682896   27.50433   1.58e+09 
  repay_mt_2 |      3936    9896665   11076.18   3.24e+08   17989.93   5.287554   45.51959   1.10e+11 
  intst_rate |      3936    9896665   11.97241   26.61682   5.159149   3.234454   21.86497   1.18e+08 
    loan_sub |      3936    9896665   90.86772   830.0403   28.81042   -2.83737    9.05067   8.99e+08 
       urban |      3936    9896665   68.47413   2159.255   46.46779  -.7952379   1.632403   6.78e+08 
      hhsize |      3936    9896665   4.483355   3.518761   1.875836   1.694868   9.526407   4.44e+07 
 head_female |      3936    9896665   8.992342     818.58   28.61084   2.866946   9.219382   8.90e+07 
    head_age |      3936    9896665   48.70849   137.5817   11.72952   .5357805   2.978689   4.82e+08 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
mrtg_2_bor~w |       450   1.50e+07       6000      25000      45000     100000     300000     650000 
loan_perio~2 |  2.339866    1770.43    6.69942   11.76915   22.08141   48.68794   97.05794   173.4209 
  repay_mt_2 |  23.14286   249639.2        150        625       1000       2600   5555.556      12500 
  intst_rate |       .12         60          4          5          8         10      11.25         13 
    loan_sub |         0        100          0          0        100        100        100        100 
       urban |         0        100          0          0          0          0        100        100 
      hhsize |         1         20          1          2          3          3          4          5 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        21         95         28         32         35         40         47         56 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
mrtg_2_bor~w |   1500000    2400000    3800000 
loan_perio~2 |  264.7641   407.5601    1770.43 
  repay_mt_2 |  25833.33      36000    86617.3 
  intst_rate |        15         24         36 
    loan_sub |       100        100        100 
       urban |       100        100        100 
      hhsize |         7          8         10 
 head_female |         0        100        100 
    head_age |        65         70         80 

             |  e(count)   e(sum_w)    e(mean)     e(Var)      e(sd)  e(skewn~)  e(kurto~)     e(sum) 
-------------+----------------------------------------------------------------------------------------
mrtg_2_bor~w |      2275    5646618   790816.1   1.01e+12    1006418   4.437288   41.27058   4.47e+12 
loan_perio~2 |      2275    5646618    143.998   35889.24   189.4446    6.40881   53.53136   8.13e+08 
  repay_mt_2 |      2275    5646618   14278.08   4.28e+08   20695.45   4.563998    33.4689   8.06e+10 
  intst_rate |      2275    5646618   11.24191   12.12068   3.481476   5.777145   71.98682   6.35e+07 
    loan_sub |      2275    5646618    95.6038   420.4781   20.50556  -4.448922   20.79291   5.40e+08 
       urban |      2275    5646618   79.68427   1619.556    40.2437   -1.47555   3.177248   4.50e+08 
      hhsize |      2275    5646618   4.429712   2.984623   1.727606   1.302458   6.432934   2.50e+07 
 head_female |      2275    5646618   7.902721   728.1392   26.98405   3.120846   10.73968   4.46e+07 
    head_age |      2275    5646618   49.33856   124.0219   11.13651   .5773961    3.17378   2.79e+08 

             |    e(min)     e(max)      e(p1)      e(p5)     e(p10)     e(p25)     e(p50)     e(p75) 
-------------+----------------------------------------------------------------------------------------
mrtg_2_bor~w |      2500   1.50e+07      25000      65000     100000     250000     500000     940000 
loan_perio~2 |  3.050778    1770.43    7.44779   14.38152   23.58258   57.41718   114.4301   179.2756 
  repay_mt_2 |       225     245000     656.25   1428.571       2500       4100       7700      14971 
  intst_rate |       .12         60          4          7        8.5         10         11         12 
    loan_sub |         0        100          0        100        100        100        100        100 
       urban |         0        100          0          0          0        100        100        100 
      hhsize |         1         16          1          2          3          3          4          5 
 head_female |         0        100          0          0          0          0          0          0 
    head_age |        25         90         29         33         36         42         48         56 

             |    e(p90)     e(p95)     e(p99) 
-------------+---------------------------------
mrtg_2_bor~w |   2000000    2500000    4000000 
loan_perio~2 |  240.9865   306.9342    1183.21 
  repay_mt_2 |     31500   49583.33   122545.5 
  intst_rate |        14       14.5         24 
    loan_sub |       100        100        100 
       urban |       100        100        100 
      hhsize |         6          8         10 
 head_female |         0        100        100 
    head_age |        65         70         80 

. 
. forvalues x = 1/2 {
  2. esttab total_`x' qtl_1_`x' qtl_2_`x' qtl_3_`x' qtl_4_`x' qtl_5_`x', cells(mean(fmt(%15.0fc))) label coll
> abels(none) ///
>  mtitles("All" "Q1" "Q2" "Q3" "Q4" "Q5") stats(N, label("Observations") fmt(%15.0gc)) ///
>  title("Table 3.1 Summary Statistics of Mortgages (mean)_`x' by Wealth Quintile") varwidth(40) ///
>  addnotes("Notes: Households weighted by survey weights.",  ///
>           "       The term of loan is imputed by monthly payment, interest rate, and the mortgage value at 
> inception.")
  3. }

Table 3.1 Summary Statistics of Mortgages (mean)_1 by Wealth Quintile
-------------------------------------------------------------------------------------------------------------
> ---------
                                                  (1)          (2)          (3)          (4)          (5)    
>       (6)
                                                  All           Q1           Q2           Q3           Q4    
>        Q5
-------------------------------------------------------------------------------------------------------------
> ---------
Mortgage Value at Inception_1                 668,650      566,659      162,931      322,642      396,728    
>   836,772
Term of Loan_1 (mt)                               157          127          218          164          174    
>       152
Monthly Payment_1                              11,963        9,203        5,518        6,403        8,485    
>    14,464
Interest rate (%)                                  11           11           15           14           12    
>        11
Subsidized (%)                                     93           96           77           84           88    
>        97
Urban Household (%)                                71           56           36           60           62    
>        80
Household Size                                      5            5            5            4            5    
>         4
Female Household Head (%)                           8           11           15            7            9    
>         7
Household Head Age                                 49           45           46           48           53    
>        49
-------------------------------------------------------------------------------------------------------------
> ---------
Observations                                    3,244          140          117          253          736    
>     1,998
-------------------------------------------------------------------------------------------------------------
> ---------
Notes: Households weighted by survey weights.
,
       The term of loan is imputed by monthly payment, interest rate, and the mortgage value at inception.

Table 3.1 Summary Statistics of Mortgages (mean)_2 by Wealth Quintile
-------------------------------------------------------------------------------------------------------------
> ---------
                                                  (1)          (2)          (3)          (4)          (5)    
>       (6)
                                                  All           Q1           Q2           Q3           Q4    
>        Q5
-------------------------------------------------------------------------------------------------------------
> ---------
Mortgage Value at Inception_2                 598,155      503,524      125,207      222,684      356,985    
>   790,816
Term of Loan_2 (mt)                               160          140          204          177          195    
>       144
Monthly Payment_2                              11,076        8,430        4,161        4,732        7,413    
>    14,278
Interest rate (%)                                  12           13           14           15           12    
>        11
Subsidized (%)                                     91           86           73           78           89    
>        96
Urban Household (%)                                68           60           32           50           56    
>        80
Household Size                                      4            5            4            4            5    
>         4
Female Household Head (%)                           9           10           11           13           10    
>         8
Household Head Age                                 49           44           44           47           51    
>        49
-------------------------------------------------------------------------------------------------------------
> ---------
Observations                                    3,936          192          174          359          936    
>     2,275
-------------------------------------------------------------------------------------------------------------
> ---------
Notes: Households weighted by survey weights.
,
       The term of loan is imputed by monthly payment, interest rate, and the mortgage value at inception.

. 
. forvalues x = 1/2 {
  2. esttab total_`x' qtl_1_`x' qtl_2_`x' qtl_3_`x' qtl_4_`x' qtl_5_`x', cells(p50(fmt(%15.0fc))) label colla
> bels(none) ///
>  mtitles("All" "Q1" "Q2" "Q3" "Q4" "Q5") stats(N, label("Observations") fmt(%15.0gc)) ///
>  title("Table 3.2 Summary Statistics of Mortgages (med)_`x' by Wealth Quintile") varwidth(40) ///
>  addnotes("Notes: Households weighted by survey weights.",  ///
>           "       The term of loan is imputed by monthly payment, interest rate, and the mortgage value at 
> inception.")
  3. }

Table 3.2 Summary Statistics of Mortgages (med)_1 by Wealth Quintile
-------------------------------------------------------------------------------------------------------------
> ---------
                                                  (1)          (2)          (3)          (4)          (5)    
>       (6)
                                                  All           Q1           Q2           Q3           Q4    
>        Q5
-------------------------------------------------------------------------------------------------------------
> ---------
Mortgage Value at Inception_1                 400,000      150,000       74,000      180,000      278,000    
>   500,000
Term of Loan_1 (mt)                               102           71           55           72           85    
>       123
Monthly Payment_1                               6,250        3,200        2,222        4,714        4,200    
>     8,200
Interest rate (%)                                  11           12           13           12           11    
>        11
Subsidized (%)                                    100          100          100          100          100    
>       100
Urban Household (%)                               100          100            0          100          100    
>       100
Household Size                                      4            4            4            4            4    
>         4
Female Household Head (%)                           0            0            0            0            0    
>         0
Household Head Age                                 48           40           47           47           50    
>        48
-------------------------------------------------------------------------------------------------------------
> ---------
Observations                                    3,244          140          117          253          736    
>     1,998
-------------------------------------------------------------------------------------------------------------
> ---------
Notes: Households weighted by survey weights.
,
       The term of loan is imputed by monthly payment, interest rate, and the mortgage value at inception.

Table 3.2 Summary Statistics of Mortgages (med)_2 by Wealth Quintile
-------------------------------------------------------------------------------------------------------------
> ---------
                                                  (1)          (2)          (3)          (4)          (5)    
>       (6)
                                                  All           Q1           Q2           Q3           Q4    
>        Q5
-------------------------------------------------------------------------------------------------------------
> ---------
Mortgage Value at Inception_2                 300,000      150,000       50,000      100,000      200,000    
>   500,000
Term of Loan_2 (mt)                                97           72           55           73           85    
>       114
Monthly Payment_2                               5,556        3,200        1,500        2,500        3,690    
>     7,700
Interest rate (%)                                  11           13           13           12           11    
>        11
Subsidized (%)                                    100          100          100          100          100    
>       100
Urban Household (%)                               100          100            0            0          100    
>       100
Household Size                                      4            4            4            4            4    
>         4
Female Household Head (%)                           0            0            0            0            0    
>         0
Household Head Age                                 47           39           43           46           49    
>        48
-------------------------------------------------------------------------------------------------------------
> ---------
Observations                                    3,936          192          174          359          936    
>     2,275
-------------------------------------------------------------------------------------------------------------
> ---------
Notes: Households weighted by survey weights.
,
       The term of loan is imputed by monthly payment, interest rate, and the mortgage value at inception.

. 
. *******************************************************************
. *** Table 4. creat the tables for the imputed 
. *******************************************************************
. use "${r_output}\b14_hse_mortgage",clear

. 
. label var mrtg_1_borrow "Mortgage Value at Inception_1"

. label var mrtg_2_borrow "Mortgage Value at Inception_2"

. label var loan_period_1 "Term of Loan_1 (mt)"

. label var loan_period_2 "Term of Loan_2 (mt)"

. label var intst_rate "Interest rate (%)"

. label var repay_mt_1 "Monthly Payment_1"

. label var repay_mt_2 "Monthly Payment_2"

. 
. //impute borrowed amont using payment and insterest rate and demography
. forvalues i = 1/2 {
  2. areg mrtg_`i'_borrow repay_mt_`i' intst_rate urban head_age qtl hhsize,a(year) r
  3. predict mrtg_`i'_borrow_est
  4. replace mrtg_`i'_borrow_est  = . if mrtg_`i'_borrow > 0 | mrtg_`i'_borrow_est<0 //only keep the estimate
>  when the original value is missing. 
  5. sum mrtg_`i'_borrow*
  6. }

Linear regression, absorbing indicators         Number of obs     =     65,208
Absorbed variable: year                         No. of categories =         36
                                                F(   6,  65166)   =     391.72
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4709
                                                Adj R-squared     =     0.4706
                                                Root MSE          =  2.007e+05

------------------------------------------------------------------------------
             |               Robust
mrtg_1_bor~w |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  repay_mt_1 |   39.62949   3.347221    11.84   0.000     33.06894    46.19005
  intst_rate |  -211040.5   20095.69   -10.50   0.000      -250428   -171652.9
       urban |   261.6135   21.16094    12.36   0.000     220.1381     303.089
    head_age |  -184.8857   57.38701    -3.22   0.001    -297.3643   -72.40718
         qtl |   9927.813   1035.295     9.59   0.000     7898.634    11956.99
      hhsize |  -2329.845   442.5789    -5.26   0.000    -3197.299    -1462.39
       _cons |   -4081.54   3106.132    -1.31   0.189    -10169.56     2006.48
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(82,316 missing values generated)
(17,614 real changes made, 17,614 to missing)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
mrtg_1_bor~w |    147,524    20742.16    192949.2          0   1.30e+07
mrtg_1_bor~t |     47,594    24945.86    15851.52   .2224219   63361.47

Linear regression, absorbing indicators         Number of obs     =     65,208
Absorbed variable: year                         No. of categories =         36
                                                F(   6,  65166)   =     424.63
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4729
                                                Adj R-squared     =     0.4726
                                                Root MSE          =  2.093e+05

------------------------------------------------------------------------------
             |               Robust
mrtg_2_bor~w |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
  repay_mt_2 |   38.17278   3.014987    12.66   0.000     32.26341    44.08216
  intst_rate |  -234095.5   21153.55   -11.07   0.000    -275556.4   -192634.5
       urban |   286.5124   21.35056    13.42   0.000     244.6653    328.3595
    head_age |  -188.8457   60.56749    -3.12   0.002     -307.558   -70.13336
         qtl |   10723.63   1040.664    10.30   0.000     8683.926    12763.33
      hhsize |  -2371.599   446.2837    -5.31   0.000    -3246.316   -1496.883
       _cons |  -5376.344   3193.211    -1.68   0.092    -11635.04    882.3509
------------------------------------------------------------------------------
(option xb assumed; fitted values)
(82,316 missing values generated)
(18,412 real changes made, 18,412 to missing)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
mrtg_2_bor~w |    147,524    23194.57    201414.1          0   1.50e+07
mrtg_2_bor~t |     46,796    27051.16    17186.42   1.385376   68372.92

. 
. forvalues i = 1/2 {
  2. br mrtg_`i'_borrow_est intst_rate repay_mt_`i' if mrtg_`i'_borrow_est > 0
  3. replace intst_rate = . if intst_rate == 0
  4. replace repay_mt_`i' = . if repay_mt_`i' == 0
  5. gen double obs_`i' = (intst_rate + mrtg_`i'_borrow_est + repay_mt_`i') != . //obsevations have enough in
> formation to impute loan period
  6. tab obs_`i' //no complete data for imputation. 
  7. }
(23,427 real changes made, 23,427 to missing)
(62,301 real changes made, 62,301 to missing)

      obs_1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    147,524      100.00      100.00
------------+-----------------------------------
      Total |    147,524      100.00
(0 real changes made)
(61,328 real changes made, 61,328 to missing)

      obs_2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    147,524      100.00      100.00
------------+-----------------------------------
      Total |    147,524      100.00

. 
. log close
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\NSS70\03_NSS70_
> Table of Means.log
  log type:  text
 closed on:  19 Nov 2020, 09:47:59
-------------------------------------------------------------------------------------------------------------
