----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\housing_condition\NSS_table_ho
> using_condition.log
  log type:  text
 opened on:  13 Jan 2021, 05:06:51

. set linesize 255

. 
. 
. ****************************************************************************
. * Load data
. ****************************************************************************
. use "${root}\NSS49\Data Output Files\NSS49_housing_condition.dta",clear

. 
. foreach survey in NSS58 NSS65 NSS69 NSS76 {
  2. qui append using "${root}/`survey'/Data Output Files/`survey'_housing_condition.dta",force
  3. }

. 
. drop h20_temp h20_distance h20_exclusive h20b_pip_exl h20b_pip_shr h20b_grd_exl h20b_grd_shr h20b_other h20_cooking ///
> san_source san_distance

. 
. save "${r_output}\NSS_housing_condition.dta",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\\housing_condition\NSS_housing_condition.dta saved

. 
. ****************************************************************************
. * Generate the time series table of housing conditions
. ****************************************************************************
. use "${r_output}\NSS_housing_condition.dta",clear

. 
. ********************
. *prepare the data***
. ********************
. 
. *By survey generate consumption quintile for All India households****
. xtile qt = hh_umce [aw = hh_weight] if survey == "NSS49", nq(5) 

. 
. foreach survey in NSS58 NSS65 NSS69 NSS76 {
  2.   xtile temp_qt_`survey' = hh_umce [aw = hh_weight] if survey == "`survey'", nq(5) 
  3.   qui replace qt = temp_qt_`survey' if survey == "`survey'" 
  4. }

. drop temp*

. 
. *produce delta between q1 and q5 for each variable****
. //ssc inst asgen  //the package for weighted mean 
. 
. local var_list hh_size in_room in_wall_permanent in_roof_permanent in_floor_permanent in_all_permanent in_sep_kitch in_flat in_size in_ppl_room in_ppl_area h20_improved san_improved san_flush_private

. local nss_round "NSS49 NSS58 NSS65 NSS69 NSS76" 

. 
. foreach var in `var_list' {
  2. //sort out the first and fifth quintile
.  forvalues i = 1(4)5 {
  3.  qui gen `var'_`i' = `var' *(qt == `i')
  4.  qui replace `var'_`i'  = . if (qt != `i')
  5.  }
  6. }

. 
. foreach var in `var_list' {
  2.  foreach stat in mn md {
  3.    qui gen `var'_d_`stat' = .
  4.  }
  5.  
.  foreach survey in `nss_round' {
  6.   forvalues i = 1(4)5 {
  7.    //calculate the weighted mean
.    qui asgen `var'_`i'_`survey'_mn = `var'_`i' if survey == "`survey'",w(hh_weight)  
  8.    
.    //calculate the weighted median
.    qui gen `var'_`i'_`survey'_md = . if survey == "`survey'"
  9.    qui summarize `var'_`i' [aw = hh_weight] if survey == "`survey'",de
 10.    qui replace `var'_`i'_`survey'_md = r(p50) if survey == "`survey'"
 11.   }
 12.   
.   foreach stat in mn md {
 13.    qui gen tp_`var'_`survey'_d_`stat' = (`var'_5_`survey'_`stat'  - `var'_1_`survey'_`stat')/`var'_1_`survey'_`stat'
 14.    qui replace `var'_d_`stat'  = tp_`var'_`survey'_d_`stat'  if survey == "`survey'"
 15.   }
 16.  }
 17. }

. 
. local var_list hh_size in_room in_wall_permanent in_roof_permanent in_floor_permanent in_all_permanent in_sep_kitch in_flat in_size in_ppl_room in_ppl_area h20_improved san_improved san_flush_private

. foreach var in `var_list' {
  2.  local label_old: var label `var'
  3.  local label = " Delta  Q5 & Q1" + ": `label_old'" 
  4.  
.  foreach stat in mn md {
  5.   label var `var'_d_`stat' "`label'"
  6.  }
  7. }

. 
. drop tp*

. save "${r_output}\NSS_housing_condition_final.dta",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\\housing_condition\NSS_housing_condition_final.dta saved

. 
. ********************
. *produce the table**
. ********************
. 
. use "${r_output}\NSS_housing_condition_final.dta",replace

. 
. *All, Urban, Rural India housing condition****
. local var_summary hh_size in_room in_wall_permanent in_roof_permanent in_floor_permanent in_all_permanent in_sep_kitch in_flat in_size in_ppl_room in_ppl_area h20_improved san_improved san_flush_private

. local nss_round "NSS49 NSS58 NSS65 NSS69 NSS76" 

. foreach survey in `nss_round' {
  2.   qui eststo `survey': quietly estpost summarize `var_summary'  [aw=hh_weight] if survey == "`survey'",de
  3.   qui eststo `survey'_u: quietly estpost summarize `var_summary'  [aw=hh_weight] if survey == "`survey'" & hh_urban == 1,de
  4.   qui eststo `survey'_r: quietly estpost summarize `var_summary'  [aw=hh_weight] if survey == "`survey'" & hh_urban == 0,de
  5. }

. 
. esttab NSS49 NSS58 NSS65 NSS69 NSS76, cells(mean(fmt(%15.1fc))) label collabels(none) varwidth(41) ///
>  mtitles("1993" "2002" "2009" "2012" "2018") stats(N, label("Observations") fmt(%15.0fc)) /// 
>  title("Table 1.1 Summary Statistics of Housing Condition in India (mean)") ///
>  addnotes("Notes: The value is missing if the information was not surveyed in the NSS round")

Table 1.1 Summary Statistics of Housing Condition in India (mean)
----------------------------------------------------------------------------------------------------------
                                                   (1)          (2)          (3)          (4)          (5)
                                                  1993         2002         2009         2012         2018
----------------------------------------------------------------------------------------------------------
Size of Household                                  5.0          5.0          4.8          4.5          4.3
Number of Rooms                                    2.8          2.9          3.2          3.7          3.9
Wall: Cement or Stone (%)                         48.8         62.2         68.9         76.1         83.5
Roof: Cement or Stone (%)                         29.2         41.7         48.7         53.3         64.6
Floor: Cement or Stone (%)                        35.8         49.8         59.0         63.8         72.5
All Materials: Cement or Stone (%)                21.6         31.4         39.2         43.4         55.1
Separate Kitchen (%)                              39.1         44.4         50.4         53.3         60.2
Flat (%)                                             .          9.9          9.7         17.8         12.9
Dwelling Size (sq ft)                            432.0        406.9        444.8        428.1        499.6
People per room                                    2.4          2.3          1.9          1.7          1.4
Area in sq ft per person                         105.4         98.8        111.4        112.1        138.7
Water: Improved Source (%)                        70.0         82.9         86.9         85.4         85.3
Sanitation: Improved Source (%)                   18.4         25.5         33.4         52.3         76.8
Sanitation: Exclusive Flush (%)                   18.4         25.5         33.4         40.1         52.4
----------------------------------------------------------------------------------------------------------
Observations                                   119,421       97,882      153,518       95,548      106,838
----------------------------------------------------------------------------------------------------------
Notes: The value is missing if the information was not surveyed in the NSS round

.  
. esttab NSS49 NSS58 NSS65 NSS69 NSS76, cells(p50(fmt(%15.1fc))) label collabels(none) varwidth(41) ///
>  mtitles("1993" "2002" "2009" "2012" "2018") stats(N, label("Observations") fmt(%15.0fc)) /// 
>  title("Table 1.2 Summary Statistics of Housing Condition in India (med)") ///
>  addnotes("Notes: The value is missing if the information was not surveyed in the NSS round")

Table 1.2 Summary Statistics of Housing Condition in India (med)
----------------------------------------------------------------------------------------------------------
                                                   (1)          (2)          (3)          (4)          (5)
                                                  1993         2002         2009         2012         2018
----------------------------------------------------------------------------------------------------------
Size of Household                                  5.0          5.0          5.0          4.0          4.0
Number of Rooms                                    2.0          2.0          3.0          3.0          4.0
Wall: Cement or Stone (%)                          0.0        100.0        100.0        100.0        100.0
Roof: Cement or Stone (%)                          0.0          0.0          0.0        100.0        100.0
Floor: Cement or Stone (%)                         0.0          0.0        100.0        100.0        100.0
All Materials: Cement or Stone (%)                 0.0          0.0          0.0          0.0        100.0
Separate Kitchen (%)                               0.0          0.0        100.0        100.0        100.0
Flat (%)                                             .          0.0          0.0          0.0          0.0
Dwelling Size (sq ft)                            333.7        315.0        360.0        354.0        430.0
People per room                                    2.0          2.0          1.5          1.3          1.0
Area in sq ft per person                          75.3         71.0         83.3         84.8        106.7
Water: Improved Source (%)                       100.0        100.0        100.0        100.0        100.0
Sanitation: Improved Source (%)                    0.0          0.0          0.0        100.0        100.0
Sanitation: Exclusive Flush (%)                    0.0          0.0          0.0          0.0        100.0
----------------------------------------------------------------------------------------------------------
Observations                                   119,421       97,882      153,518       95,548      106,838
----------------------------------------------------------------------------------------------------------
Notes: The value is missing if the information was not surveyed in the NSS round

. 
. esttab NSS49_u NSS58_u NSS65_u NSS69_u NSS76_u, cells(mean(fmt(%15.1fc))) label collabels(none) varwidth(41) ///
>  mtitles("1993" "2002" "2009" "2012" "2018") stats(N, label("Observations") fmt(%15.0gc)) /// 
>  title("Table 2.1 Summary Statistics of Housing Condition in Urban India (mean)") ///
>  addnotes("Notes: The value is missing if the information was not surveyed in the NSS round")

Table 2.1 Summary Statistics of Housing Condition in Urban India (mean)
----------------------------------------------------------------------------------------------------------
                                                   (1)          (2)          (3)          (4)          (5)
                                                  1993         2002         2009         2012         2018
----------------------------------------------------------------------------------------------------------
Size of Household                                  4.6          4.5          4.2          4.1          3.9
Number of Rooms                                    2.8          3.2          3.6          4.3          4.3
Wall: Cement or Stone (%)                         78.8         87.9         91.8         93.4         95.4
Roof: Cement or Stone (%)                         57.8         64.1         71.3         73.8         82.4
Floor: Cement or Stone (%)                        75.9         86.7         91.5         93.2         95.5
All Materials: Cement or Stone (%)                52.9         60.8         68.4         71.7         80.3
Separate Kitchen (%)                              49.9         56.0         62.6         66.0         75.2
Flat (%)                                             .         22.7         24.4         39.4         31.3
Dwelling Size (sq ft)                            392.7        395.4        429.9        422.0        496.7
People per room                                    2.3          1.9          1.6          1.2          1.1
Area in sq ft per person                         104.4        111.4        125.9        123.8        155.4
Water: Improved Source (%)                        89.0         93.2         91.8         89.0         82.1
Sanitation: Improved Source (%)                   53.4         63.2         71.8         84.1         92.5
Sanitation: Exclusive Flush (%)                   53.4         63.2         71.8         76.5         82.0
----------------------------------------------------------------------------------------------------------
Observations                                    44,371       41,916       56,374       42,155       43,102
----------------------------------------------------------------------------------------------------------
Notes: The value is missing if the information was not surveyed in the NSS round

.  
. esttab NSS49_u NSS58_u NSS65_u NSS69_u NSS76_u, cells(p50(fmt(%15.1fc))) label collabels(none) varwidth(41) ///
>  mtitles("1993" "2002" "2009" "2012" "2018") stats(N, label("Observations") fmt(%15.0gc)) /// 
>  title("Table 2.2 Summary Statistics of Housing Condition in Urban India (med)") ///
>  addnotes("Notes: The value is missing if the information was not surveyed in the NSS round")

Table 2.2 Summary Statistics of Housing Condition in Urban India (med)
----------------------------------------------------------------------------------------------------------
                                                   (1)          (2)          (3)          (4)          (5)
                                                  1993         2002         2009         2012         2018
----------------------------------------------------------------------------------------------------------
Size of Household                                  4.0          4.0          4.0          4.0          4.0
Number of Rooms                                    2.0          3.0          3.0          4.0          4.0
Wall: Cement or Stone (%)                        100.0        100.0        100.0        100.0        100.0
Roof: Cement or Stone (%)                        100.0        100.0        100.0        100.0        100.0
Floor: Cement or Stone (%)                       100.0        100.0        100.0        100.0        100.0
All Materials: Cement or Stone (%)               100.0        100.0        100.0        100.0        100.0
Separate Kitchen (%)                               0.0        100.0        100.0        100.0        100.0
Flat (%)                                             .          0.0          0.0          0.0          0.0
Dwelling Size (sq ft)                            301.4        300.0        340.0        350.0        420.0
People per room                                    1.8          1.4          1.0          1.0          1.0
Area in sq ft per person                          72.7         75.0         90.0         93.0        116.5
Water: Improved Source (%)                       100.0        100.0        100.0        100.0        100.0
Sanitation: Improved Source (%)                  100.0        100.0        100.0        100.0        100.0
Sanitation: Exclusive Flush (%)                  100.0        100.0        100.0        100.0        100.0
----------------------------------------------------------------------------------------------------------
Observations                                    44,371       41,916       56,374       42,155       43,102
----------------------------------------------------------------------------------------------------------
Notes: The value is missing if the information was not surveyed in the NSS round

.  
. esttab NSS49_r NSS58_r NSS65_r NSS69_r NSS76_r, cells(mean(fmt(%15.1fc))) label collabels(none) varwidth(41) ///
>  mtitles("1993" "2002" "2009" "2012" "2018") stats(N, label("Observations") fmt(%15.0gc)) /// 
>  title("Table 3.1 Summary Statistics of Housing Condition in Rural India (mean)") ///
>  addnotes("Notes: The value is missing if the information was not surveyed in the NSS round")

Table 3.1 Summary Statistics of Housing Condition in Rural India (mean)
----------------------------------------------------------------------------------------------------------
                                                   (1)          (2)          (3)          (4)          (5)
                                                  1993         2002         2009         2012         2018
----------------------------------------------------------------------------------------------------------
Size of Household                                  5.1          5.1          5.0          4.8          4.5
Number of Rooms                                    2.7          2.8          3.1          3.4          3.7
Wall: Cement or Stone (%)                         38.2         52.1         59.2         68.1         77.3
Roof: Cement or Stone (%)                         19.1         32.9         39.2         43.8         55.4
Floor: Cement or Stone (%)                        21.6         35.2         45.3         50.2         60.5
All Materials: Cement or Stone (%)                10.5         19.8         26.9         30.4         42.0
Separate Kitchen (%)                              35.3         39.9         45.3         47.3         52.4
Flat (%)                                             .          4.9          3.6          7.8          3.4
Dwelling Size (sq ft)                            445.9        411.4        451.0        431.0        501.2
People per room                                    2.5          2.4          2.1          1.9          1.5
Area in sq ft per person                         105.8         93.9        105.3        106.6        130.1
Water: Improved Source (%)                        63.3         78.8         84.9         83.8         86.9
Sanitation: Improved Source (%)                    6.0         10.7         17.3         37.6         68.7
Sanitation: Exclusive Flush (%)                    6.0         10.7         17.3         23.2         37.1
----------------------------------------------------------------------------------------------------------
Observations                                    75,050       55,966       97,144       53,393       63,736
----------------------------------------------------------------------------------------------------------
Notes: The value is missing if the information was not surveyed in the NSS round

.  
. esttab NSS49_r NSS58_r NSS65_r NSS69_r NSS76_r, cells(p50(fmt(%15.1fc))) label collabels(none) varwidth(41) ///
>  mtitles("1993" "2002" "2009" "2012" "2018") stats(N, label("Observations") fmt(%15.0gc)) /// 
>  title("Table 3.2 Summary Statistics of Housing Condition in Rural India (med)") ///
>  addnotes("Notes: The value is missing if the information was not surveyed in the NSS round")

Table 3.2 Summary Statistics of Housing Condition in Rural India (med)
----------------------------------------------------------------------------------------------------------
                                                   (1)          (2)          (3)          (4)          (5)
                                                  1993         2002         2009         2012         2018
----------------------------------------------------------------------------------------------------------
Size of Household                                  5.0          5.0          5.0          4.0          4.0
Number of Rooms                                    2.0          2.0          3.0          3.0          3.0
Wall: Cement or Stone (%)                          0.0        100.0        100.0        100.0        100.0
Roof: Cement or Stone (%)                          0.0          0.0          0.0          0.0        100.0
Floor: Cement or Stone (%)                         0.0          0.0          0.0        100.0        100.0
All Materials: Cement or Stone (%)                 0.0          0.0          0.0          0.0          0.0
Separate Kitchen (%)                               0.0          0.0          0.0          0.0        100.0
Flat (%)                                             .          0.0          0.0          0.0          0.0
Dwelling Size (sq ft)                            344.4        320.0        364.0        358.0        436.0
People per room                                    2.0          2.0          1.7          1.5          1.3
Area in sq ft per person                          77.5         70.0         80.0         81.7        102.9
Water: Improved Source (%)                       100.0        100.0        100.0        100.0        100.0
Sanitation: Improved Source (%)                    0.0          0.0          0.0          0.0        100.0
Sanitation: Exclusive Flush (%)                    0.0          0.0          0.0          0.0          0.0
----------------------------------------------------------------------------------------------------------
Observations                                    75,050       55,966       97,144       53,393       63,736
----------------------------------------------------------------------------------------------------------
Notes: The value is missing if the information was not surveyed in the NSS round

. 
. *All housing condition and quntile delta*****
. drop *_1 *_5

. 
. foreach var in `var_list' {
  2. clonevar `var'_mean = `var'
  3. }
(149 missing values generated)
(119,421 missing values generated)
(297 missing values generated)
(149 missing values generated)
(297 missing values generated)

. 
. //table of means
. local var_summary_mn *_mean *_d_mn

. local nss_round "NSS49 NSS58 NSS65 NSS69 NSS76" 

. foreach survey in `nss_round' {
  2. qui eststo `survey': quietly estpost summarize `var_summary_mn'  [aw=hh_weight] if survey == "`survey'"
  3. }

. 
. esttab NSS49 NSS58 NSS65 NSS69 NSS76, cells(mean(fmt(%15.1fc))) label collabels(none) varwidth(41) ///
>  mtitles("1993" "2002" "2009" "2012" "2018") stats(N, label("Observations") fmt(%15.0gc)) /// 
>  title("Table 4.1 Summary Statistics of Housing Condition in India, Delta between Consumption Quintile 1 and 5 (mean)") ///
>  addnotes("Notes: The value is missing if the information was not surveyed in the NSS round" ///
>           "       The consumption quintile is the generated from the monthly per capita consumer expenditure." ///
>                   "       The delta is the between the statistics for the fifth quintile and the first quintile.")

Table 4.1 Summary Statistics of Housing Condition in India, Delta between Consumption Quintile 1 and 5 (mean)
----------------------------------------------------------------------------------------------------------
                                                   (1)          (2)          (3)          (4)          (5)
                                                  1993         2002         2009         2012         2018
----------------------------------------------------------------------------------------------------------
Size of Household                                  5.0          5.0          4.8          4.5          4.3
Number of Rooms                                    2.8          2.9          3.2          3.7          3.9
Wall: Cement or Stone (%)                         48.8         62.2         68.9         76.1         83.5
Roof: Cement or Stone (%)                         29.2         41.7         48.7         53.3         64.6
Floor: Cement or Stone (%)                        35.8         49.8         59.0         63.8         72.5
All Materials: Cement or Stone (%)                21.6         31.4         39.2         43.4         55.1
Separate Kitchen (%)                              39.1         44.4         50.4         53.3         60.2
Flat (%)                                             .          9.9          9.7         17.8         12.9
Dwelling Size (sq ft)                            432.0        406.9        444.8        428.1        499.6
People per room                                    2.4          2.3          1.9          1.7          1.4
Area in sq ft per person                         105.4         98.8        111.4        112.1        138.7
Water: Improved Source (%)                        70.0         82.9         86.9         85.4         85.3
Sanitation: Improved Source (%)                   18.4         25.5         33.4         52.3         76.8
Sanitation: Exclusive Flush (%)                   18.4         25.5         33.4         40.1         52.4
Delta  Q5 & Q1: Size of Household                  1.4          1.3          1.0          0.9          1.1
Delta  Q5 & Q1: Number of Rooms                    1.0          1.4          1.3          1.4          1.0
Delta  Q5 & Q1: Wall: Cement or Stone (%           1.2          0.9          0.7          0.6          0.4
Delta  Q5 & Q1: Roof: Cement or Stone (%           2.0          1.5          1.2          1.2          0.8
Delta  Q5 & Q1: Floor: Cement or Stone (           1.8          1.4          1.1          1.2          0.7
Delta  Q5 & Q1: All Materials: Cement or           2.7          2.4          2.0          2.1          1.3
Delta  Q5 & Q1: Separate Kitchen (%)               1.6          2.1          1.7          1.7          1.4
Delta  Q5 & Q1: Flat (%)                             .          1.3          1.5          1.7          2.5
Delta  Q5 & Q1: Dwelling Size (sq ft)              1.1          1.5          1.4          1.3          1.0
Delta  Q5 & Q1: People per room                    0.3         -0.0         -0.1         -0.3         -0.0
Delta  Q5 & Q1: Area in sq ft per person          -0.3         -0.0          0.1          0.2         -0.1
Delta  Q5 & Q1: Water: Improved Source (           0.2          0.1          0.0         -0.0         -0.1
Delta  Q5 & Q1: Sanitation: Improved Sou           3.5          3.4          2.5          2.0          0.5
Delta  Q5 & Q1: Sanitation: Exclusive Fl           3.5          3.4          2.5          2.6          1.2
----------------------------------------------------------------------------------------------------------
Observations                                   119,421       97,882      153,518       95,548      106,838
----------------------------------------------------------------------------------------------------------
Notes: The value is missing if the information was not surveyed in the NSS round
       The consumption quintile is the generated from the monthly per capita consumer expenditure.
       The delta is the between the statistics for the fifth quintile and the first quintile.

. 
. //table of medians. 
. local var_summary_md *_mean *_d_md

. local nss_round "NSS49 NSS58 NSS65 NSS69 NSS76" 

. foreach survey in `nss_round' {
  2. qui eststo `survey': quietly estpost summarize `var_summary_md' [aw=hh_weight] if survey == "`survey'",de
  3. }

. 
. esttab NSS49 NSS58 NSS65 NSS69 NSS76, cells(p50(fmt(%15.1fc))) label collabels(none) varwidth(41) ///
>  mtitles("1993" "2002" "2009" "2012" "2018") stats(N, label("Observations") fmt(%15.0gc)) /// 
>  title("Table 4.2 Summary Statistics of Housing Condition in India, Delta between Consumption Quintile 1 and 5 (med)") ///
>  addnotes("Notes: The value is missing if the information was not surveyed in the NSS round" ///
>           "       The consumption quintile is the generated from the monthly per capita consumer expenditure." ///
>                   "       The delta is the between the statistics for the fifth quintile and the first quintile.")

Table 4.2 Summary Statistics of Housing Condition in India, Delta between Consumption Quintile 1 and 5 (med)
----------------------------------------------------------------------------------------------------------
                                                   (1)          (2)          (3)          (4)          (5)
                                                  1993         2002         2009         2012         2018
----------------------------------------------------------------------------------------------------------
Size of Household                                  5.0          5.0          5.0          4.0          4.0
Number of Rooms                                    2.0          2.0          3.0          3.0          4.0
Wall: Cement or Stone (%)                          0.0        100.0        100.0        100.0        100.0
Roof: Cement or Stone (%)                          0.0          0.0          0.0        100.0        100.0
Floor: Cement or Stone (%)                         0.0          0.0        100.0        100.0        100.0
All Materials: Cement or Stone (%)                 0.0          0.0          0.0          0.0        100.0
Separate Kitchen (%)                               0.0          0.0        100.0        100.0        100.0
Flat (%)                                             .          0.0          0.0          0.0          0.0
Dwelling Size (sq ft)                            333.7        315.0        360.0        354.0        430.0
People per room                                    2.0          2.0          1.5          1.3          1.0
Area in sq ft per person                          75.3         71.0         83.3         84.8        106.7
Water: Improved Source (%)                       100.0        100.0        100.0        100.0        100.0
Sanitation: Improved Source (%)                    0.0          0.0          0.0        100.0        100.0
Sanitation: Exclusive Flush (%)                    0.0          0.0          0.0          0.0        100.0
Delta  Q5 & Q1: Size of Household                  1.0          1.0          0.7          0.7          1.5
Delta  Q5 & Q1: Number of Rooms                    1.0          1.0          1.5          1.5          1.5
Delta  Q5 & Q1: Wall: Cement or Stone (%             .            .          0.0          0.0          0.0
Delta  Q5 & Q1: Roof: Cement or Stone (%             .            .            .            .            .
Delta  Q5 & Q1: Floor: Cement or Stone (             .            .            .            .          0.0
Delta  Q5 & Q1: All Materials: Cement or             .            .            .            .            .
Delta  Q5 & Q1: Separate Kitchen (%)                 .            .            .            .            .
Delta  Q5 & Q1: Flat (%)                             .            .            .            .            .
Delta  Q5 & Q1: Dwelling Size (sq ft)              1.2          1.7          1.5          1.4          1.0
Delta  Q5 & Q1: People per room                    0.3         -0.0         -0.1          0.0          0.0
Delta  Q5 & Q1: Area in sq ft per person          -0.2          0.1          0.1          0.3         -0.0
Delta  Q5 & Q1: Water: Improved Source (           0.0          0.0          0.0          0.0          0.0
Delta  Q5 & Q1: Sanitation: Improved Sou             .            .            .            .          0.0
Delta  Q5 & Q1: Sanitation: Exclusive Fl             .            .            .            .            .
----------------------------------------------------------------------------------------------------------
Observations                                   119,421       97,882      153,518       95,548      106,838
----------------------------------------------------------------------------------------------------------
Notes: The value is missing if the information was not surveyed in the NSS round
       The consumption quintile is the generated from the monthly per capita consumer expenditure.
       The delta is the between the statistics for the fifth quintile and the first quintile.

.                   
. ***converging trend of housing condition for q1 and q5 (All)***
. use "${r_output}\NSS_housing_condition_final.dta",replace

. collapse (mean) *_mn *_md,by(survey)   

. 
. local var_list in_wall_permanent in_roof_permanent in_floor_permanent in_all_permanent in_sep_kitch in_flat h20_improved san_improved san_flush_private

. local nss_round "NSS49 NSS58 NSS65 NSS69 NSS76" 

. 
. foreach var in `var_list' {
  2. qui gen d_mn_`var' = . 
  3. qui gen d_md_`var' = . 
  4. 
.  foreach survey in `nss_round' {
  5.   foreach stat in mn md {
  6.   qui gen tp_`var'_`survey'_d_`stat' = `var'_5_`survey'_`stat' - `var'_1_`survey'_`stat' //calculate the percentage delta
  7.   qui replace d_`stat'_`var' = tp_`var'_`survey'_d_`stat' if survey == "`survey'"
  8.   }
  9.  }
 10. }

. 
. drop tp*

. 
. gen year = .
(5 missing values generated)

. replace year = 1993 if survey == "NSS49"
(1 real change made)

. replace year = 2002 if survey == "NSS58"
(1 real change made)

. replace year = 2009 if survey == "NSS65"
(1 real change made)

. replace year = 2012 if survey == "NSS69"
(1 real change made)

. replace year = 2018 if survey == "NSS76"
(1 real change made)

. 
. keep year d*

. 
. save "${r_output}\test",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\\housing_condition\test.dta saved

. 
. *by variable the time trend of housing quality equality (only regression on mean is done, med is not yet. )
. estimates clear

. local var_list in_wall_permanent in_roof_permanent in_floor_permanent in_all_permanent in_sep_kitch in_flat h20_improved san_improved san_flush_private

. 
. foreach var in `var_list' {
  2. qui reg d_`var'_mn year
  3. eststo `var'
  4. }
variable d_in_wall_permanent_mn not found
r(111);

end of do-file

r(111);

. do "C:\Users\wb500886\AppData\Local\Temp\statacmd.tmp"

. estimates clear

. local var_list in_wall_permanent in_roof_permanent in_floor_permanent in_all_permanent in_sep_kitch in_flat h20_improved san_improved san_flush_private

. 
. foreach var in `var_list' {
  2. qui reg d_mn_`var' year
  3. eststo `var'
  4. }

. 
end of do-file

. do "C:\Users\wb500886\AppData\Local\Temp\statacmd.tmp"

. esttab `var_list' , nose not label b("%9.2f")   r2 /// fmt( %9.0gc %9.0gc %9.2f)) ///
> title("Regression of Housing Condition Equality between Q1 and Q5 on Year (TN)") ///
> addnotes("Note: Regressions dependent variables are the delta of housing condition indicator measures" ///
>          "      between quintile 5 and 1.")     

Regression of Housing Condition Equality between Q1 and Q5 on Year (TN)
--------------------------------------------------------------------------------------------------------------------------------------------------------------------
                              (1)             (2)             (3)             (4)             (5)             (6)             (7)             (8)             (9)   
                     d_mn_in_wa~t    d_mn_in_ro~t    d_mn_in_f~nt    d_mn_in_al~t    d_mn_in_se~h    d_mn_in_flat    d_mn_h20_i~d    d_mn_san_i~d    d_mn_san_f~e   
--------------------------------------------------------------------------------------------------------------------------------------------------------------------
year                        -0.62*           0.07            0.02            0.54            0.48            0.61           -0.77***         0.18            0.46   
Constant                  1273.21*        -105.40            1.85        -1034.24         -909.21        -1202.52         1543.39***      -327.20         -881.36   
--------------------------------------------------------------------------------------------------------------------------------------------------------------------
Observations                    5               5               5               5               5               4               5               5               5   
R-squared                   0.787           0.054           0.002           0.612           0.654           0.617           0.999           0.030           0.389   
--------------------------------------------------------------------------------------------------------------------------------------------------------------------
Note: Regressions dependent variables are the delta of housing condition indicator measures
      between quintile 5 and 1.
* p<0.05, ** p<0.01, *** p<0.001

. 
end of do-file

. do "C:\Users\wb500886\AppData\Local\Temp\statacmd.tmp"

. *reshape to get general trend with variable as fixed effect
. reshape long d_mn d_md,i(year) j(ind) string
(note: j = _h20_improved _in_all_permanent _in_flat _in_floor_permanent _in_roof_permanent _in_sep_kitch _in_wall_permanent _san_flush_private _san_improved)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                        5   ->      45
Number of variables                  28   ->      13
j variable (9 values)                     ->   ind
xij variables:
d_mn_h20_improved d_mn_in_all_permanent ... d_mn_san_improved->d_mn
d_md_h20_improved d_md_in_all_permanent ... d_md_san_improved->d_md
-----------------------------------------------------------------------------

. areg d_mn year, absorb(ind) vce(cluster ind)

Linear regression, absorbing indicators         Number of obs     =         44
Absorbed variable: ind                          No. of categories =          9
                                                F(   1,      8)   =       0.14
                                                Prob > F          =     0.7201
                                                R-squared         =     0.8655
                                                Adj R-squared     =     0.8299
                                                Root MSE          =     6.6673

                                    (Std. Err. adjusted for 9 clusters in ind)
------------------------------------------------------------------------------
             |               Robust
        d_mn |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        year |   .0703613   .1895256     0.37   0.720    -.3666855    .5074081
       _cons |  -105.0568   380.3994    -0.28   0.789    -982.2593    772.1458
------------------------------------------------------------------------------

. areg d_md year, absorb(ind) vce(cluster ind)

Linear regression, absorbing indicators         Number of obs     =         44
Absorbed variable: ind                          No. of categories =          9
                                                F(   1,      8)   =       0.00
                                                Prob > F          =     0.9912
                                                R-squared         =     0.5399
                                                Adj R-squared     =     0.4181
                                                Root MSE          =    37.5733

                                    (Std. Err. adjusted for 9 clusters in ind)
------------------------------------------------------------------------------
             |               Robust
        d_md |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        year |   .0129068   1.128055     0.01   0.991    -2.588392    2.614206
       _cons |   35.45829   2264.134     0.02   0.988    -5185.644    5256.561
------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\housing_condition\NSS_table_housing_condition.log
  log type:  text
 closed on:  13 Jan 2021, 05:27:35
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
