-----------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\housing_condition\NSS_table_housing_condition.log
  log type:  text
 opened on:   8 Dec 2020, 08:04:15

. ****************************************************************************
. * Load data
. ****************************************************************************
. use "${root}\NSS49\Data Output Files\NSS49_housing_condition.dta",clear

. 
. foreach survey in NSS58 NSS65 NSS69 NSS76 {
  2. append using "${root}/`survey'/Data Output Files/`survey'_housing_condition.dta",force
  3. }
(note: variable B3_q2 was byte in the using data, but will be str2 now)
(note: variable B3_q5 was str1 in the using data, but will be byte now)
(note: variable B3_q6 was double in the using data, but will be str1 now)
(note: variable B3_q10 was int in the using data, but will be str1 now)
(note: variable B3_q11 was int in the using data, but will be str1 now)
(note: variable B3_q12 was str1 in the using data, but will be byte now)
(note: variable B3_q7 was str1, now str5 to accommodate using data's values)
(note: variable B3_q8 was str1, now str3 to accommodate using data's values)
(note: variable B6_q3 was byte, now int to accommodate using data's values)
(note: variable B6_q4 was int, now long to accommodate using data's values)
(note: variable B6_q6 was byte, now long to accommodate using data's values)
(note: variable B6_q13 was byte, now int to accommodate using data's values)
(note: variable B6_q14 was byte, now int to accommodate using data's values)
(note: variable B6_q15 was byte, now int to accommodate using data's values)
(label hh_urbanl already defined)
(label hh_tnl already defined)
(note: variable B3_q2 was byte in the using data, but will be str2 now)
(note: variable B3_q5 was str5 in the using data, but will be byte now)
(note: variable B3_q12 was str1 in the using data, but will be byte now)
(note: variable B3_q14 was long in the using data, but will be str1 now)
(note: variable B3_q15 was int in the using data, but will be str2 now)
(note: variable B3_q16 was int in the using data, but will be str1 now)
(note: variable B4_q5 was byte in the using data, but will be str1 now)
(note: variable B3_q6 was str1, now str3 to accommodate using data's values)
(note: variable B3_q10 was str1, now str2 to accommodate using data's values)
(note: variable B3_q17 was byte, now long to accommodate using data's values)
(note: variable B3_q18 was byte, now int to accommodate using data's values)
(note: variable B6_q5 was byte, now int to accommodate using data's values)
(note: variable B6_q7 was byte, now int to accommodate using data's values)
(note: variable B6_q8 was byte, now int to accommodate using data's values)
(note: variable B6_q17 was byte, now int to accommodate using data's values)
(label hh_urbanl already defined)
(label hh_tnl already defined)
(label hh_tnl already defined)
(label hh_urbanl already defined)
(note: variable id was str16, now str29 to accommodate using data's values)
(note: variable hh_weight was float, now double to accommodate using data's values)
(label water already defined)
(label hh_urbanl already defined)
(label hh_tnl already defined)

. 
. drop h20_temp h20_distance h20_exclusive h20b_pip_exl h20b_pip_shr h20b_grd_exl h20b_grd_shr h20b_other h20_cooking ///
> san_source san_distance

. 
. ****************************************************************************
. * Generate the time series table of housing conditions
. ****************************************************************************
. local var_summary hh_size in_* h20* san* 

. 
. foreach survey in $nss_round {
  2. qui eststo `survey': quietly estpost summarize `var_summary'  [aw=hh_weight] if survey == "`survey'"
  3. qui eststo `survey'_u: quietly estpost summarize `var_summary'  [aw=hh_weight] if survey == "`survey'" & hh_urban == 1
  4. qui eststo `survey'_r: quietly estpost summarize `var_summary'  [aw=hh_weight] if survey == "`survey'" & hh_urban == 0
  5. }

. 
. esttab NSS49 NSS58 NSS65 NSS69 NSS76, cells(mean(fmt(%15.0fc))) label collabels(none) varwidth(41) ///
>  mtitles("1993" "2002" "2009" "2012" "2018") stats(N, label("Observations") fmt(%15.0gc)) /// 
>  title("Table 1 Summary Statistics of Housing Condition (mean)") ///
>  addnotes("Notes: The value is missing if the information was not surveyed in the NSS round")

Table 1 Summary Statistics of Housing Condition (mean)
----------------------------------------------------------------------------------------------------------
                                                   (1)          (2)          (3)          (4)          (5)
                                                  1993         2002         2009         2012         2018
----------------------------------------------------------------------------------------------------------
Size of Household                                    5            5            5            5            4
Number of Rooms                                      3            3            3            4            4
Wall: Cement or Stone (%)                           49           62           69           76           84
Roof: Cement or Stone (%)                           29           42           49           53           65
Floor: Cement or Stone (%)                          36           50           59           64           73
All Materials: Cement or Stone (%)                  22           31           39           43           55
Separate Kitchen (%)                                39           44           50           53           60
Flat (%)                                             .           10           10           18           13
Dwelling Size (sq ft)                              432          407          445          428          500
People per room                                      2            2            2            2            1
Area in sq ft per person                           105           99          111          112          139
Water: Improved Source (%)                          70           83           87           85           85
Sanitation: Improved Source (%)                     18           26           33           52           77
Sanitation: Exclusive Flush (%)                     18           26           33           40           52
----------------------------------------------------------------------------------------------------------
Observations                                   119,421       97,882      153,518       95,548      106,838
----------------------------------------------------------------------------------------------------------
Notes: The value is missing if the information was not surveyed in the NSS round

. 
. esttab NSS49_u NSS58_u NSS65_u NSS69_u NSS76_u, cells(mean(fmt(%15.0fc))) label collabels(none) varwidth(41) ///
>  mtitles("1993" "2002" "2"2002" "2009" "2012" "2018") stats(N, label("Observations") fmt(%15.0gc)) /// 
unmatched quote
r(198);

end of do-file

r(198);

. do "C:\Users\wb500886\AppData\Local\Temp\statacmd.tmp"

. log close
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\housing_condition\NSS_table_housing_condition.log
  log type:  text
 closed on:   8 Dec 2020, 08:05:30
-----------------------------------------------------------------------------------------------------------------------------------------------------
