---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\NSS68\01_NSS68_Residual_Income_Affordability.log
  log type:  text
 opened on:  25 Jan 2021, 07:50:58

. set linesize 255

. 
. ***************************************************************
. *Step 1: Estimate the housing consumption per household member. 
. ***************************************************************
. use "${r_input}\bk_12.dta",clear

. merge m:1 ID using "${r_input}\bk_3.dta"
(label state already defined)
(label B1_v04 already defined)
(label B1_v05 already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         3,562,593  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. gen hh_size = B3_v01

.    
. /* poverty line is by state and by sector */
. 
.     *estimate housing related expenditure:
.           
.           
.           *Fuel and light (12: 18, 30 days recall period)
.           gen double fuel = B12_v06*(B12_v01 == 18)

.         
.           egen double total_fuel = sum(fuel), by(ID)

. 
.           bys ID: keep if _n == 1 // keep only one observation for each HH
(3,460,931 observations deleted)

.         
.       merge 1:m ID using "${r_input}\bk_10.dta"
(note: variable B1_v00 was byte, now int to accommodate using data's values)
(label B1_v05 already defined)
(label B1_v04 already defined)
(label state already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                            33
        from master                        33  (_merge==1)
        from using                          0  (_merge==2)

    matched                         2,362,394  (_merge==3)
    -----------------------------------------

.       drop _merge

.      
.           *water charge(10: 540, 30 days recall period)
.           gen water = B10_v03*(B10_v02 == 540)
(33 missing values generated)

.           
.           *Rent charge (10: 520, 30 days recall period)
.           gen rent = B10_v03*(B10_v02 == 520)
(33 missing values generated)

.           
.           foreach var in water rent { 
  2.           egen double total_`var' = sum(`var'), by(ID)
  3.           } 

.           
.           bys ID: keep if _n == 1 // keep only one observation for each HH
(2,260,765 observations deleted)

.         
.         *Total housing expenditure
.         egen double exp_housing = rowtotal(total_rent total_fuel total_water)

. 
.     *Housing consumption per capita
.         gen double total_exp_housing_pp = exp_housing/hh_size 

.         
.     *Identify renters
.         gen renter = (total_rent > 0 & !mi(total_rent)) & B3_v18 == 2 //rent is positive and tenure status is hire. 

. 
. ******************************************************************************
. *Step 2: Estimate the non-housing expenditure for household at national pline
. ******************************************************************************
. rename ID hhid

. merge 1:1 hhid using "${r_input}\poverty68.dta"
(label state already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           101,662  (_merge==3)
    -----------------------------------------

. keep if _merge == 3
(0 observations deleted)

. drop _merge

.    
.    *different budget scenario: pline, double pline, triple pline.    
.    forvalues i = 1/3 {
  2.    gen pline_`i' = pline*`i'
  3.    }

.    
.    *Non-housing consumption per capita
.    gen double exp_non_housing_pp = mpce_mrp - total_exp_housing_pp //all poverty line data are compiled using the MRP metho

.    
.    *Expenditure quintile (for all india, urban and rural sector)
.    xtile mpce_qt = mpce_mrp [aw = hhwt] , n(5)

.    xtile mpce_qt_tn = mpce_mrp [aw = hhwt] if state == 33, n(5)

.    
.    *take log of expenditure
.    gen mpce_mrp_ln = ln(mpce_mrp)

.    
.    *keep urban household only
.    gen urban = (B1_v05 == 2) 

.    keep if urban == 1 //only focusing on urban households
(59,695 observations deleted)

.    
. save "${r_output}\ria_1.dta",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS68\Data Output Files\ria_1.dta saved

. 
. //get the poverty line by state for the urban sector
. use "${r_output}\ria_1.dta",replace

. 
. keep if urban == 1
(0 observations deleted)

. gen state_n = state

. 
. collapse (mean) pline_1 pline_2 pline_3,by(state state_n) 

. gen _Istate_ = 1

. 
. reshape wide _Istate_,i(state pline_1 pline_2 pline_3) j(state_n)
(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       35   ->      35
Number of variables                   6   ->      39
j variable (35 values)          state_n   ->   (dropped)
xij variables:
                               _Istate_   ->   _Istate_1 _Istate_2 ... _Istate_35
-----------------------------------------------------------------------------

. qui mvencode _all, mv(0) //change missing values to zero

. 
. reshape long pline_,i(state) j(levels)
(note: j = 1 2 3)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       35   ->     105
Number of variables                  39   ->      38
j variable (3 values)                     ->   levels
xij variables:
                pline_1 pline_2 pline_3   ->   pline_
-----------------------------------------------------------------------------

. 
. rename pline mpce_mrp

. gen exp_non_housing_pp = . 
(105 missing values generated)

. 
. save "${r_output}\temp.dta",replace
(note: file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS68\Data Output Files\temp.dta not found)
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS68\Data Output Files\temp.dta saved

. 
. //fit renter's non-housing and total expenditure to linear model
. use "${r_output}\ria_1.dta",replace

. gen state_r = state 

. 
. drop if renter != 1 //only focusing on renters. 
(30,389 observations deleted)

. xi: reg exp_non_housing_pp mpce_mrp i.state, noconstant
i.state           _Istate_1-35        (naturally coded; _Istate_1 omitted)

      Source |       SS           df       MS      Number of obs   =    11,578
-------------+----------------------------------   F(35, 11543)    =  10875.44
       Model |  1.3827e+11        35  3.9505e+09   Prob > F        =    0.0000
    Residual |  4.1930e+09    11,543  363250.011   R-squared       =    0.9706
-------------+----------------------------------   Adj R-squared   =    0.9705
       Total |  1.4246e+11    11,578  12304420.2   Root MSE        =     602.7

------------------------------------------------------------------------------
exp_non_ho~p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    mpce_mrp |   .7903426   .0019255   410.45   0.000     .7865682     .794117
   _Istate_2 |   139.5752   49.43321     2.82   0.005     42.67769    236.4726
   _Istate_3 |  -46.78739   31.09841    -1.50   0.132    -107.7456    14.17077
   _Istate_4 |  -277.0921    51.1882    -5.41   0.000    -377.4297   -176.7546
   _Istate_5 |  -75.39085   35.63514    -2.12   0.034    -145.2418    -5.53994
   _Istate_6 |  -339.5667   35.46643    -9.57   0.000    -409.0869   -270.0464
   _Istate_7 |  -394.8331   35.97627   -10.97   0.000    -465.3527   -324.3135
   _Istate_8 |  -46.64612    33.6946    -1.38   0.166    -112.6933    19.40102
   _Istate_9 |  -62.94268   26.24866    -2.40   0.017    -114.3945   -11.49086
  _Istate_10 |  -59.56328   42.52822    -1.40   0.161    -142.9258    23.79923
  _Istate_11 |  -162.2411   57.67821    -2.81   0.005    -275.3002   -49.18207
  _Istate_12 |   40.93403   39.44023     1.04   0.299     -36.3755    118.2436
  _Istate_13 |  -5.807405   81.41073    -0.07   0.943    -165.3862    153.7714
  _Istate_14 |  -134.4309   87.07856    -1.54   0.123    -305.1197    36.25779
  _Istate_15 |  -35.81538   43.13619    -0.83   0.406    -120.3696    48.73887
  _Istate_16 |  -74.74213   57.72065    -1.29   0.195    -187.8844    38.40013
  _Istate_17 |   -102.838    51.5499    -1.99   0.046    -203.8845   -1.791434
  _Istate_18 |   -46.8323   40.99444    -1.14   0.253    -127.1884    33.52375
  _Istate_19 |   26.33028   25.08922     1.05   0.294    -22.84884    75.50941
  _Istate_20 |  -50.96059   34.87509    -1.46   0.144    -119.3217    17.40049
  _Istate_21 |  -50.07788   34.03003    -1.47   0.141    -116.7825    16.62675
  _Istate_22 |   46.01767   47.41078     0.97   0.332    -46.91549    138.9508
  _Istate_23 |   -26.5031   29.81332    -0.89   0.374    -84.94226    31.93606
  _Istate_24 |  -15.48121   31.65551    -0.49   0.625    -77.53137    46.56896
  _Istate_25 |   -79.8028   142.1324    -0.56   0.574    -358.4064    198.8008
  _Istate_26 |  -139.2696   89.00725    -1.56   0.118    -313.7389    35.19966
  _Istate_27 |   -178.136   19.31891    -9.22   0.000    -216.0044   -140.2677
  _Istate_28 |  -83.24809   17.29169    -4.81   0.000    -117.1427   -49.35344
  _Istate_29 |  -123.7012   22.28595    -5.55   0.000    -167.3855   -80.01699
  _Istate_30 |  -46.34145   80.78701    -0.57   0.566    -204.6977    112.0148
  _Istate_31 |   30.14829   101.0527     0.30   0.765    -167.9322    228.2287
  _Istate_32 |  -67.52747   35.95773    -1.88   0.060    -138.0107    2.955772
  _Istate_33 |  -110.9493   17.81595    -6.23   0.000    -145.8716   -76.02703
  _Istate_34 |  -82.18328    47.8834    -1.72   0.086    -176.0429    11.67631
  _Istate_35 |   30.33322   50.36522     0.60   0.547    -68.39115    129.0576
------------------------------------------------------------------------------

. 
. //estimate the non-housing expenditure budget standard (non-housing expenditure poverty line)
. use "${r_output}\temp.dta",clear

. predict exp_non_housing_pp_line_
(option xb assumed; fitted values)

. 
. rename mpce_mrp pline_

. keep state levels pline exp_non_housing_pp_line_

. reshape wide pline exp_non_housing_pp_line_, i(state) j(level)
(note: j = 1 2 3)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                      105   ->      35
Number of variables                   4   ->       7
j variable (3 values)            levels   ->   (dropped)
xij variables:
                                 pline_   ->   pline_1 pline_2 pline_3
               exp_non_housing_pp_line_   ->   exp_non_housing_pp_line_1 exp_non_housing_pp_line_2 exp_non_housing_pp_line_3
-----------------------------------------------------------------------------

. 
. save "${r_output}\ria_non_housing_line.dta",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS68\Data Output Files\ria_non_housing_line.dta saved

. erase "${r_output}\temp.dta"

. 
. //merge the alternative poverty lines to the master data.    
. merge 1:m state using "${r_output}\ria_1.dta"
(label state already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            41,967  (_merge==3)
    -----------------------------------------

. 
. keep if _merge == 3 //only on urban sector
(0 observations deleted)

. drop _merge  

. drop if total_rent == 0 & !mi(total_rent) //only focusing on renters. 
(30,174 observations deleted)

. 
.         *find the affordable housings
.         forvalues i = 1/3 {
  2.     gen affordable_`i' = (exp_non_housing_pp > exp_non_housing_pp_line_`i')*100
  3.     tab affordable_`i' [aw = hhwt]
  4.         
.         gen unaffordable_`i' = (affordable_`i' == 0)*100
  5.     }

affordable_ |
          1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  380.50476        3.23        3.23
        100 | 11,412.495       96.77      100.00
------------+-----------------------------------
      Total |     11,793      100.00

affordable_ |
          2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 3,501.6438       29.69       29.69
        100 | 8,291.3562       70.31      100.00
------------+-----------------------------------
      Total |     11,793      100.00

affordable_ |
          3 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 6,955.4383       58.98       58.98
        100 | 4,837.5617       41.02      100.00
------------+-----------------------------------
      Total |     11,793      100.00

. 
. // hosue keeping
. forvalues i = 1/3 {
  2. label var unaffordable_`i' "Hs. in Unaffordable Housing `i'pline"
  3. label var affordable_`i' "Hs. in Affordable Housing `i'pline"
  4. }

. 
. label var exp_non_housing_pp "Mth. PC. Non-Housing Exp."

. label var total_exp_housing_pp "Mth. PC. Housing Exp."

. 
. save "${r_output}\ria_final.dta",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS68\Data Output Files\ria_final.dta saved

. 
. ******************************************************************************
. *Step 3: stats by consumption quintile 
. ******************************************************************************
.  
. * distribution of owner and renter consumption expenditure in urban area: renters are in higher quintiles. 
. use "${r_output}\ria_1.dta",clear //with both renter and owner. 

. 
. twoway kdensity mpce_mrp_ln [aw = hhwt] if renter == 1 || kdensity mpce_mrp_ln [aw = hhwt] if renter == 0, ///
> legend(order(1 "Renter" 2 "Owner")) title("Table 2. Kdensity of Log Monthly per capita Consumer Expenditure (MPCE) for India Urban Household (2012)", size(tiny)) xtitle("Log MPCE") ytitle("Kdensity")

. graph export "${r_output}/kdensity_tenure_mpce.png",replace
(file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS68\Data Output Files/kdensity_tenure_mpce.png written in PNG format)

. 
. gen tn = (state == 33)

.  
. table renter, c(mean mpce_mrp median mpce_mrp) format(%9.2f) row

------------------------------------------
   renter | mean(mpce_mrp)   med(mpce_mrp)
----------+-------------------------------
        0 |        2433.29         1821.12
        1 |        3337.09         2614.77
          | 
    Total |        2682.63         2021.02
------------------------------------------

. table mpce_qt, c(mean renter) format(%9.2f) row

------------------------
5         |
quantiles |
of        |
mpce_mrp  | mean(renter)
----------+-------------
        1 |         0.11
        2 |         0.16
        3 |         0.20
        4 |         0.26
        5 |         0.38
          | 
    Total |         0.28
------------------------

. 
. table renter if tn == 1, c(mean mpce_mrp median mpce_mrp) format(%9.2f)row

------------------------------------------
   renter | mean(mpce_mrp)   med(mpce_mrp)
----------+-------------------------------
        0 |        2417.22         1920.98
        1 |        3079.54         2506.27
          | 
    Total |        2673.35         2174.48
------------------------------------------

. table mpce_qt_tn if tn == 1, c(mean renter) format(%9.2f) row

------------------------
5         |
quantiles |
of        |
mpce_mrp  | mean(renter)
----------+-------------
        1 |         0.20
        2 |         0.29
        3 |         0.35
        4 |         0.43
        5 |         0.49
          | 
    Total |         0.39
------------------------

. 
. *affordability and the share of housing expenditure to total expenditure (RIA and Ratio Approach)
. use "${r_output}\ria_final.dta",replace

. 
. //total expenditure on housing/total expenditure 
. gen h_t_exp_mn = total_exp_housing_pp/mpce_mrp*100 

. label var h_t_exp_mn "Mean of Housing Exp. / Total Exp. (%)"

. 
. egen h_t_exp_r_md_q = median(h_t_exp_mn),by(mpce_qt)

. egen h_t_exp_r_md_all = median(h_t_exp_mn)

. 
. egen h_t_exp_r_md_q_tn = median(h_t_exp_mn) if state == 33,by(mpce_qt_tn)
(10502 missing values generated)

. egen h_t_exp_r_md_all_tn = median(h_t_exp_mn) if state == 33
(10502 missing values generated)

. 
. foreach var in h_t_exp_r_md_all {
  2. label var `var' "Med.of Housing Exp. / Total Exp. (%)" 
  3. label var `var'_tn "Med.of Housing Exp. / Total Exp. (%)" 
  4. }

. 
. //poverty rate (national)
. replace poor = poor*100
(798 real changes made)

. label var poor "Poverty Rate (%)"

. 
. //table of affordability by quintile
. global var_tab_1 "h_t_exp_mn unaffordable_1 unaffordable_2 unaffordable_3 poor"

. 
. qui eststo total : estpost summarize h_t_exp_r_md_all $var_tab_1 [aw = hhwt],de

. replace h_t_exp_r_md_all = h_t_exp_r_md_q 
(11,793 real changes made)

. 
. qui eststo total_tn : estpost summarize h_t_exp_r_md_all_tn $var_tab_1 [aw = hhwt] if state == 33,de

. replace h_t_exp_r_md_all_tn = h_t_exp_r_md_q_tn
(1,291 real changes made)

. 
. forvalues i = 1/5 {
  2. qui eststo q`i' : estpost summarize h_t_exp_r_md_all $var_tab_1 [aw = hhwt] if mpce_qt == `i',de
  3. qui eststo q`i'_tn : estpost summarize h_t_exp_r_md_all_tn $var_tab_1 [aw = hhwt] if mpce_qt_tn == `i' & state == 33,de
  4. }

. 
. //table for all India
. esttab total q1 q2 q3 q4 q5, cells(mean(fmt(%15.1fc))) label collabels(none) /// 
>  mtitles("All" "Q1" "Q2" "Q3" "Q4" "Q5") stats(N, label("Observations") fmt(%15.0gc)) /// 
>  title("Table 1. Percent of Renter Households with Unaffordable Housing Expenditure by Expenditure Quintile in Urban India (2012)") varwidth(40) ///
>  addnote("Notes: The data source is NSS 68th Round Household Consumer Expenditure." ///
>  "       Households weighted by survey weights." ///
>  "       The analysis is using the Residual Income Approach." ///
>  "       The affordability at 1pline is estimated using renters' non-housing expenses drawn from India's urban national poverty threshold by state as the budget standard." ///
>  "       The affordabiiity at 2pline and 3pline are estimated utilizing the similar approach but with the double and triple poverty thresholds." ///
>  "       Renters are identified as households paying positive rent." ///
>  "       The owner non-housing consumer expenditure is not in the scope as the mortgage payment data is not collected in the the survey.")

Table 1. Percent of Renter Households with Unaffordable Housing Expenditure by Expenditure Quintile in Urban India (2012)
----------------------------------------------------------------------------------------------------------------------
                                                  (1)          (2)          (3)          (4)          (5)          (6)
                                                  All           Q1           Q2           Q3           Q4           Q5
----------------------------------------------------------------------------------------------------------------------
Med.of Housing Exp. / Total Exp. (%)             22.9         24.0         23.3         22.9         22.9         22.7
Mean of Housing Exp. / Total Exp. (%)            24.3         24.9         24.0         23.9         24.2         24.4
Hs. in Unaffordable Housing 1pline                3.2         95.1         27.3          1.4          0.0          0.0
Hs. in Unaffordable Housing 2pline               29.7        100.0        100.0         99.7         50.1          1.5
Hs. in Unaffordable Housing 3pline               59.0        100.0        100.0        100.0         99.8         30.6
Poverty Rate (%)                                  3.5         99.8         34.4          0.1          0.0          0.0
----------------------------------------------------------------------------------------------------------------------
Observations                                   11,793          401          824        1,329        2,697        6,542
----------------------------------------------------------------------------------------------------------------------
Notes: The data source is NSS 68th Round Household Consumer Expenditure.
       Households weighted by survey weights.
       The analysis is using the Residual Income Approach.
       The affordability at 1pline is estimated using renters' non-housing expenses drawn from India's urban national poverty threshold by state as the budget standard.
       The affordabiiity at 2pline and 3pline are estimated utilizing the similar approach but with the double and triple poverty thresholds.
       Renters are identified as households paying positive rent.
       The owner non-housing consumer expenditure is not in the scope as the mortgage payment data is not collected in the the survey.

. 
. //table for TN: higher affordability than india. 
. esttab total_tn q1_tn q2_tn q3_tn q4_tn q5_tn, cells(mean(fmt(%15.1fc))) label collabels(none) /// 
>  mtitles("All" "Q1" "Q2" "Q3" "Q4" "Q5") stats(N, label("Observations") fmt(%15.0gc)) /// 
>  title("Table 2. Percent of Renter Households with Unaffordable Housing Expenditure by Expenditure Quintile in Urban Tamil Nadu (2012)") varwidth(40) ///
>  addnote("Notes: The data source is NSS 68th Round Household Consumer Expenditure." ///
>  "       Households weighted by survey weights." ///
>  "       The analysis is using the Residual Income Approach." ///
>  "       The affordability at 1pline is estimated using renters' non-housing expenses drawn from India's urban national poverty threshold by state as the budget standard." ///
>  "       The affordabiiity at 2pline and 3pline are estimated utilizing the similar approach but with the double and triple poverty thresholds." ///
>  "       Renters are identified as households paying positive rent." ///
>  "       The owner non-housing consumer expenditure is not in the scope as the mortgage payment data is not collected in the the survey.")

Table 2. Percent of Renter Households with Unaffordable Housing Expenditure by Expenditure Quintile in Urban Tamil Nadu (2012)
----------------------------------------------------------------------------------------------------------------------
                                                  (1)          (2)          (3)          (4)          (5)          (6)
                                                  All           Q1           Q2           Q3           Q4           Q5
----------------------------------------------------------------------------------------------------------------------
Med.of Housing Exp. / Total Exp. (%)             23.6         23.6         21.5         23.0         25.2         24.0
Mean of Housing Exp. / Total Exp. (%)            25.0         23.4         22.6         23.2         27.4         24.5
Hs. in Unaffordable Housing 1pline                1.3         30.4          0.0          0.0          0.0          0.0
Hs. in Unaffordable Housing 2pline               26.8        100.0        100.0         65.0         12.5          0.0
Hs. in Unaffordable Housing 3pline               57.5        100.0        100.0        100.0         89.1          6.3
Poverty Rate (%)                                  2.1         49.5          0.0          0.0          0.0          0.0
----------------------------------------------------------------------------------------------------------------------
Observations                                    1,291           87          138          185          354          527
----------------------------------------------------------------------------------------------------------------------
Notes: The data source is NSS 68th Round Household Consumer Expenditure.
       Households weighted by survey weights.
       The analysis is using the Residual Income Approach.
       The affordability at 1pline is estimated using renters' non-housing expenses drawn from India's urban national poverty threshold by state as the budget standard.
       The affordabiiity at 2pline and 3pline are estimated utilizing the similar approach but with the double and triple poverty thresholds.
       Renters are identified as households paying positive rent.
       The owner non-housing consumer expenditure is not in the scope as the mortgage payment data is not collected in the the survey.

. 
. * k-density for affordability: housing/expenditure around. 
. gen exp_non_housing_pp_ln = ln(exp_non_housing_pp)

. 
. sum pline_1 pline_2 pline_3 if state == 33

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     pline_1 |      1,291         937           0        937        937
     pline_2 |      1,291        1874           0       1874       1874
     pline_3 |      1,291        2811           0       2811       2811

. 
. forvalues i = 1/3 {
  2. qui sum pline_`i' if state == 33
  3. local pline_`i'_ln = ln(r(mean))
  4. dis `pline_`i'_ln'
  5. }
6.8426833
7.5358305
7.9412956

. 
. kdensity exp_non_housing_pp_ln if state == 33 [aw=hhwt], xline(`pline_1_ln' `pline_2_ln' `pline_3_ln') ///
> title("NSS68 - 2012, Residual Income vs. Minimum Standard by Scenario in Urban Tamil Nadu", size(small)) ///
> xtitle("Ln of Non-housing Exp. PC.")

. 
. graph export "${r_output}/kdensity_tn.png",replace
(file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS68\Data Output Files/kdensity_tn.png written in PNG format)

. 
. log close
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\NSS68\01_NSS68_Residual_Income_Affordability.log
  log type:  text
 closed on:  25 Jan 2021, 07:52:01
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
