------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\NSS61\02_NSS61_Residual_Income_Affordability.log
  log type:  text
 opened on:  22 Jan 2021, 05:41:00

. set linesize 255

. 
. ***************************************************************
. *Step 1: Estimate the housing consumption per household member. 
. ***************************************************************
. use "${r_input}\Block 10_Monthly expenditure on miscellaneous goods and services including medical (non-institutional), rents and taxes.dta",clear

. merge m:1 HHID using "${r_input}\Block 3.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                           121
        from master                         0  (_merge==1)
        from using                        121  (_merge==2)

    matched                         2,378,390  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. gen hh_size = B3_q1

.    
. /* poverty line is by state and by sector */
. 
.     *estimate housing related expenditure:
.           
.           *Rent (10: code = 529, 30 days recall period)
.           gen double rent = B10_q4*(B10_q1 == "529")
(121 missing values generated)

.           
.           *Water charge(10: 540, 30 days recall period)
.           gen double water = B10_q4*(B10_q1 == "540")
(121 missing values generated)

.           
.           *Collapse at household level for water ant rent
.           foreach var in rent water { 
  2.           egen double total_`var' = sum(`var'), by(HHID)
  3.           } 

.           bys HHID: keep if _n == 1 // keep only one observation for each HH
(2,253,867 observations deleted)

. 
. merge 1:m HHID using "${r_input}\Block 6_Monthly consumption of fuel & light.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                           422
        from master                       422  (_merge==1)
        from using                          0  (_merge==2)

    matched                           637,880  (_merge==3)
    -----------------------------------------

. drop _merge

.           
.           *Fuel and light (12: 18, 30 days recall period)
.           gen double fuel = B6_q6*(B6_q1 == "359")
(422 missing values generated)

.           egen double total_fuel = sum(fuel), by(HHID)

.           bys HHID: keep if _n == 1
(513,658 observations deleted)

. 
.         *Total housing expenditure
.         egen double exp_housing = rowtotal(total_rent total_fuel total_water)

. 
.     *Housing consumption per capita
.         gen double total_exp_housing_pp = exp_housing/hh_size 

.         
.     *Identify renters
.         gen renter = (total_rent > 0 & !mi(total_rent))

. 
. ******************************************************************************
. *Step 2: Estimate the non-housing expenditure for household at national pline
. ******************************************************************************
. rename HHID hhid

. merge 1:1 hhid using "${r_input}\NSS_61_Poverty_For_Aline.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           124,644  (_merge==3)
    -----------------------------------------

. keep if _merge == 3
(0 observations deleted)

. drop _merge

. 
.    gen urban = (sector == 2) 

.    keep if urban == 1 //only focusing on urban households
(79,298 observations deleted)

.    
.    *different budget scenario: pline, double pline, triple pline.    
.    forvalues i = 1/3 {
  2.    gen pline_`i' = pline*`i'
  3.    }

.    
.    *Non-housing consumption per capita
.    gen double exp_non_housing_pp = mpce_mrp - total_exp_housing_pp //all poverty line data are compiled using the MRP metho

.    
.    *Expenditure quintile (for all india, urban and rural sector)
.    xtile mpce_qt = mpce_mrp [aw = hhwt] , n(5)

.    xtile mpce_qt_tn = mpce_mrp [aw = hhwt] if state == 33, n(5)

.    
.    *take log of expenditure
.    gen mpce_mrp_ln = ln(mpce_mrp)

.    
. save "${r_output}\ria_1.dta",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS61\Data Output Files\ria_1.dta saved

. 
. //get the poverty line by state for the urban sector
. use "${r_output}\ria_1.dta",replace

. 
. keep if urban == 1
(0 observations deleted)

. gen state_n = state

. 
. collapse (mean) pline_1 pline_2 pline_3,by(state state_n) 

. gen _Istate_ = 1

. 
. reshape wide _Istate_,i(state pline_1 pline_2 pline_3) j(state_n)
(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       35   ->      35
Number of variables                   6   ->      39
j variable (35 values)          state_n   ->   (dropped)
xij variables:
                               _Istate_   ->   _Istate_1 _Istate_2 ... _Istate_35
-----------------------------------------------------------------------------

. qui mvencode _all, mv(0) //change missing values to zero

. 
. reshape long pline_,i(state) j(levels)
(note: j = 1 2 3)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       35   ->     105
Number of variables                  39   ->      38
j variable (3 values)                     ->   levels
xij variables:
                pline_1 pline_2 pline_3   ->   pline_
-----------------------------------------------------------------------------

. 
. rename pline mpce_mrp

. gen exp_non_housing_pp = . 
(105 missing values generated)

. 
. save "${r_output}\temp.dta",replace
(note: file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS61\Data Output Files\temp.dta not found)
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS61\Data Output Files\temp.dta saved

. 
. //fit renter's non-housing and total expenditure to linear model
. use "${r_output}\ria_1.dta",replace

. gen state_r = state 

. 
. drop if renter != 1 //only focusing on renters. 
(30,757 observations deleted)

. reg exp_non_housing_pp mpce_mrp i.state

      Source |       SS           df       MS      Number of obs   =    14,589
-------------+----------------------------------   F(35, 14553)    =   8279.16
       Model |  1.4790e+10        35   422569339   Prob > F        =    0.0000
    Residual |   742786951    14,553  51040.1258   R-squared       =    0.9522
-------------+----------------------------------   Adj R-squared   =    0.9521
       Total |  1.5533e+10    14,588  1064759.65   Root MSE        =    225.92

---------------------------------------------------------------------------------------
   exp_non_housing_pp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
             mpce_mrp |   .8033692   .0015358   523.11   0.000     .8003589    .8063795
                      |
                state |
    Himachal Pradesh  |  -55.76673   24.51174    -2.28   0.023    -103.8129   -7.720596
              Punjab  |   -63.0184   20.59419    -3.06   0.002    -103.3856   -22.65119
          Chandigarh  |  -234.9013   25.38514    -9.25   0.000    -284.6594   -185.1432
         Uttaranchal  |    -42.451   21.82402    -1.95   0.052    -85.22884    .3268447
             Haryana  |  -62.89814   21.82398    -2.88   0.004    -105.6759   -20.12036
               Delhi  |  -250.2565   20.87945   -11.99   0.000    -291.1829   -209.3301
           Rajasthan  |  -53.69986   21.20109    -2.53   0.011    -95.25668   -12.14304
       Uttar Pradesh  |  -36.24057   19.33378    -1.87   0.061    -74.13724    1.656088
               Bihar  |  -36.78726   20.88268    -1.76   0.078    -77.71996     4.14544
              Sikkim  |  -121.5623   26.87188    -4.52   0.000    -174.2346   -68.89002
   Arunachal Pradesh  |   1.856477   24.84851     0.07   0.940    -46.84976    50.56271
            Nagaland  |  -25.30933   26.20979    -0.97   0.334    -76.68384    26.06519
             Manipur  |  -59.30956   31.32774    -1.89   0.058    -120.7159    2.096789
             Mizoram  |  -44.08508   22.13598    -1.99   0.046    -87.47441   -.6957467
             Tripura  |  -96.01814   26.49771    -3.62   0.000     -147.957   -44.07926
           Meghalaya  |   -97.8606   24.06544    -4.07   0.000    -145.0319   -50.68928
               Assam  |  -6.247833   20.09207    -0.31   0.756    -45.63085    33.13518
         West Bengal  |  -14.35877   18.84773    -0.76   0.446    -51.30271    22.58517
           Jharkhand  |  -18.13258   21.24314    -0.85   0.393    -59.77183    23.50667
              Orissa  |  -40.35904   20.62474    -1.96   0.050    -80.78615    .0680788
         Chhatisgarh  |  -11.71287   22.10678    -0.53   0.596    -55.04496    31.61922
      Madhya Pradesh  |  -26.01007   20.21159    -1.29   0.198    -65.62734    13.60721
             Gujarat  |  -22.98795   19.77112    -1.16   0.245    -61.74185    15.76595
         Daman & Diu  |  -102.0261   50.23168    -2.03   0.042    -200.4866   -3.565621
Dadra & Nagar Haveli  |  -204.8363   35.80457    -5.72   0.000    -275.0178   -134.6548
         Maharashtra  |  -6.107636   18.04047    -0.34   0.735    -41.46924    29.25397
      Andhra Pradesh  |  -76.48066   18.49901    -4.13   0.000    -112.7411   -40.22025
           Karnataka  |  -124.3219   18.82466    -6.60   0.000    -161.2206   -87.42321
                 Goa  |  -81.55344     33.925    -2.40   0.016    -148.0507   -15.05614
         Lakshadweep  |   18.85319   46.07915     0.41   0.682     -71.4678    109.1742
              Kerala  |  -7.369021   22.41686    -0.33   0.742    -51.30891    36.57086
           Tamilnadu  |  -93.48849   18.16959    -5.15   0.000    -129.1032    -57.8738
         Pondicherry  |  -25.60835   23.76482    -1.08   0.281    -72.19042    20.97371
   Andaman & Nicober  |   13.29804   22.74165     0.58   0.559    -31.27848    57.87456
                      |
                _cons |   7.073542   17.47373     0.40   0.686    -27.17718    41.32427
---------------------------------------------------------------------------------------

. 
. qui xi : reg exp_non_housing_pp mpce_mrp i.state

. 
. //estimate the non-housing expenditure budget standard (non-housing expenditure poverty line)
. use "${r_output}\temp.dta",clear

. predict exp_non_housing_pp_line_
(option xb assumed; fitted values)

. 
. rename mpce_mrp pline_

. keep state levels pline exp_non_housing_pp_line_

. reshape wide pline exp_non_housing_pp_line_, i(state) j(level)
(note: j = 1 2 3)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                      105   ->      35
Number of variables                   4   ->       7
j variable (3 values)            levels   ->   (dropped)
xij variables:
                                 pline_   ->   pline_1 pline_2 pline_3
               exp_non_housing_pp_line_   ->   exp_non_housing_pp_line_1 exp_non_housing_pp_line_2 exp_non_housing_pp_line_3
-----------------------------------------------------------------------------

. 
. save "${r_output}\ria_non_housing_line.dta",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS61\Data Output Files\ria_non_housing_line.dta saved

. erase "${r_output}\temp.dta"

. 
. //merge the alternative poverty lines to the master data.    
. merge 1:m state using "${r_output}\ria_1.dta"
(label state already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            45,346  (_merge==3)
    -----------------------------------------

. 
. keep if _merge == 3 //only on urban sector
(0 observations deleted)

. drop _merge  

. drop if renter != 1 //only focusing on renters. 
(30,757 observations deleted)

. 
.         *find the affordable housings
.         forvalues i = 1/3 {
  2.     gen affordable_`i' = (exp_non_housing_pp > exp_non_housing_pp_line_`i')*100
  3.     tab affordable_`i' [aw = hhwt]
  4.         
.         gen unaffordable_`i' = (affordable_`i' == 0)*100
  5.     }

affordable_ |
          1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 1,312.3841        9.00        9.00
        100 | 13,276.616       91.00      100.00
------------+-----------------------------------
      Total |     14,589      100.00

affordable_ |
          2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 7,100.3401       48.67       48.67
        100 | 7,488.6599       51.33      100.00
------------+-----------------------------------
      Total |     14,589      100.00

affordable_ |
          3 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 10,726.802       73.53       73.53
        100 | 3,862.1981       26.47      100.00
------------+-----------------------------------
      Total |     14,589      100.00

. 
. // hosue keeping
. forvalues i = 1/3 {
  2. label var unaffordable_`i' "Hs. in Unaffordable Housing `i'pline"
  3. label var affordable_`i' "Hs. in Affordable Housing `i'pline"
  4. }

. 
. label var exp_non_housing_pp "Mth. PC. Non-Housing Exp."

. label var total_exp_housing_pp "Mth. PC. Housing Exp."

. 
. save "${r_output}\ria_final.dta",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS61\Data Output Files\ria_final.dta saved

. 
. ******************************************************************************
. *Step 3: stats by consumption quintile 
. ******************************************************************************
.  
. * distribution of owner and renter consumption expenditure in urban area: renters are in higher quintiles. 
. use "${r_output}\ria_1.dta",clear //with both renter and owner. 

. 
. twoway kdensity mpce_mrp_ln [aw = hhwt] if renter == 1 || kdensity mpce_mrp_ln [aw = hhwt] if renter == 0, ///
> legend(order(1 "Renter" 2 "Owner")) title("Table 2. Kdensity of Log Monthly per capita Consumer Expenditure (MPCE) for India Urban Household (2004)", size(tiny)) xtitle("Log MPCE") ytitle("Kdensity")

. 
. gen tn = (state == 33)

.  
. table renter, c(mean mpce_mrp median mpce_mrp) format(%9.2f)

------------------------------------------
   renter | mean(mpce_mrp)   med(mpce_mrp)
----------+-------------------------------
        0 |        1047.41          770.97
        1 |        1460.47         1109.94
------------------------------------------

. table mpce_qt, c(mean renter) format(%9.2f)

------------------------
5         |
quantiles |
of        |
mpce_mrp  | mean(renter)
----------+-------------
        1 |         0.19
        2 |         0.29
        3 |         0.33
        4 |         0.39
        5 |         0.48
------------------------

. 
. table renter if tn == 1, c(mean mpce_mrp median mpce_mrp) format(%9.2f)

------------------------------------------
   renter | mean(mpce_mrp)   med(mpce_mrp)
----------+-------------------------------
        0 |        1104.88          750.87
        1 |        1352.68          984.96
------------------------------------------

. table mpce_qt_tn if tn == 1, c(mean renter) format(%9.2f)

------------------------
5         |
quantiles |
of        |
mpce_mrp  | mean(renter)
----------+-------------
        1 |         0.32
        2 |         0.40
        3 |         0.46
        4 |         0.45
        5 |         0.51
------------------------

. 
. *affordability and the share of housing expenditure to total expenditure (RIA and Ratio Approach)
. use "${r_output}\ria_final.dta",replace

. 
. gen h_t_exp_mn = total_exp_housing_pp/mpce_mrp*100 

. label var h_t_exp_mn "Mean of Housing Exp. / Total Exp. (%)"

. 
. egen h_t_exp_r_md_q = median(h_t_exp_mn),by(mpce_qt)

. egen h_t_exp_r_md_all = median(h_t_exp_mn)

. 
. egen h_t_exp_r_md_q_tn = median(h_t_exp_mn) if state == 33,by(mpce_qt_tn)
(12880 missing values generated)

. egen h_t_exp_r_md_all_tn = median(h_t_exp_mn) if state == 33
(12880 missing values generated)

. 
. foreach var in h_t_exp_r_md_all {
  2. label var `var' "Med.of Housing Exp. / Total Exp. (%)" 
  3. label var `var'_tn "Med.of Housing Exp. / Total Exp. (%)" 
  4. }

. 
. global var_tab_1 "h_t_exp_mn unaffordable_1 unaffordable_2 unaffordable_3"

. 
. qui eststo total : estpost summarize h_t_exp_r_md_all $var_tab_1 [aw = hhwt],de

. replace h_t_exp_r_md_all = h_t_exp_r_md_q 
(14,589 real changes made)

. 
. qui eststo total_tn : estpost summarize h_t_exp_r_md_all_tn $var_tab_1 [aw = hhwt] if state == 33,de

. replace h_t_exp_r_md_all_tn = h_t_exp_r_md_q_tn
(1,709 real changes made)

. 
. forvalues i = 1/5 {
  2. qui eststo q`i' : estpost summarize h_t_exp_r_md_all $var_tab_1 [aw = hhwt] if mpce_qt == `i',de
  3. qui eststo q`i'_tn : estpost summarize h_t_exp_r_md_all_tn $var_tab_1 [aw = hhwt] if mpce_qt_tn == `i' & state == 33,de
  4. }

. 
. //table for all India
. esttab total q1 q2 q3 q4 q5, cells(mean(fmt(%15.1fc))) label collabels(none) /// 
>  mtitles("All" "Q1" "Q2" "Q3" "Q4" "Q5") stats(N, label("Observations") fmt(%15.0gc)) /// 
>  title("Table 1. Percent of Renter Households with Unaffordable Housing Expenditure by Expenditure Quintile in Urban India (2004)") varwidth(40) ///
>  addnote("Notes: The data source is NSS 68th Round Household Consumer Expenditure." ///
>  "       Households weighted by survey weights." ///
>  "       The analysis is using the Residual Income Approach." ///
>  "       The affordability at 1pline is estimated using renters' non-housing expenses drawn from India's urban national poverty threshold by state as the budget standard." ///
>  "       The affordabiiity at 2pline and 3pline are estimated utilizing the similar approach but with the double and triple poverty thresholds." ///
>  "       Renters are identified as households paying positive rent." ///
>  "       The owner non-housing consumer expenditure is not in the scope as the mortgage payment data is not collected in the the survey.")

Table 1. Percent of Renter Households with Unaffordable Housing Expenditure by Expenditure Quintile in Urban India (2004)
----------------------------------------------------------------------------------------------------------------------
                                                  (1)          (2)          (3)          (4)          (5)          (6)
                                                  All           Q1           Q2           Q3           Q4           Q5
----------------------------------------------------------------------------------------------------------------------
Med.of Housing Exp. / Total Exp. (%)             22.7         23.1         23.9         23.1         22.3         21.5
Mean of Housing Exp. / Total Exp. (%)            24.0         23.5         24.6         24.6         23.9         23.4
Hs. in Unaffordable Housing 1pline                9.0         73.4         11.2          0.2          0.0          0.0
Hs. in Unaffordable Housing 2pline               48.7        100.0        100.0         86.5         18.5          0.4
Hs. in Unaffordable Housing 3pline               73.5        100.0        100.0        100.0         91.9         14.6
----------------------------------------------------------------------------------------------------------------------
Observations                                   14,589        2,352        2,588        2,596        3,065        3,988
----------------------------------------------------------------------------------------------------------------------
Notes: The data source is NSS 68th Round Household Consumer Expenditure.
       Households weighted by survey weights.
       The analysis is using the Residual Income Approach.
       The affordability at 1pline is estimated using renters' non-housing expenses drawn from India's urban national poverty threshold by state as the budget standard.
       The affordabiiity at 2pline and 3pline are estimated utilizing the similar approach but with the double and triple poverty thresholds.
       Renters are identified as households paying positive rent.
       The owner non-housing consumer expenditure is not in the scope as the mortgage payment data is not collected in the the survey.

. 
. //table for TN: higher affordability than india. 
. esttab total_tn q1_tn q2_tn q3_tn q4_tn q5_tn, cells(mean(fmt(%15.1fc))) label collabels(none) /// 
>  mtitles("All" "Q1" "Q2" "Q3" "Q4" "Q5") stats(N, label("Observations") fmt(%15.0gc)) /// 
>  title("Table 2. Percent of Renter Households with Unaffordable Housing Expenditure by Expenditure Quintile in Urban Tamil Nadu (2004)") varwidth(40) ///
>  addnote("Notes: The data source is NSS 68th Round Household Consumer Expenditure." ///
>  "       Households weighted by survey weights." ///
>  "       The analysis is using the Residual Income Approach." ///
>  "       The affordability at 1pline is estimated using renters' non-housing expenses drawn from India's urban national poverty threshold by state as the budget standard." ///
>  "       The affordabiiity at 2pline and 3pline are estimated utilizing the similar approach but with the double and triple poverty thresholds." ///
>  "       Renters are identified as households paying positive rent." ///
>  "       The owner non-housing consumer expenditure is not in the scope as the mortgage payment data is not collected in the the survey.")

Table 2. Percent of Renter Households with Unaffordable Housing Expenditure by Expenditure Quintile in Urban Tamil Nadu (2004)
----------------------------------------------------------------------------------------------------------------------
                                                  (1)          (2)          (3)          (4)          (5)          (6)
                                                  All           Q1           Q2           Q3           Q4           Q5
----------------------------------------------------------------------------------------------------------------------
Med.of Housing Exp. / Total Exp. (%)             26.4         27.7         26.7         26.0         26.0         24.8
Mean of Housing Exp. / Total Exp. (%)            27.5         26.1         27.9         27.4         28.4         27.1
Hs. in Unaffordable Housing 1pline                6.6         49.0          3.6          0.0          0.0          0.0
Hs. in Unaffordable Housing 2pline               49.6        100.0        100.0         82.9         12.3          0.1
Hs. in Unaffordable Housing 3pline               73.7        100.0        100.0        100.0         85.6         12.8
----------------------------------------------------------------------------------------------------------------------
Observations                                    1,709          415          288          275          315          416
----------------------------------------------------------------------------------------------------------------------
Notes: The data source is NSS 68th Round Household Consumer Expenditure.
       Households weighted by survey weights.
       The analysis is using the Residual Income Approach.
       The affordability at 1pline is estimated using renters' non-housing expenses drawn from India's urban national poverty threshold by state as the budget standard.
       The affordabiiity at 2pline and 3pline are estimated utilizing the similar approach but with the double and triple poverty thresholds.
       Renters are identified as households paying positive rent.
       The owner non-housing consumer expenditure is not in the scope as the mortgage payment data is not collected in the the survey.

. 
. * k-density for affordability: housing/expenditure around. 
. gen exp_non_housing_pp_ln = ln(exp_non_housing_pp)

. 
. sum pline_1 pline_2 pline_3 if state == 33

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     pline_1 |      1,709      559.77           0     559.77     559.77
     pline_2 |      1,709     1119.54           0    1119.54    1119.54
     pline_3 |      1,709     1679.31           0    1679.31    1679.31

. 
. forvalues i = 1/3 {
  2. qui sum pline_`i' if state == 33
  3. local pline_`i'_ln = ln(r(mean))
  4. dis `pline_`i'_ln'
  5. }
6.327526
7.0206732
7.4261383

. 
. kdensity exp_non_housing_pp_ln if state == 33 [aw=hhwt], xline(`pline_1_ln' `pline_2_ln' `pline_3_ln') ///
> title("NSS61 - 2004, Residual Income vs. Minimum Standard by Scenario in Urban Tamil Nadu", size(small)) ///
> xtitle("Ln of Non-housing Exp. PC.")

.  
. log close
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\NSS61\02_NSS61_Residual_Income_Affordability.log
  log type:  text
 closed on:  22 Jan 2021, 05:42:19
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
