--------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\NSS61\02_NSS61_Residua
> l_Income_Affordability.log
  log type:  text
 opened on:  10 Feb 2021, 05:21:43

. set linesize 255

. 
. ***************************************************************
. *Step 1: Estimate the housing consumption per household member. 
. ***************************************************************
. use "${r_input}\Block 10_Monthly expenditure on miscellaneous goods and services including medical (non-institutional), rents and taxes.dta",clear

. merge m:1 HHID using "${r_input}\Block 3.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                           121
        from master                         0  (_merge==1)
        from using                        121  (_merge==2)

    matched                         2,378,390  (_merge==3)
    -----------------------------------------

. drop _merge

. merge m:1 HHID using "${r_input}\Block 3 Part 2_Household Characteristics.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         2,378,511  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. gen hh_size = B3_q1

.    
. /* poverty line is by state and by sector */
. 
.     *estimate housing related expenditure:
.           
.           *Rent (10: code = 529, 30 days recall period)
.           gen double rent = B10_q4*(B10_q1 == "520")
(121 missing values generated)

.           
.           *Water charge(10: 540, 30 days recall period)
.           gen double water = B10_q4*(B10_q1 == "540")
(121 missing values generated)

.           
.           *Collapse at household level for water ant rent
.           foreach var in rent water { 
  2.           egen double total_`var' = sum(`var'), by(HHID)
  3.           } 

.           bys HHID: keep if _n == 1 // keep only one observation for each HH
(2,253,867 observations deleted)

. 
. merge 1:m HHID using "${r_input}\Block 6_Monthly consumption of fuel & light.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                           422
        from master                       422  (_merge==1)
        from using                          0  (_merge==2)

    matched                           637,880  (_merge==3)
    -----------------------------------------

. drop _merge

.           
.           *Fuel and light (12: 18, 30 days recall period)
.           gen double fuel = B6_q6*(B6_q1 == "359")
(422 missing values generated)

.           egen double total_fuel = sum(fuel), by(HHID)

.           bys HHID: keep if _n == 1
(513,658 observations deleted)

. 
.         *Total housing expenditure
.         egen double exp_housing = rowtotal(total_rent total_fuel total_water)

. 
.     *Housing consumption per capita
.         gen double total_exp_housing_pp = exp_housing/hh_size 

.         
.     *Identify renters
.         gen renter = (total_rent > 0 & !mi(total_rent)) & B3_q16 == "2" //rent is positive and tenure status is hire. 

. 
. ******************************************************************************
. *Step 2: Estimate the non-housing expenditure for household at national pline
. ******************************************************************************
. rename HHID hhid

. merge 1:1 hhid using "${r_input}\NSS_61_Poverty_For_Aline.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           124,644  (_merge==3)
    -----------------------------------------

. keep if _merge == 3
(0 observations deleted)

. drop _merge

.    
.    *different budget scenario: pline, double pline, triple pline.    
.    forvalues i = 1/3 {
  2.    gen pline_`i' = pline*`i'
  3.    }

.    
.    *Non-housing consumption per capita
.    gen double exp_non_housing_pp = mpce_mrp - total_exp_housing_pp //all poverty line data are compiled using the MRP metho

.    
.    *Expenditure quintile (for all india, urban and rural sector)
.    xtile mpce_qt = mpce_mrp [aw = hhwt] , n(5)

.    xtile mpce_qt_tn = mpce_mrp [aw = hhwt] if state == 33, n(5)

.    
.    *take log of expenditure
.    gen mpce_mrp_ln = ln(mpce_mrp)

.    
.    *only focusing on urban households
.    gen urban = (sector == 2) 

.    keep if urban == 1
(79,298 observations deleted)

.    
. save "${r_output}\ria_1.dta",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS61\Data Output Files\ria_1.dta saved

. 
. //get the poverty line by state for the urban sector
. use "${r_output}\ria_1.dta",replace

. 
. keep if urban == 1
(0 observations deleted)

. gen state_n = state

. 
. collapse (mean) pline_1 pline_2 pline_3,by(state state_n) 

. gen _Istate_ = 1

. 
. reshape wide _Istate_,i(state pline_1 pline_2 pline_3) j(state_n)
(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       35   ->      35
Number of variables                   6   ->      39
j variable (35 values)          state_n   ->   (dropped)
xij variables:
                               _Istate_   ->   _Istate_1 _Istate_2 ... _Istate_35
-----------------------------------------------------------------------------

. qui mvencode _all, mv(0) //change missing values to zero

. 
. reshape long pline_,i(state) j(levels)
(note: j = 1 2 3)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       35   ->     105
Number of variables                  39   ->      38
j variable (3 values)                     ->   levels
xij variables:
                pline_1 pline_2 pline_3   ->   pline_
-----------------------------------------------------------------------------

. 
. rename pline mpce_mrp

. gen exp_non_housing_pp = . 
(105 missing values generated)

. 
. save "${r_output}\temp.dta",replace
(note: file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS61\Data Output Files\temp.dta not found)
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS61\Data Output Files\temp.dta saved

. 
. //fit renter's non-housing and total expenditure to linear model
. use "${r_output}\ria_1.dta",replace

. gen state_r = state 

. 
. drop if renter != 1 //only focusing on renters. 
(33,036 observations deleted)

. 
. xi: reg exp_non_housing_pp mpce_mrp i.state, noconstant
i.state           _Istate_1-35        (naturally coded; _Istate_1 omitted)

      Source |       SS           df       MS      Number of obs   =    12,310
-------------+----------------------------------   F(35, 12275)    =  14910.94
       Model |  2.5977e+10        35   742209946   Prob > F        =    0.0000
    Residual |   611003072    12,275  49776.2177   R-squared       =    0.9770
-------------+----------------------------------   Adj R-squared   =    0.9770
       Total |  2.6588e+10    12,310  2159898.55   Root MSE        =    223.11

------------------------------------------------------------------------------
exp_non_ho~p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    mpce_mrp |   .7913327   .0016677   474.52   0.000     .7880638    .7946016
   _Istate_2 |  -21.61414   17.80261    -1.21   0.225    -56.51005    13.28178
   _Istate_3 |  -54.59585   11.97696    -4.56   0.000    -78.07259   -31.11912
   _Istate_4 |  -201.5341    18.7956   -10.72   0.000    -238.3764   -164.6917
   _Istate_5 |  -28.73775    14.8301    -1.94   0.053    -57.80708    .3315755
   _Istate_6 |  -42.07799   13.89312    -3.03   0.002    -69.31068    -14.8453
   _Istate_7 |  -245.6922   12.32752   -19.93   0.000     -269.856   -221.5283
   _Istate_8 |  -37.55252   12.72604    -2.95   0.003    -62.49757   -12.60748
   _Istate_9 |  -26.52276   9.477772    -2.80   0.005    -45.10068   -7.944836
  _Istate_10 |  -39.45893   13.84979    -2.85   0.004    -66.60669   -12.31117
  _Istate_11 |  -100.3771   20.57379    -4.88   0.000     -140.705   -60.04924
  _Istate_12 |  -42.57536   24.84915    -1.71   0.087    -91.28359    6.132874
  _Istate_13 |   -13.8335   21.73535    -0.64   0.524     -56.4382     28.7712
  _Istate_14 |  -34.10796   32.24193    -1.06   0.290    -97.30721    29.09129
  _Istate_15 |   -24.7435   14.88935    -1.66   0.097    -53.92897     4.44197
  _Istate_16 |  -68.48261   20.35472    -3.36   0.001    -108.3811   -28.58415
  _Istate_17 |  -78.56498   17.08681    -4.60   0.000    -112.0578   -45.07214
  _Istate_18 |  -42.77552   13.62892    -3.14   0.002    -69.49034    -16.0607
  _Istate_19 |  -6.055578    8.31434    -0.73   0.466    -22.35299    10.24184
  _Istate_20 |  -7.165238   13.95964    -0.51   0.608    -34.52833    20.19786
  _Istate_21 |  -45.00997    12.7672    -3.53   0.000    -70.03568   -19.98426
  _Istate_22 |  -8.637083   16.08247    -0.54   0.591    -40.16126    22.88709
  _Istate_23 |  -11.35428   11.15193    -1.02   0.309    -33.21383    10.50526
  _Istate_24 |  -17.14884   10.52764    -1.63   0.103    -37.78468    3.486997
  _Istate_25 |  -74.68183   47.78868    -1.56   0.118    -168.3552     18.9915
  _Istate_26 |  -176.0989   31.37666    -5.61   0.000    -237.6021   -114.5957
  _Istate_27 |  -13.41505   6.683477    -2.01   0.045    -26.51571   -.3143802
  _Istate_28 |  -55.51658   6.821497    -8.14   0.000    -68.88778   -42.14537
  _Istate_29 |  -99.85166   7.737185   -12.91   0.000    -115.0178   -84.68557
  _Istate_30 |  -55.93159   29.15264    -1.92   0.055    -113.0754    1.212169
  _Istate_31 |    30.4693   44.71777     0.68   0.496    -57.18457    118.1232
  _Istate_32 |   11.84376    14.8478     0.80   0.425    -17.26026    40.94778
  _Istate_33 |  -71.64378   5.869732   -12.21   0.000    -83.14938   -60.13818
  _Istate_34 |  -15.78843   16.81693    -0.94   0.348    -48.75226     17.1754
  _Istate_35 |   -13.6177   16.87987    -0.81   0.420     -46.7049    19.46951
------------------------------------------------------------------------------

. 
. //estimate the non-housing expenditure budget standard (non-housing expenditure poverty line)
. use "${r_output}\temp.dta",clear

. predict exp_non_housing_pp_line_
(option xb assumed; fitted values)

. 
. rename mpce_mrp pline_

. keep state levels pline exp_non_housing_pp_line_

. reshape wide pline exp_non_housing_pp_line_, i(state) j(level)
(note: j = 1 2 3)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                      105   ->      35
Number of variables                   4   ->       7
j variable (3 values)            levels   ->   (dropped)
xij variables:
                                 pline_   ->   pline_1 pline_2 pline_3
               exp_non_housing_pp_line_   ->   exp_non_housing_pp_line_1 exp_non_housing_pp_line_2 exp_non_housing_pp_line_3
-----------------------------------------------------------------------------

. 
. save "${r_output}\ria_non_housing_line.dta",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS61\Data Output Files\ria_non_housing_line.dta saved

. erase "${r_output}\temp.dta"

. 
. //merge the alternative poverty lines to the master data.    
. merge 1:m state using "${r_output}\ria_1.dta"
(label state already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            45,346  (_merge==3)
    -----------------------------------------

. 
. keep if _merge == 3 //only on urban sector
(0 observations deleted)

. drop _merge  

. drop if renter != 1 //only focusing on renters. 
(33,036 observations deleted)

. 
.         *find the affordable housings
.         forvalues i = 1/3 {
  2.     gen affordable_`i' = (exp_non_housing_pp > exp_non_housing_pp_line_`i')*100
  3.     tab affordable_`i' [aw = hhwt]
  4.         
.         gen unaffordable_`i' = (affordable_`i' == 0)*100
  5.     }

affordable_ |
          1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 1,076.7175        8.75        8.75
        100 | 11,233.283       91.25      100.00
------------+-----------------------------------
      Total |     12,310      100.00

affordable_ |
          2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  6,163.406       50.07       50.07
        100 |  6,146.594       49.93      100.00
------------+-----------------------------------
      Total |     12,310      100.00

affordable_ |
          3 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 9,208.1914       74.80       74.80
        100 | 3,101.8086       25.20      100.00
------------+-----------------------------------
      Total |     12,310      100.00

. 
. // hosue keeping
. forvalues i = 1/3 {
  2. label var unaffordable_`i' "Hs. in Unaffordable Housing `i'pline"
  3. label var affordable_`i' "Hs. in Affordable Housing `i'pline"
  4. }

. 
. label var exp_non_housing_pp "Mth. PC. Non-Housing Exp."

. label var total_exp_housing_pp "Mth. PC. Housing Exp."

. 
. save "${r_output}\ria_final.dta",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS61\Data Output Files\ria_final.dta saved

. 
. ******************************************************************************
. *Step 3: stats by consumption quintile 
. ******************************************************************************
.  
. * distribution of owner and renter consumption expenditure in urban area: renters are in higher quintiles. 
. use "${r_output}\ria_1.dta",clear //with both renter and owner. 

. 
. twoway kdensity mpce_mrp_ln [aw = hhwt] if renter == 1 || kdensity mpce_mrp_ln [aw = hhwt] if renter == 0, ///
> legend(order(1 "Renter" 2 "Owner")) title("Table 2. Kdensity of Log Monthly per capita Consumer Expenditure (MPCE) for India Urban Household (2004)", size(tiny)) xtitle("Log MPCE") ytitle("Kdensity")

. graph export "${r_output}/kdensity_tenure_mpce.png",replace
(file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS61\Data Output Files/kdensity_tenure_mpce.png written in PNG format)

. 
. gen tn = (state == 33)

.  
. table renter [aw = hhwt], c(mean mpce_mrp median mpce_mrp) format(%9.2f) row

------------------------------------------
   renter | mean(mpce_mrp)   med(mpce_mrp)
----------+-------------------------------
        0 |        1179.00          875.83
        1 |        1532.40         1169.79
          | 
    Total |        1287.09          968.00
------------------------------------------

. table mpce_qt [aw = hhwt], c(mean renter) format(%9.2f) row

------------------------
5         |
quantiles |
of        |
mpce_mrp  | mean(renter)
----------+-------------
        1 |         0.08
        2 |         0.16
        3 |         0.23
        4 |         0.29
        5 |         0.39
          | 
    Total |         0.31
------------------------

. 
. table renter if tn == 1 [aw = hhwt], c(mean mpce_mrp median mpce_mrp) format(%9.2f) row

------------------------------------------
   renter | mean(mpce_mrp)   med(mpce_mrp)
----------+-------------------------------
        0 |        1146.03          827.45
        1 |        1541.45         1148.41
          | 
    Total |        1322.88          965.17
------------------------------------------

. table mpce_qt_tn if tn == 1 [aw = hhwt], c(mean renter) format(%9.2f) row

------------------------
5         |
quantiles |
of        |
mpce_mrp  | mean(renter)
----------+-------------
        1 |         0.18
        2 |         0.32
        3 |         0.37
        4 |         0.45
        5 |         0.55
          | 
    Total |         0.45
------------------------

. 
. *affordability and the share of housing expenditure to total expenditure (RIA and Ratio Approach)
. use "${r_output}\ria_final.dta",replace

. 
. //housing expenditure/total expenditure
. gen h_t_exp_mn = total_exp_housing_pp/mpce_mrp*100 

. label var h_t_exp_mn "Mean of Housing Exp. / Total Exp. (%)"

. 
. egen h_t_exp_r_md_q = median(h_t_exp_mn),by(mpce_qt)

. egen h_t_exp_r_md_all = median(h_t_exp_mn)

. 
. egen h_t_exp_r_md_q_tn = median(h_t_exp_mn) if state == 33,by(mpce_qt_tn)
(10616 missing values generated)

. egen h_t_exp_r_md_all_tn = median(h_t_exp_mn) if state == 33
(10616 missing values generated)

. 
. foreach var in h_t_exp_r_md_all {
  2. label var `var' "Med.of Housing Exp. / Total Exp. (%)" 
  3. label var `var'_tn "Med.of Housing Exp. / Total Exp. (%)" 
  4. }

. 
. //poverty rate (national)
. replace poor = poor*100
(2,066 real changes made)

. label var poor "Poverty Rate (%)"

. 
. //affordability tabel by quintile
. global var_tab_1 "h_t_exp_mn unaffordable_1 unaffordable_2 unaffordable_3 poor"

. 
. qui eststo total : estpost summarize h_t_exp_r_md_all $var_tab_1 [aw = hhwt],de

. replace h_t_exp_r_md_all = h_t_exp_r_md_q 
(12,310 real changes made)

. 
. qui eststo total_tn : estpost summarize h_t_exp_r_md_all_tn $var_tab_1 [aw = hhwt] if state == 33,de

. replace h_t_exp_r_md_all_tn = h_t_exp_r_md_q_tn
(1,694 real changes made)

. 
. forvalues i = 1/5 {
  2. qui eststo q`i' : estpost summarize h_t_exp_r_md_all $var_tab_1 [aw = hhwt] if mpce_qt == `i',de
  3. qui eststo q`i'_tn : estpost summarize h_t_exp_r_md_all_tn $var_tab_1 [aw = hhwt] if mpce_qt_tn == `i' & state == 33,de
  4. }

. 
. //table for all India
. esttab total q1 q2 q3 q4 q5, cells(mean(fmt(%15.1fc))) label collabels(none) /// 
>  mtitles("All" "Q1" "Q2" "Q3" "Q4" "Q5") stats(N, label("Observations") fmt(%15.0gc)) /// 
>  title("Table 1. Percent of Renter Households with Unaffordable Housing Expenditure by Expenditure Quintile in Urban India (2004)") varwidth(40) ///
>  addnote("Notes: The data source is NSS 68th Round Household Consumer Expenditure." ///
>  "       Households weighted by survey weights." ///
>  "       The analysis is using the Residual Income Approach." ///
>  "       The affordability at 1pline is estimated using renters' non-housing expenses drawn from India's urban national poverty threshold by state as the budget standard." ///
>  "       The affordabiiity at 2pline and 3pline are estimated utilizing the similar approach but with the double and triple poverty thresholds." ///
>  "       Renters are identified as households paying positive rent." ///
>  "       The owner non-housing consumer expenditure is not in the scope as the mortgage payment data is not collected in the the survey.")

Table 1. Percent of Renter Households with Unaffordable Housing Expenditure by Expenditure Quintile in Urban India (2004)
----------------------------------------------------------------------------------------------------------------------
                                                  (1)          (2)          (3)          (4)          (5)          (6)
                                                  All           Q1           Q2           Q3           Q4           Q5
----------------------------------------------------------------------------------------------------------------------
Med.of Housing Exp. / Total Exp. (%)             24.0         23.6         24.3         24.7         24.3         23.6
Mean of Housing Exp. / Total Exp. (%)            25.1         24.7         24.3         24.2         25.6         25.2
Hs. in Unaffordable Housing 1pline                8.7        100.0         86.4         25.2          2.1          0.0
Hs. in Unaffordable Housing 2pline               50.1        100.0        100.0        100.0         97.8         17.1
Hs. in Unaffordable Housing 3pline               74.8        100.0        100.0        100.0        100.0         57.7
Poverty Rate (%)                                  9.9        100.0         99.8         34.1          0.1          0.0
----------------------------------------------------------------------------------------------------------------------
Observations                                   12,310          309          997        1,676        2,723        6,605
----------------------------------------------------------------------------------------------------------------------
Notes: The data source is NSS 68th Round Household Consumer Expenditure.
       Households weighted by survey weights.
       The analysis is using the Residual Income Approach.
       The affordability at 1pline is estimated using renters' non-housing expenses drawn from India's urban national poverty threshold by state as the budget standard.
       The affordabiiity at 2pline and 3pline are estimated utilizing the similar approach but with the double and triple poverty thresholds.
       Renters are identified as households paying positive rent.
       The owner non-housing consumer expenditure is not in the scope as the mortgage payment data is not collected in the the survey.

. 
. //table for TN: higher affordability than india. 
. esttab total_tn q1_tn q2_tn q3_tn q4_tn q5_tn, cells(mean(fmt(%15.1fc))) label collabels(none) /// 
>  mtitles("All" "Q1" "Q2" "Q3" "Q4" "Q5") stats(N, label("Observations") fmt(%15.0gc)) /// 
>  title("Table 2. Percent of Renter Households with Unaffordable Housing Expenditure by Expenditure Quintile in Urban Tamil Nadu (2004)") varwidth(40) ///
>  addnote("Notes: The data source is NSS 68th Round Household Consumer Expenditure." ///
>  "       Households weighted by survey weights." ///
>  "       The analysis is using the Residual Income Approach." ///
>  "       The affordability at 1pline is estimated using renters' non-housing expenses drawn from India's urban national poverty threshold by state as the budget standard." ///
>  "       The affordabiiity at 2pline and 3pline are estimated utilizing the similar approach but with the double and triple poverty thresholds." ///
>  "       Renters are identified as households paying positive rent." ///
>  "       The owner non-housing consumer expenditure is not in the scope as the mortgage payment data is not collected in the the survey.")

Table 2. Percent of Renter Households with Unaffordable Housing Expenditure by Expenditure Quintile in Urban Tamil Nadu (2004)
----------------------------------------------------------------------------------------------------------------------
                                                  (1)          (2)          (3)          (4)          (5)          (6)
                                                  All           Q1           Q2           Q3           Q4           Q5
----------------------------------------------------------------------------------------------------------------------
Med.of Housing Exp. / Total Exp. (%)             26.4         28.6         27.7         26.5         26.2         25.7
Mean of Housing Exp. / Total Exp. (%)            27.6         25.8         26.7         27.6         27.5         27.8
Hs. in Unaffordable Housing 1pline                7.3        100.0         56.9          4.9          0.2          0.0
Hs. in Unaffordable Housing 2pline               49.7        100.0        100.0        100.0         85.4          5.5
Hs. in Unaffordable Housing 3pline               73.7        100.0        100.0        100.0        100.0         46.4
Poverty Rate (%)                                 10.0        100.0        100.0          1.8          0.0          0.0
----------------------------------------------------------------------------------------------------------------------
Observations                                    1,694           79          269          286          341          719
----------------------------------------------------------------------------------------------------------------------
Notes: The data source is NSS 68th Round Household Consumer Expenditure.
       Households weighted by survey weights.
       The analysis is using the Residual Income Approach.
       The affordability at 1pline is estimated using renters' non-housing expenses drawn from India's urban national poverty threshold by state as the budget standard.
       The affordabiiity at 2pline and 3pline are estimated utilizing the similar approach but with the double and triple poverty thresholds.
       Renters are identified as households paying positive rent.
       The owner non-housing consumer expenditure is not in the scope as the mortgage payment data is not collected in the the survey.

. 
. * k-density for affordability: housing/expenditure around. 
. gen exp_non_housing_pp_ln = ln(exp_non_housing_pp)

. 
. sum pline_1 pline_2 pline_3 if state == 33

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     pline_1 |      1,694      559.77           0     559.77     559.77
     pline_2 |      1,694     1119.54           0    1119.54    1119.54
     pline_3 |      1,694     1679.31           0    1679.31    1679.31

. 
. forvalues i = 1/3 {
  2. qui sum pline_`i' if state == 33
  3. local pline_`i'_ln = ln(r(mean))
  4. dis `pline_`i'_ln'
  5. }
6.327526
7.0206732
7.4261383

. 
. kdensity exp_non_housing_pp_ln if state == 33 [aw=hhwt], xline(`pline_1_ln' `pline_2_ln' `pline_3_ln') ///
> title("NSS61 - 2004, Residual Income vs. Minimum Standard by Scenario in Urban Tamil Nadu", size(small)) ///
> xtitle("Ln of Non-housing Exp. PC.")

. 
. graph export "${r_output}/kdensity_tn.png",replace
(file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS61\Data Output Files/kdensity_tn.png written in PNG format)

. 
.  
. log close
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\NSS61\02_NSS61_Residual_Income_Affordability.log
  log type:  text
 closed on:  10 Feb 2021, 05:22:31
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
