---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\NSS61\02_NSS61_Residual_Income_Affordability.log
  log type:  text
 opened on:  25 Jan 2021, 07:21:41

. set linesize 255

. 
. ***************************************************************
. *Step 1: Estimate the housing consumption per household member. 
. ***************************************************************
. use "${r_input}\Block 10_Monthly expenditure on miscellaneous goods and services including medical (non-institutional), rents and taxes.dta",clear

. merge m:1 HHID using "${r_input}\Block 3.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                           121
        from master                         0  (_merge==1)
        from using                        121  (_merge==2)

    matched                         2,378,390  (_merge==3)
    -----------------------------------------

. drop _merge

. merge m:1 HHID using "${r_input}\Block 3 Part 2_Household Characteristics.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         2,378,511  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. gen hh_size = B3_q1

.    
. /* poverty line is by state and by sector */
. 
.     *estimate housing related expenditure:
.           
.           *Rent (10: code = 529, 30 days recall period)
.           gen double rent = B10_q4*(B10_q1 == "529")
(121 missing values generated)

.           
.           *Water charge(10: 540, 30 days recall period)
.           gen double water = B10_q4*(B10_q1 == "540")
(121 missing values generated)

.           
.           *Collapse at household level for water ant rent
.           foreach var in rent water { 
  2.           egen double total_`var' = sum(`var'), by(HHID)
  3.           } 

.           bys HHID: keep if _n == 1 // keep only one observation for each HH
(2,253,867 observations deleted)

. 
. merge 1:m HHID using "${r_input}\Block 6_Monthly consumption of fuel & light.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                           422
        from master                       422  (_merge==1)
        from using                          0  (_merge==2)

    matched                           637,880  (_merge==3)
    -----------------------------------------

. drop _merge

.           
.           *Fuel and light (12: 18, 30 days recall period)
.           gen double fuel = B6_q6*(B6_q1 == "359")
(422 missing values generated)

.           egen double total_fuel = sum(fuel), by(HHID)

.           bys HHID: keep if _n == 1
(513,658 observations deleted)

. 
.         *Total housing expenditure
.         egen double exp_housing = rowtotal(total_rent total_fuel total_water)

. 
.     *Housing consumption per capita
.         gen double total_exp_housing_pp = exp_housing/hh_size 

.         
.     *Identify renters
.         gen renter = (total_rent > 0 & !mi(total_rent)) & B3_q16 == "2" //rent is positive and tenure status is hire. 

. 
. ******************************************************************************
. *Step 2: Estimate the non-housing expenditure for household at national pline
. ******************************************************************************
. rename HHID hhid

. merge 1:1 hhid using "${r_input}\NSS_61_Poverty_For_Aline.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           124,644  (_merge==3)
    -----------------------------------------

. keep if _merge == 3
(0 observations deleted)

. drop _merge

.    
.    *different budget scenario: pline, double pline, triple pline.    
.    forvalues i = 1/3 {
  2.    gen pline_`i' = pline*`i'
  3.    }

.    
.    *Non-housing consumption per capita
.    gen double exp_non_housing_pp = mpce_mrp - total_exp_housing_pp //all poverty line data are compiled using the MRP metho

.    
.    *Expenditure quintile (for all india, urban and rural sector)
.    xtile mpce_qt = mpce_mrp [aw = hhwt] , n(5)

.    xtile mpce_qt_tn = mpce_mrp [aw = hhwt] if state == 33, n(5)

.    
.    *take log of expenditure
.    gen mpce_mrp_ln = ln(mpce_mrp)

.    
.    *only focusing on urban households
.    gen urban = (sector == 2) 

.    keep if urban == 1
(79,298 observations deleted)

.    
. save "${r_output}\ria_1.dta",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS61\Data Output Files\ria_1.dta saved

. 
. //get the poverty line by state for the urban sector
. use "${r_output}\ria_1.dta",replace

. 
. keep if urban == 1
(0 observations deleted)

. gen state_n = state

. 
. collapse (mean) pline_1 pline_2 pline_3,by(state state_n) 

. gen _Istate_ = 1

. 
. reshape wide _Istate_,i(state pline_1 pline_2 pline_3) j(state_n)
(note: j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       35   ->      35
Number of variables                   6   ->      39
j variable (35 values)          state_n   ->   (dropped)
xij variables:
                               _Istate_   ->   _Istate_1 _Istate_2 ... _Istate_35
-----------------------------------------------------------------------------

. qui mvencode _all, mv(0) //change missing values to zero

. 
. reshape long pline_,i(state) j(levels)
(note: j = 1 2 3)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                       35   ->     105
Number of variables                  39   ->      38
j variable (3 values)                     ->   levels
xij variables:
                pline_1 pline_2 pline_3   ->   pline_
-----------------------------------------------------------------------------

. 
. rename pline mpce_mrp

. gen exp_non_housing_pp = . 
(105 missing values generated)

. 
. save "${r_output}\temp.dta",replace
(note: file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS61\Data Output Files\temp.dta not found)
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS61\Data Output Files\temp.dta saved

. 
. //fit renter's non-housing and total expenditure to linear model
. use "${r_output}\ria_1.dta",replace

. gen state_r = state 

. 
. drop if renter != 1 //only focusing on renters. 
(32,664 observations deleted)

. 
. xi: reg exp_non_housing_pp mpce_mrp i.state, noconstant
i.state           _Istate_1-35        (naturally coded; _Istate_1 omitted)

      Source |       SS           df       MS      Number of obs   =    12,682
-------------+----------------------------------   F(35, 12647)    =  15195.31
       Model |  2.6843e+10        35   766942144   Prob > F        =    0.0000
    Residual |   638322950    12,647   50472.282   R-squared       =    0.9768
-------------+----------------------------------   Adj R-squared   =    0.9767
       Total |  2.7481e+10    12,682     2166953   Root MSE        =    224.66

------------------------------------------------------------------------------
exp_non_ho~p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    mpce_mrp |   .7915454   .0016476   480.44   0.000      .788316    .7947749
   _Istate_2 |  -22.15553   17.80926    -1.24   0.214    -57.06437    12.75331
   _Istate_3 |  -52.54077   11.78831    -4.46   0.000    -75.64765    -29.4339
   _Istate_4 |  -202.0225   18.91186   -10.68   0.000    -239.0926   -164.9524
   _Istate_5 |  -29.17205   14.30679    -2.04   0.041    -57.21553   -1.128562
   _Istate_6 |  -42.35648   13.53227    -3.13   0.002    -68.88178   -15.83119
   _Istate_7 |  -243.7902   12.36681   -19.71   0.000    -268.0311   -219.5494
   _Istate_8 |  -32.36437    12.6422    -2.56   0.010    -57.14501   -7.583734
   _Istate_9 |  -22.92918   9.235526    -2.48   0.013    -41.03222   -4.826153
  _Istate_10 |  -38.77422   13.33496    -2.91   0.004    -64.91277   -12.63567
  _Istate_11 |  -100.8537   20.62639    -4.89   0.000    -141.2846   -60.42287
  _Istate_12 |   -36.5547   24.01201    -1.52   0.128    -83.62188    10.51249
  _Istate_13 |  -8.139607   21.49186    -0.38   0.705    -50.26691     33.9877
  _Istate_14 |  -33.14604   31.80932    -1.04   0.297    -95.49714    29.20505
  _Istate_15 |  -25.32914   14.76795    -1.72   0.086    -54.27656    3.618274
  _Istate_16 |  -69.24202   20.32576    -3.41   0.001    -109.0836   -29.40045
  _Istate_17 |  -78.01223   17.10298    -4.56   0.000    -111.5367   -44.48779
  _Istate_18 |  -40.33302   13.47678    -2.99   0.003    -66.74955   -13.91648
  _Istate_19 |  -7.471996    8.27984    -0.90   0.367    -23.70174    8.757746
  _Istate_20 |  -5.688597   13.57846    -0.42   0.675    -32.30444    20.92725
  _Istate_21 |  -40.11086   12.50711    -3.21   0.001    -64.62669   -15.59503
  _Istate_22 |  -5.822369   15.99529    -0.36   0.716    -37.17557    25.53083
  _Istate_23 |  -12.43493   11.00209    -1.13   0.258    -34.00071    9.130837
  _Istate_24 |  -15.18806   10.46316    -1.45   0.147    -35.69743    5.321313
  _Istate_25 |  -75.26927    48.1133    -1.56   0.118    -169.5786    19.04009
  _Istate_26 |  -177.0282   31.28847    -5.66   0.000    -238.3583   -115.6981
  _Istate_27 |  -18.54562   6.582192    -2.82   0.005    -31.44772    -5.64353
  _Istate_28 |  -55.80431   6.794934    -8.21   0.000    -69.12341   -42.48521
  _Istate_29 |  -103.9841   7.752009   -13.41   0.000    -119.1792   -88.78902
  _Istate_30 |  -56.24955   29.35175    -1.92   0.055    -113.7834     1.28433
  _Istate_31 |   29.09451   45.02572     0.65   0.518    -59.16272    117.3517
  _Istate_32 |   9.229275   14.90983     0.62   0.536    -19.99626    38.45481
  _Istate_33 |  -71.73946   5.884789   -12.19   0.000    -83.27453   -60.20438
  _Istate_34 |  -16.06588   16.92881    -0.95   0.343    -49.24891    17.11715
  _Istate_35 |  -13.20022   16.93535    -0.78   0.436    -46.39608    19.99564
------------------------------------------------------------------------------

. 
. //estimate the non-housing expenditure budget standard (non-housing expenditure poverty line)
. use "${r_output}\temp.dta",clear

. predict exp_non_housing_pp_line_
(option xb assumed; fitted values)

. 
. rename mpce_mrp pline_

. keep state levels pline exp_non_housing_pp_line_

. reshape wide pline exp_non_housing_pp_line_, i(state) j(level)
(note: j = 1 2 3)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                      105   ->      35
Number of variables                   4   ->       7
j variable (3 values)            levels   ->   (dropped)
xij variables:
                                 pline_   ->   pline_1 pline_2 pline_3
               exp_non_housing_pp_line_   ->   exp_non_housing_pp_line_1 exp_non_housing_pp_line_2 exp_non_housing_pp_line_3
-----------------------------------------------------------------------------

. 
. save "${r_output}\ria_non_housing_line.dta",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS61\Data Output Files\ria_non_housing_line.dta saved

. erase "${r_output}\temp.dta"

. 
. //merge the alternative poverty lines to the master data.    
. merge 1:m state using "${r_output}\ria_1.dta"
(label state already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            45,346  (_merge==3)
    -----------------------------------------

. 
. keep if _merge == 3 //only on urban sector
(0 observations deleted)

. drop _merge  

. drop if renter != 1 //only focusing on renters. 
(32,664 observations deleted)

. 
.         *find the affordable housings
.         forvalues i = 1/3 {
  2.     gen affordable_`i' = (exp_non_housing_pp > exp_non_housing_pp_line_`i')*100
  3.     tab affordable_`i' [aw = hhwt]
  4.         
.         gen unaffordable_`i' = (affordable_`i' == 0)*100
  5.     }

affordable_ |
          1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 1,140.3563        8.99        8.99
        100 | 11,541.644       91.01      100.00
------------+-----------------------------------
      Total |     12,682      100.00

affordable_ |
          2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 6,361.3987       50.16       50.16
        100 | 6,320.6013       49.84      100.00
------------+-----------------------------------
      Total |     12,682      100.00

affordable_ |
          3 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 9,500.9819       74.92       74.92
        100 | 3,181.0181       25.08      100.00
------------+-----------------------------------
      Total |     12,682      100.00

. 
. // hosue keeping
. forvalues i = 1/3 {
  2. label var unaffordable_`i' "Hs. in Unaffordable Housing `i'pline"
  3. label var affordable_`i' "Hs. in Affordable Housing `i'pline"
  4. }

. 
. label var exp_non_housing_pp "Mth. PC. Non-Housing Exp."

. label var total_exp_housing_pp "Mth. PC. Housing Exp."

. 
. save "${r_output}\ria_final.dta",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS61\Data Output Files\ria_final.dta saved

. 
. ******************************************************************************
. *Step 3: stats by consumption quintile 
. ******************************************************************************
.  
. * distribution of owner and renter consumption expenditure in urban area: renters are in higher quintiles. 
. use "${r_output}\ria_1.dta",clear //with both renter and owner. 

. 
. twoway kdensity mpce_mrp_ln [aw = hhwt] if renter == 1 || kdensity mpce_mrp_ln [aw = hhwt] if renter == 0, ///
> legend(order(1 "Renter" 2 "Owner")) title("Table 2. Kdensity of Log Monthly per capita Consumer Expenditure (MPCE) for India Urban Household (2004)", size(tiny)) xtitle("Log MPCE") ytitle("Kdensity")

. 
. gen tn = (state == 33)

.  
. table renter, c(mean mpce_mrp median mpce_mrp) format(%9.2f) row

------------------------------------------
   renter | mean(mpce_mrp)   med(mpce_mrp)
----------+-------------------------------
        0 |        1082.45          790.84
        1 |        1432.33         1089.63
          | 
    Total |        1180.30          862.45
------------------------------------------

. table mpce_qt, c(mean renter) format(%9.2f) row

------------------------
5         |
quantiles |
of        |
mpce_mrp  | mean(renter)
----------+-------------
        1 |         0.10
        2 |         0.18
        3 |         0.24
        4 |         0.28
        5 |         0.36
          | 
    Total |         0.28
------------------------

. 
. table renter if tn == 1, c(mean mpce_mrp median mpce_mrp) format(%9.2f) row

------------------------------------------
   renter | mean(mpce_mrp)   med(mpce_mrp)
----------+-------------------------------
        0 |        1108.23          751.15
        1 |        1349.19          984.75
          | 
    Total |        1207.24          832.97
------------------------------------------

. table mpce_qt_tn if tn == 1, c(mean renter) format(%9.2f) row

------------------------
5         |
quantiles |
of        |
mpce_mrp  | mean(renter)
----------+-------------
        1 |         0.21
        2 |         0.36
        3 |         0.40
        4 |         0.43
        5 |         0.48
          | 
    Total |         0.41
------------------------

. 
. *affordability and the share of housing expenditure to total expenditure (RIA and Ratio Approach)
. use "${r_output}\ria_final.dta",replace

. 
. //housing expenditure/total expenditure
. gen h_t_exp_mn = total_exp_housing_pp/mpce_mrp*100 

. label var h_t_exp_mn "Mean of Housing Exp. / Total Exp. (%)"

. 
. egen h_t_exp_r_md_q = median(h_t_exp_mn),by(mpce_qt)

. egen h_t_exp_r_md_all = median(h_t_exp_mn)

. 
. egen h_t_exp_r_md_q_tn = median(h_t_exp_mn) if state == 33,by(mpce_qt_tn)
(10982 missing values generated)

. egen h_t_exp_r_md_all_tn = median(h_t_exp_mn) if state == 33
(10982 missing values generated)

. 
. foreach var in h_t_exp_r_md_all {
  2. label var `var' "Med.of Housing Exp. / Total Exp. (%)" 
  3. label var `var'_tn "Med.of Housing Exp. / Total Exp. (%)" 
  4. }

. 
. //poverty rate (national)
. replace poor = poor*100
(2,153 real changes made)

. label var poor "Poverty Rate (%)"

. 
. //affordability tabel by quintile
. global var_tab_1 "h_t_exp_mn unaffordable_1 unaffordable_2 unaffordable_3 poor"

. 
. qui eststo total : estpost summarize h_t_exp_r_md_all $var_tab_1 [aw = hhwt],de

. replace h_t_exp_r_md_all = h_t_exp_r_md_q 
(12,682 real changes made)

. 
. qui eststo total_tn : estpost summarize h_t_exp_r_md_all_tn $var_tab_1 [aw = hhwt] if state == 33,de

. replace h_t_exp_r_md_all_tn = h_t_exp_r_md_q_tn
(1,700 real changes made)

. 
. forvalues i = 1/5 {
  2. qui eststo q`i' : estpost summarize h_t_exp_r_md_all $var_tab_1 [aw = hhwt] if mpce_qt == `i',de
  3. qui eststo q`i'_tn : estpost summarize h_t_exp_r_md_all_tn $var_tab_1 [aw = hhwt] if mpce_qt_tn == `i' & state == 33,de
  4. }

. 
. //table for all India
. esttab total q1 q2 q3 q4 q5, cells(mean(fmt(%15.1fc))) label collabels(none) /// 
>  mtitles("All" "Q1" "Q2" "Q3" "Q4" "Q5") stats(N, label("Observations") fmt(%15.0gc)) /// 
>  title("Table 1. Percent of Renter Households with Unaffordable Housing Expenditure by Expenditure Quintile in Urban India (2004)") varwidth(40) ///
>  addnote("Notes: The data source is NSS 68th Round Household Consumer Expenditure." ///
>  "       Households weighted by survey weights." ///
>  "       The analysis is using the Residual Income Approach." ///
>  "       The affordability at 1pline is estimated using renters' non-housing expenses drawn from India's urban national poverty threshold by state as the budget standard." ///
>  "       The affordabiiity at 2pline and 3pline are estimated utilizing the similar approach but with the double and triple poverty thresholds." ///
>  "       Renters are identified as households paying positive rent." ///
>  "       The owner non-housing consumer expenditure is not in the scope as the mortgage payment data is not collected in the the survey.")

Table 1. Percent of Renter Households with Unaffordable Housing Expenditure by Expenditure Quintile in Urban India (2004)
----------------------------------------------------------------------------------------------------------------------
                                                  (1)          (2)          (3)          (4)          (5)          (6)
                                                  All           Q1           Q2           Q3           Q4           Q5
----------------------------------------------------------------------------------------------------------------------
Med.of Housing Exp. / Total Exp. (%)             24.0         23.4         24.2         24.6         24.3         23.5
Mean of Housing Exp. / Total Exp. (%)            25.1         24.7         24.3         24.2         25.5         25.1
Hs. in Unaffordable Housing 1pline                9.0        100.0         86.6         26.2          2.0          0.0
Hs. in Unaffordable Housing 2pline               50.2        100.0        100.0        100.0         97.9         17.0
Hs. in Unaffordable Housing 3pline               74.9        100.0        100.0        100.0        100.0         57.8
Poverty Rate (%)                                 10.0        100.0         99.8         34.2          0.1          0.0
----------------------------------------------------------------------------------------------------------------------
Observations                                   12,682          322        1,042        1,736        2,801        6,781
----------------------------------------------------------------------------------------------------------------------
Notes: The data source is NSS 68th Round Household Consumer Expenditure.
       Households weighted by survey weights.
       The analysis is using the Residual Income Approach.
       The affordability at 1pline is estimated using renters' non-housing expenses drawn from India's urban national poverty threshold by state as the budget standard.
       The affordabiiity at 2pline and 3pline are estimated utilizing the similar approach but with the double and triple poverty thresholds.
       Renters are identified as households paying positive rent.
       The owner non-housing consumer expenditure is not in the scope as the mortgage payment data is not collected in the the survey.

. 
. //table for TN: higher affordability than india. 
. esttab total_tn q1_tn q2_tn q3_tn q4_tn q5_tn, cells(mean(fmt(%15.1fc))) label collabels(none) /// 
>  mtitles("All" "Q1" "Q2" "Q3" "Q4" "Q5") stats(N, label("Observations") fmt(%15.0gc)) /// 
>  title("Table 2. Percent of Renter Households with Unaffordable Housing Expenditure by Expenditure Quintile in Urban Tamil Nadu (2004)") varwidth(40) ///
>  addnote("Notes: The data source is NSS 68th Round Household Consumer Expenditure." ///
>  "       Households weighted by survey weights." ///
>  "       The analysis is using the Residual Income Approach." ///
>  "       The affordability at 1pline is estimated using renters' non-housing expenses drawn from India's urban national poverty threshold by state as the budget standard." ///
>  "       The affordabiiity at 2pline and 3pline are estimated utilizing the similar approach but with the double and triple poverty thresholds." ///
>  "       Renters are identified as households paying positive rent." ///
>  "       The owner non-housing consumer expenditure is not in the scope as the mortgage payment data is not collected in the the survey.")

Table 2. Percent of Renter Households with Unaffordable Housing Expenditure by Expenditure Quintile in Urban Tamil Nadu (2004)
----------------------------------------------------------------------------------------------------------------------
                                                  (1)          (2)          (3)          (4)          (5)          (6)
                                                  All           Q1           Q2           Q3           Q4           Q5
----------------------------------------------------------------------------------------------------------------------
Med.of Housing Exp. / Total Exp. (%)             26.4         28.5         27.7         26.5         26.3         25.7
Mean of Housing Exp. / Total Exp. (%)            27.6         25.7         26.7         27.6         27.5         27.8
Hs. in Unaffordable Housing 1pline                7.3        100.0         56.9          5.0          0.2          0.0
Hs. in Unaffordable Housing 2pline               49.8        100.0        100.0        100.0         85.4          5.5
Hs. in Unaffordable Housing 3pline               73.7        100.0        100.0        100.0        100.0         46.4
Poverty Rate (%)                                 10.0        100.0        100.0          1.8          0.0          0.0
----------------------------------------------------------------------------------------------------------------------
Observations                                    1,700           80          269          287          343          721
----------------------------------------------------------------------------------------------------------------------
Notes: The data source is NSS 68th Round Household Consumer Expenditure.
       Households weighted by survey weights.
       The analysis is using the Residual Income Approach.
       The affordability at 1pline is estimated using renters' non-housing expenses drawn from India's urban national poverty threshold by state as the budget standard.
       The affordabiiity at 2pline and 3pline are estimated utilizing the similar approach but with the double and triple poverty thresholds.
       Renters are identified as households paying positive rent.
       The owner non-housing consumer expenditure is not in the scope as the mortgage payment data is not collected in the the survey.

. 
. * k-density for affordability: housing/expenditure around. 
. gen exp_non_housing_pp_ln = ln(exp_non_housing_pp)

. 
. sum pline_1 pline_2 pline_3 if state == 33

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     pline_1 |      1,700      559.77           0     559.77     559.77
     pline_2 |      1,700     1119.54           0    1119.54    1119.54
     pline_3 |      1,700     1679.31           0    1679.31    1679.31

. 
. forvalues i = 1/3 {
  2. qui sum pline_`i' if state == 33
  3. local pline_`i'_ln = ln(r(mean))
  4. dis `pline_`i'_ln'
  5. }
6.327526
7.0206732
7.4261383

. 
. kdensity exp_non_housing_pp_ln if state == 33 [aw=hhwt], xline(`pline_1_ln' `pline_2_ln' `pline_3_ln') ///
> title("NSS61 - 2004, Residual Income vs. Minimum Standard by Scenario in Urban Tamil Nadu", size(small)) ///
> xtitle("Ln of Non-housing Exp. PC.")

.  
. log close
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\NSS61\02_NSS61_Residual_Income_Affordability.log
  log type:  text
 closed on:  25 Jan 2021, 07:22:23
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
