--------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\02_Table of Means NSS 70.log
  log type:  text
 opened on:  22 Oct 2020, 09:53:16

. 
. ****************************************************************************
. * Load the data and replicate the assumption 
. ****************************************************************************
. use "${root}\Data Output Files\NSS70_All.dta",clear

. 
. //replace b5_2_6 = . if b5_2_6<0 //? there's negative value for urban land owned?
. //replace b11_q6 = . if b11_q6<0 //? there's negative value for shares & debentures owned. 
. 
. egen double asset = rowtotal(land_r land_u building_all livestock trspt agri non_farm shares fin_other gold fin_rec) 

. egen double durable_other = rowtotal(livestock trspt agri non_farm)

. egen double real_estate = rowtotal(building_resid land_r land_u)

. 
. gen double wealth = asset - debt
(37,081 missing values generated)

. 
. gen double wealth_ln = ln(wealth)
(39,807 missing values generated)

. 
. sum asset land_r land_u building_all livestock trspt agri non_farm shares fin_other gold fin_rec building_resid

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       asset |    110,800     1782862    1.13e+07          0   1.85e+09
      land_r |     67,747     1041569     3905052          0   2.49e+08
      land_u |     34,217     1380122     8276187          0   1.28e+09
building_all |     95,488    614870.7    1.01e+07          0   1.85e+09
   livestock |     44,407    32474.12    54060.96          0    2590000
-------------+---------------------------------------------------------
       trspt |     71,749    74586.56    279375.5          0   2.07e+07
        agri |     48,270     8792.89    50198.23          0    7700000
    non_farm |     24,552           0           0          0          0
      shares |      3,836    46152.68      351695          0   1.21e+07
   fin_other |    101,412    66760.63    267276.4          0   3.26e+07
-------------+---------------------------------------------------------
        gold |    101,412    63457.91    160273.4          0   1.29e+07
     fin_rec |      6,775    65060.67    424340.3          0   2.00e+07
building_r~d |     95,488    568308.2     9849675          0   1.85e+09

. 
. keep if head_age >= 24
(2,266 observations deleted)

. 
. ****************************************************************************
. * Calculate stats for housing mortgage and loan (outstanding)
. ****************************************************************************
. 
. **stats to compare with published paper
. gen re_share = real_estate/asset
(672 missing values generated)

. gen du_share = durable_other/asset
(672 missing values generated)

. gen gl_share = gold / asset
(8,631 missing values generated)

. 
. sum re_share du_share gl_share

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    re_share |    107,862    .7552001     .290893          0          1
    du_share |    107,862    .0629695    .1267183          0          1
    gl_share |     99,903    .1089669    .1968698          0          1

. sum re_share du_share gl_share [aw = pwgt]

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
    re_share | 107,862  2.0722e+11    .7755733    .274023          0          1
    du_share | 107,862  2.0722e+11    .0603331   .1165205          0          1
    gl_share |  99,903  1.9011e+11    .1094104   .1952706          0          1

. 
. **residential building ownership
. codebook building_resid 

--------------------------------------------------------------------------------------------------------------------------------------------
building_resid                                                                                                                   (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [0,1.850e+09]                units:  1
         unique values:  4,435                    missing .:  13,971/108,534

                  mean:    571998
              std. dev:   9.9e+06

           percentiles:        10%       25%       50%       75%       90%
                             36100     75000    180000    450000   1.0e+06

. 
. gen legal_own = (building_resid > 0)

. replace legal_own = 0 if mi(building_resid) //treat missing as household do not own real estate assets.
(13,971 real changes made)

. 
. bysort urban: sum legal_own [aw = hhwgt],de //69% households in urban own residential building, compare to nss 61.2% house ownership in 20
> 11 consumption survey. 

--------------------------------------------------------------------------------------------------------------------------------------------
-> urban = 0

                          legal_own
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs              61,217
25%            1              0       Sum of Wgt.  3.0356e+10

50%            1                      Mean           .9487511
                        Largest       Std. Dev.      .2205068
75%            1              1
90%            1              1       Variance       .0486233
95%            1              1       Skewness      -4.070211
99%            1              1       Kurtosis       17.56662

--------------------------------------------------------------------------------------------------------------------------------------------
-> urban = 1

                          legal_own
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              47,317
25%            0              0       Sum of Wgt.  1.5509e+10

50%            1                      Mean           .6909342
                        Largest       Std. Dev.      .4621132
75%            1              1
90%            1              1       Variance       .2135486
95%            1              1       Skewness      -.8263613
99%            1              1       Kurtosis       1.682873


. 
. **mortgage debt
. use "${r_input}\Visit 1_Block 14",clear

. drop if b14_q1 == "99" //drop the total amount
(73,266 observations deleted)

. 
. *debt
. gen debt = b14_q17
(47,671 missing values generated)

. codebook debt

--------------------------------------------------------------------------------------------------------------------------------------------
debt                                                                                                                             (unlabeled)
--------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,1.830e+08]                units:  1
         unique values:  15,092                   missing .:  47,671/110,443

                  mean:    147054
              std. dev:    856792

           percentiles:        10%       25%       50%       75%       90%
                              7000     16000     41400    118000    320000

. drop if debt == .
(47,671 observations deleted)

. 
. gen mortgage_debt = (b14_q13 != "4"& b14_q13 != "")*debt

. collapse (sum) mortgage_debt,by(HHID)

. 
. merge 1:1 HHID using "${root}\Data Output Files\NSS70_All.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                        64,646
        from master                         0  (_merge==1)
        from using                     64,646  (_merge==2)

    matched                            46,154  (_merge==3)
    -----------------------------------------

. 
. keep if head_age >= 24
(2,266 observations deleted)

.  
. gen double mortgage_debt_share = mortgage_debt/debt
(63,241 missing values generated)

. replace mortgage_debt_share = 0 if mortgage_debt == .
(62,775 real changes made)

. 
. sum mortgage_debt_share //14%

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
mortgage_d~e |    108,068    .1464533    .3444353          0          1

. sum mortgage_debt_share [aw = pwgt] //10%

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
mortgage_d~e | 108,068  2.0783e+11    .1034419    .295398          0          1

. 
. log close
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\02_Table of Means NSS 70.log
  log type:  text
 closed on:  22 Oct 2020, 09:53:18
--------------------------------------------------------------------------------------------------------------------------------------------
