-------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\02_Table of Means NSS 70.lo
> g
  log type:  text
 opened on:  28 Oct 2020, 06:40:49

. 
. ****************************************************************************
. * Load the data and replicate the assumption https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2797680
. ****************************************************************************
. use "${root}\Data Output Files\NSS70_All.dta",clear

. 
. 
. egen double asset = rowtotal(land_r land_u building_all livestock trspt agri non_farm shares fin_other gold fin_rec) 

. egen double durable_other = rowtotal(livestock trspt agri non_farm)

. egen double real_estate = rowtotal(building_resid land_r land_u)

. 
. gen double wealth = asset - debt
(37,081 missing values generated)

. gen double wealth_ln = ln(wealth)
(39,807 missing values generated)

. 
. sum asset land_r land_u building_all livestock trspt agri non_farm shares fin_other gold fin_rec building_resid 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       asset |    110,800     1782862    1.13e+07          0   1.85e+09
      land_r |     67,747     1041569     3905052          0   2.49e+08
      land_u |     34,217     1380122     8276187          0   1.28e+09
building_all |     95,488    614870.7    1.01e+07          0   1.85e+09
   livestock |     44,407    32474.12    54060.96          0    2590000
-------------+---------------------------------------------------------
       trspt |     71,749    74586.56    279375.5          0   2.07e+07
        agri |     48,270     8792.89    50198.23          0    7700000
    non_farm |     24,552           0           0          0          0
      shares |      3,836    46152.68      351695          0   1.21e+07
   fin_other |    101,412    66760.63    267276.4          0   3.26e+07
-------------+---------------------------------------------------------
        gold |    101,412    63457.91    160273.4          0   1.29e+07
     fin_rec |      6,775    65060.67    424340.3          0   2.00e+07
building_r~d |     95,488    568308.2     9849675          0   1.85e+09

. 
. ****************************************************************************
. * Asset allocation on 
. * real_estate (77%), durable good (7%), gold (11%)
. ****************************************************************************
. keep if head_age >= 24
(2,266 observations deleted)

. 
. **share of real estate on 
. gen re_share = real_estate/asset
(672 missing values generated)

. gen du_share = durable_other/asset
(672 missing values generated)

. gen gl_share = gold / asset
(8,631 missing values generated)

. 
. sum re_share du_share gl_share //gold is 11% closest with paper. 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    re_share |    107,862    .7552001     .290893          0          1
    du_share |    107,862    .0629695    .1267183          0          1
    gl_share |     99,903    .1089669    .1968698          0          1

. sum re_share du_share gl_share [aw = hhwgt] 

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
    re_share | 107,862   454835504    .7567272    .298137          0          1
    du_share | 107,862   454835504    .0583045    .121603          0          1
    gl_share |  99,903   415267015    .1233037   .2136998          0          1

. sum re_share du_share gl_share [aw = pwgt] //gold is 11% closest with paper. 

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
    re_share | 107,862  2.0722e+09    .7755733    .274023          0          1
    du_share | 107,862  2.0722e+09    .0603331   .1165205          0          1
    gl_share |  99,903  1.9011e+09    .1094104   .1952706          0          1

. 
. **residential building ownership
. codebook building_resid 

-------------------------------------------------------------------------------------------------------------------------
building_resid                                                                                                (unlabeled)
-------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [0,1.850e+09]                units:  1
         unique values:  4,435                    missing .:  13,971/108,534

                  mean:    571998
              std. dev:   9.9e+06

           percentiles:        10%       25%       50%       75%       90%
                             36100     75000    180000    450000   1.0e+06

. 
. gen legal_own = (building_resid > 0)

. replace legal_own = 0 if mi(building_resid) //treat missing as household do not own real estate assets.
(13,971 real changes made)

. 
. bysort urban: sum legal_own [aw = hhwgt],de 

-------------------------------------------------------------------------------------------------------------------------
-> urban = 0

                          legal_own
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs              61,217
25%            1              0       Sum of Wgt.   303555500

50%            1                      Mean           .9487511
                        Largest       Std. Dev.      .2205068
75%            1              1
90%            1              1       Variance       .0486233
95%            1              1       Skewness      -4.070211
99%            1              1       Kurtosis       17.56662

-------------------------------------------------------------------------------------------------------------------------
-> urban = 1

                          legal_own
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              47,317
25%            0              0       Sum of Wgt.   155093220

50%            1                      Mean           .6909342
                        Largest       Std. Dev.      .4621132
75%            1              1
90%            1              1       Variance       .2135486
95%            1              1       Skewness      -.8263613
99%            1              1       Kurtosis       1.682873


. 
. ****************************************************************************
. * Liabilitiy allocation on 
. * gold (4%), unsecured loan (55%), mortgage loan (23%)
. ****************************************************************************
. use "${r_input}\Visit 1_Block 14",clear

. 
. *debt -- paper says liabilities on date of survey. pp16: "Panel A of Figure 2 reports the average allocation of liabili
> ties across all households that carry a positive amount of debt at the date of the survey."
. gen debt = b14_q17 // 17 is on 30.06.2012
(74,953 missing values generated)

. sum debt,de

                            debt
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         4200              0
10%         7420              0       Obs             108,756
25%        17990              0       Sum of Wgt.     108,756

50%        48800                      Mean           169114.3
                        Largest       Std. Dev.      931886.7
75%       140000       4.00e+07
90%       371695       4.00e+07       Variance       8.68e+11
95%       638480       1.83e+08       Skewness       142.1036
99%      1900207       1.83e+08       Kurtosis       27330.57

. 
. *in paper: keep households with total liability >0 
. gen temp_debt =  (b14_q1 == "99")*debt
(74,953 missing values generated)

. egen double total_debt = sum(temp_debt), by(HHID)

. drop temp_debt

. 
. gen temp_debt =  (b14_q1 != "99")*debt
(74,953 missing values generated)

. egen double total_debt_m = sum(temp_debt),by(HHID)

. drop temp_debt

. 
. gen temp_debt_todt = (b14_q1 == "99")*b14_q16 //to date of survey the total debt. 
(2,415 missing values generated)

. egen double total_debt_todt = sum(temp_debt_todt ), by(HHID)

. drop temp_debt_todt

. 
. count if total_debt > total_debt_m
  0

. count if total_debt < total_debt_m // manual has 568 observations where it is larger 
  542

. 
. tab b14_q1

 Serial no. |      Freq.     Percent        Cum.
------------+-----------------------------------
         01 |     73,719       40.13       40.13
         02 |     21,945       11.95       52.07
         03 |      8,024        4.37       56.44
         04 |      3,600        1.96       58.40
         05 |      1,514        0.82       59.23
         06 |        705        0.38       59.61
         07 |        380        0.21       59.82
         08 |        212        0.12       59.93
         09 |        117        0.06       59.99
         10 |         73        0.04       60.03
         11 |         45        0.02       60.06
         12 |         33        0.02       60.08
         13 |         19        0.01       60.09
         14 |         13        0.01       60.09
         15 |         11        0.01       60.10
         16 |         10        0.01       60.11
         17 |          8        0.00       60.11
         18 |          4        0.00       60.11
         19 |          3        0.00       60.11
         20 |          3        0.00       60.12
         21 |          1        0.00       60.12
         22 |          1        0.00       60.12
         23 |          1        0.00       60.12
         24 |          1        0.00       60.12
         25 |          1        0.00       60.12
         99 |     73,266       39.88      100.00
------------+-----------------------------------
      Total |    183,709      100.00

. sort HHID

. br HHID b14* if total_debt == total_debt_m //there are hosueholds with no total liability coded.  

. 
. *need to use the 99 total and not the manual to match the paper 
. *drop total_debt
. *rename total_debt_m total_debt 
. 
. *generate share of gold loan, unsecured debt
. gen gold_loan = (b14_q12 == "05")*debt
(74,953 missing values generated)

. gen unsecure_loan = (b14_q12 == "10")*debt
(74,953 missing values generated)

. gen mrtg_loan = (inlist(b14_q12,"03","04"))*debt
(74,953 missing values generated)

. 
. *collapse at household level. 
. 
. foreach type in gold_loan unsecure_loan mrtg_loan { 
  2. egen double total_`type' = sum(`type'), by(HHID)
  3. } 

. keep HHID total*

. bys HHID: keep if _n == 1 // keep only one observation for each HH
(109,989 observations deleted)

.  
. *merge with households information
. merge 1:1 HHID using "${root}\Data Output Files\NSS70_All.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                        37,080
        from master                         0  (_merge==1)
        from using                     37,080  (_merge==2)

    matched                            73,720  (_merge==3)
    -----------------------------------------

. 
. *in paper: keep households with head older than 24.
. keep if head_age >= 24
(2,266 observations deleted)

. keep if total_debt_todt > 0 & !mi(total_debt_todt) //the date of survey liability is positive. 
(36,948 observations deleted)

. 
. *generate share of gold loan on total liability
. gen double gold_loan_share = total_gold_loan/total_debt
(27,177 missing values generated)

. gen double unsecure_share = total_unsecure_loan/total_debt
(27,177 missing values generated)

. gen mrtg_loan_share = total_mrtg_loan/total_debt
(27,177 missing values generated)

. 
. *Need to match 4%, 55% and 23%
. sum gold_loan_share unsecure_share mrtg_loan_share [aw = pwgt] 

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
gold_loan_~e |  44,409   626127839    .0693761   .2374889          0          1
unsecure_s~e |  44,409   626127839    .5598109   .4748745          0          1
mrtg_loan_~e |  44,409   626127839    .2351137   .4058646          0          1

. sum gold_loan_share unsecure_share mrtg_loan_share [aw = hhwgt]

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
gold_loan_~e |  44,409   130553605    .0777094   .2509872          0          1
unsecure_s~e |  44,409   130553605    .5567404   .4754202          0          1
mrtg_loan_~e |  44,409   130553605    .2280975   .4017766          0          1

. sum gold_loan_share unsecure_share mrtg_loan_share 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gold_loan_~e |     44,409    .0516756    .2087063          0          1
unsecure_s~e |     44,409    .5390283    .4808403          0          1
mrtg_loan_~e |     44,409    .2461949    .4160992          0          1

. 
. 
. ****************************************************************************
. * Liabilitiy allocation (value weighted) on 
. * unsecured and gold (35% written in paper), mortgage loan (46% extract using )
. ****************************************************************************
. 
. use "${r_input}\Visit 1_Block 14",clear

. 
. *debt 
. gen debt = b14_q17 // 17 is on 30.06.2012
(74,953 missing values generated)

. 
. gen temp_debt_todt = (b14_q1 == "99")*b14_q16 //to date of survey the total debt. 
(2,415 missing values generated)

. egen double total_debt_todt = sum(temp_debt_todt), by(HHID)

. drop temp_debt_todt

. 
. *merge with households information
. merge m:1 HHID using "${root}\Data Output Files\NSS70_All.dta"
(note: variable debt was float, now double to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                        37,080
        from master                         0  (_merge==1)
        from using                     37,080  (_merge==2)

    matched                           183,709  (_merge==3)
    -----------------------------------------

. 
. *in paper: keep households with head older than 24.
. drop if b14_q1 == "99"
(73,266 observations deleted)

. keep if head_age >= 24
(2,455 observations deleted)

. keep if total_debt_todt > 0 & !mi(total_debt_todt) //the date of survey liability is positive. 
(37,153 observations deleted)

. 
. *collapse at liability type.  
. gen secure_type = b14_q12

. egen double debt_type = sum(debt), by(secure_type)

. 
. egen double hhwgt_type = sum(hhwgt), by(secure_type)

. egen double pwgt_type = sum(pwgt), by(secure_type)

. 
. keep secure_type debt_type* pwgt_type hhwgt_type

. bys secure_type: keep if _n == 1 // keep only one observation for each type of loan
(107,905 observations deleted)

. 
. egen double temp_hhwgt_total = sum(hhwgt_type)

. replace hhwgt_type = hhwgt_type/temp_hhwgt_total
(10 real changes made)

. 
. egen double temp_pwgt_total = sum(pwgt_type)

. replace pwgt_type = pwgt_type/temp_pwgt_total
(10 real changes made)

. 
. *stats
. egen double debt_type_total = sum(debt)

. gen double type_share = debt_type/debt_type_total*100 //not weighted. 

. 
. egen double debt_type_total_wgt = sum(debt_type*hhwgt_type)

. gen double type_share_wgt = (debt_type*hhwgt_type)/debt_type_total_wgt*100 //weighted uisng household weight. 

. 
. total(type_share)

Total estimation                  Number of obs   =         10

--------------------------------------------------------------
             |      Total   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
  type_share |        100   44.01226       .437351    199.5626
--------------------------------------------------------------

. total(type_share_wgt)

Total estimation                  Number of obs   =         10

----------------------------------------------------------------
               |      Total   Std. Err.     [95% Conf. Interval]
---------------+------------------------------------------------
type_share_wgt |        100   73.83261     -67.02096     267.021
----------------------------------------------------------------

. 
. *match the paper number (not weighted while the paper "Appropriately weighted p15.")
. total(type_share) if inlist(secure_type,"10","05") //unsecured loan and gold 35%, same as paper stats. (not weighted)

Total estimation                  Number of obs   =          2

--------------------------------------------------------------
             |      Total   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
  type_share |   35.19074   28.14241     -322.3924    392.7739
--------------------------------------------------------------

. total(type_share) if inlist(secure_type,"03","04") //mortgage loan 49% higher than paper stat at 46% (might be the WbPl
> ot measure error?) (not weighted)

Total estimation                  Number of obs   =          2

--------------------------------------------------------------
             |      Total   Std. Err.     [95% Conf. Interval]
-------------+------------------------------------------------
  type_share |   48.78053   30.61227     -340.1853    437.7463
--------------------------------------------------------------

. 
. keep secure_type type_share type_share_wgt

. 
. log close
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\02_Table of Means NSS 70.lo
> g
  log type:  text
 closed on:  28 Oct 2020, 06:40:58
-------------------------------------------------------------------------------------------------------------------------
