----------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\02_Table of 
> Means NSS 70.log
  log type:  text
 opened on:  10 Nov 2020, 03:27:45

. 
. ****************************************************************************
. * Load the data and replicate the assumption https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2797680
. ****************************************************************************
. use "${root}\Data Output Files\NSS70_All.dta",clear

. 
. *generate asset value by type
. egen double asset = rowtotal(land_r land_u building_all livestock trspt agri non_farm shares fin_other g
> old fin_rec) 

. 
. egen double durable_other = rowtotal(livestock trspt agri non_farm)

. 
. egen double real_estate = rowtotal(building_resid land_r land_u)

. 
. egen double asset_non_fin = rowtotal(real_estate gold durable_other)

. 
. egen double asset_fin = rowtotal(shares fin_other fin_rec)

. 
. *generate wealth data
. gen double wealth = asset - debt
(37,081 missing values generated)

. gen double wealth_ln = ln(wealth)
(39,807 missing values generated)

. 
. *summary statistics
. sum asset land_r land_u building_all livestock trspt agri non_farm shares fin_other gold fin_rec buildin
> g_resid 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       asset |    110,800     1782862    1.13e+07          0   1.85e+09
      land_r |     67,747     1041569     3905052          0   2.49e+08
      land_u |     34,217     1380122     8276187          0   1.28e+09
building_all |     95,488    614870.7    1.01e+07          0   1.85e+09
   livestock |     44,407    32474.12    54060.96          0    2590000
-------------+---------------------------------------------------------
       trspt |     71,749    74586.56    279375.5          0   2.07e+07
        agri |     48,270     8792.89    50198.23          0    7700000
    non_farm |     24,552           0           0          0          0
      shares |      3,836    46152.68      351695          0   1.21e+07
   fin_other |    101,412    66760.63    267276.4          0   3.26e+07
-------------+---------------------------------------------------------
        gold |    101,412    63457.91    160273.4          0   1.29e+07
     fin_rec |      6,775    65060.67    424340.3          0   2.00e+07
building_r~d |     95,488    568308.2     9849675          0   1.85e+09

. 
. ****************************************************************************
. * Asset allocation
. ****************************************************************************
. keep if head_age >= 24 //consistent with the paper restriction.
(2,266 observations deleted)

. 
. **share of real estate on 
. * real_estate (77%), durable good (7%), gold (11%)
. gen re_share = real_estate/asset
(672 missing values generated)

. gen du_share = durable_other/asset
(672 missing values generated)

. gen gl_share = gold / asset
(8,631 missing values generated)

. 
. sum re_share du_share gl_share //gold is 11% closest with paper. 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    re_share |    107,862    .7552001     .290893          0          1
    du_share |    107,862    .0629695    .1267183          0          1
    gl_share |     99,903    .1089669    .1968698          0          1

. sum re_share du_share gl_share [aw = hhwgt] 

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
    re_share | 107,862   454835504    .7567272    .298137          0          1
    du_share | 107,862   454835504    .0583045    .121603          0          1
    gl_share |  99,903   415267015    .1233037   .2136998          0          1

. sum re_share du_share gl_share [aw = pwgt] //gold is 11% closest with paper. 

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
    re_share | 107,862  2.0722e+09    .7755733    .274023          0          1
    du_share | 107,862  2.0722e+09    .0603331   .1165205          0          1
    gl_share |  99,903  1.9011e+09    .1094104   .1952706          0          1

. 
. ** USE TABLE 1 to try and match mean and median of assets. Paper has Mean of 1,581,228 and Median of 501
> ,880
. *Unweighted 
. tabstat asset, s(mean p50) format("%9.0fc") // 1,813,187   602,800

    variable |      mean       p50
-------------+--------------------
       asset | 1,813,187   602,800
----------------------------------

. *Weighted
. global asset_table "asset_fin fin_retire asset_non_fin real_estate durable_other gold asset"

. tabstat $asset_table [aw=hhwgt], s(mean p50) format("%9.0fc") // total: 1,561,322   490,570

   stats |  as~t_fin  fin_re~e  as~n_fin  real_e~e  durabl~r      gold     asset
---------+----------------------------------------------------------------------
    mean |    52,574    17,930 1,480,586 1,372,546    50,171    63,913 1,561,322
     p50 |     2,200         0   460,000   396,195     9,000    25,000   490,570
--------------------------------------------------------------------------------

. tabstat $asset_table [aw=pwgt], s(mean p50) format("%9.0fc") // total: 1,754,928   567,775

   stats |  as~t_fin  fin_re~e  as~n_fin  real_e~e  durabl~r      gold     asset
---------+----------------------------------------------------------------------
    mean |    49,179    16,475 1,673,080 1,554,853    59,373    64,471 1,754,928
     p50 |     2,400         0   535,000   464,000    15,000    25,000   567,775
--------------------------------------------------------------------------------

. 
. *write to the matrix
. preserve

. clear matrix

. eststo all: quietly estpost summarize $asset_table  [aw=hhwgt]

. 
. unab vars : $asset_table 

. local num : word count `vars'

. matrix m = J(`num',2,0)

. local i = 1

. 
. foreach var in $asset_table {
  2. qui sum `var' [aw=hhwgt],de
  3. matrix m[`i',1] = `r(mean)'
  4. matrix m[`i',2] = `r(p50)'
  5. local i = `i' + 1
  6. }

. 
. matrix rownames m = $asset_table

. matrix colnames m = mean p50

. matrix list m

m[7,2]
                   mean        p50
   asset_fin  52573.712       2200
  fin_retire  17929.947          0
asset_non_~n    1480586     460000
 real_estate  1372545.5     396195
durable_ot~r  50170.976       9000
        gold  63912.865      25000
       asset    1561322     490570

. 
. svmat m,names(col)

. keep mean p50

. keep if !mi(mean) | !mi(p50)
(108,527 observations deleted)

. gen name = _n

. save "${r_output}\m_asset",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Data Output Files\m_asset.dta sa
> ved

. 
. 
. *table 1 data to compare
. import excel "${r_input}\paper_tab_1.xlsx", sheet("Sheet1") firstrow clear

. save "${r_input}\tab_1.dta",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Raw Data & Dictionaries\tab_1.dt
> a saved

. 
. keep if type == "asset"
(7 observations deleted)

. ren (mean p50)(mean_tb p50_tb)

. 
. merge 1:1 name using "${r_output}\m_asset"
(note: variable name was byte, now float to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                 7  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. foreach v in mean p50 {
  2. gen double delta_`v' = (`v' - `v'_tb)/`v'_tb * 100
  3. format delta_`v' %9.0fc
  4. }
(1 missing value generated)

. 
. drop name type

. 
. list

     +------------------------------------------------------------------------------------+
     | mean_tb    p50_tb              name_full       mean      p50   delta_~n   delta~50 |
     |------------------------------------------------------------------------------------|
  1. |  24,681     1,350        Financial asset   52573.71     2200        113         63 |
  2. |  28,317         0    Retirement accounts   17929.95        0        -37          . |
  3. | 1528232   478,300   Non-financial assets    1480586   460000         -3         -4 |
  4. | 1441279   407,000            Real estate    1372546   396195         -5         -3 |
  5. |  58,660    11,680          Durable goods   50170.98     9000        -14        -23 |
     |------------------------------------------------------------------------------------|
  6. |  58,292    20,000           Gold/bullion   63912.87    25000         10         25 |
  7. | 1581228   501,880            Total asset    1561322   490570         -1         -2 |
     +------------------------------------------------------------------------------------+

. 
. restore

. **residential building ownership
. codebook building_resid 

----------------------------------------------------------------------------------------------------------
building_resid                                                                                 (unlabeled)
----------------------------------------------------------------------------------------------------------

                  type:  numeric (long)

                 range:  [0,1.850e+09]                units:  1
         unique values:  4,435                    missing .:  13,971/108,534

                  mean:    571998
              std. dev:   9.9e+06

           percentiles:        10%       25%       50%       75%       90%
                             36100     75000    180000    450000   1.0e+06

. 
. gen legal_own = (building_resid > 0)

. replace legal_own = 0 if mi(building_resid) //treat missing as household do not own real estate assets.
(13,971 real changes made)

. 
. bysort urban: sum legal_own [aw = hhwgt],de 

----------------------------------------------------------------------------------------------------------
-> urban = 0

                          legal_own
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            1              0       Obs              61,217
25%            1              0       Sum of Wgt.   303555500

50%            1                      Mean           .9487511
                        Largest       Std. Dev.      .2205068
75%            1              1
90%            1              1       Variance       .0486233
95%            1              1       Skewness      -4.070211
99%            1              1       Kurtosis       17.56662

----------------------------------------------------------------------------------------------------------
-> urban = 1

                          legal_own
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              47,317
25%            0              0       Sum of Wgt.   155093220

50%            1                      Mean           .6909342
                        Largest       Std. Dev.      .4621132
75%            1              1
90%            1              1       Variance       .2135486
95%            1              1       Skewness      -.8263613
99%            1              1       Kurtosis       1.682873


. 
. ****************************************************************************
. * Liabilitiy allocation on 
. ****************************************************************************
. use "${r_input}\Visit 1_Block 14",clear

. 
. *debt -- paper says liabilities on date of survey. pp16: "Panel A of Figure 2 reports the average alloca
> tion of liabilities across all households that carry a positive amount of debt at the date of the survey
> ."
. gen debt = b14_q17 // 17 is the outstanding amount on 30.06.2012
(74,953 missing values generated)

. gen debt_todt = b14_q16 //outstanding amount at the date of survey. 
(2,415 missing values generated)

. sum debt,de

                            debt
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         4200              0
10%         7420              0       Obs             108,756
25%        17990              0       Sum of Wgt.     108,756

50%        48800                      Mean           169114.3
                        Largest       Std. Dev.      931886.7
75%       140000       4.00e+07
90%       371695       4.00e+07       Variance       8.68e+11
95%       638480       1.83e+08       Skewness       142.1036
99%      1900207       1.83e+08       Kurtosis       27330.57

. 
. *in paper: keep households with total liability >0 
. gen temp_debt =  (b14_q1 == "99")*debt
(74,953 missing values generated)

. egen double total_debt = sum(temp_debt), by(HHID)

. drop temp_debt

. 
. gen temp_debt =  (b14_q1 != "99")*debt_todt
(2,415 missing values generated)

. egen double total_debt_m = sum(temp_debt),by(HHID)

. drop temp_debt

. 
. gen temp_debt_todt =  (b14_q1 == "99")*debt_todt
(2,415 missing values generated)

. egen double total_debt_todt = sum(temp_debt_todt), by(HHID)

. drop temp_debt_todt

. 
. gen temp_debt_todt = (b14_q1 == "99")*debt_todt //to date of survey the total debt. 
(2,415 missing values generated)

. egen double total_debt_todt_m = sum(temp_debt_todt), by(HHID)

. drop temp_debt_todt

. 
. *check the manual total and the survey total
. count if total_debt > total_debt_m
  57,103

. count if total_debt < total_debt_m // manual has 568 observations where it is larger 
  92,115

. 
. tab b14_q1

 Serial no. |      Freq.     Percent        Cum.
------------+-----------------------------------
         01 |     73,719       40.13       40.13
         02 |     21,945       11.95       52.07
         03 |      8,024        4.37       56.44
         04 |      3,600        1.96       58.40
         05 |      1,514        0.82       59.23
         06 |        705        0.38       59.61
         07 |        380        0.21       59.82
         08 |        212        0.12       59.93
         09 |        117        0.06       59.99
         10 |         73        0.04       60.03
         11 |         45        0.02       60.06
         12 |         33        0.02       60.08
         13 |         19        0.01       60.09
         14 |         13        0.01       60.09
         15 |         11        0.01       60.10
         16 |         10        0.01       60.11
         17 |          8        0.00       60.11
         18 |          4        0.00       60.11
         19 |          3        0.00       60.11
         20 |          3        0.00       60.12
         21 |          1        0.00       60.12
         22 |          1        0.00       60.12
         23 |          1        0.00       60.12
         24 |          1        0.00       60.12
         25 |          1        0.00       60.12
         99 |     73,266       39.88      100.00
------------+-----------------------------------
      Total |    183,709      100.00

. sort HHID

. br HHID b14* if total_debt == total_debt_m //there are hosueholds with no total liability coded.  

. 
. //need to use the 99 total and not the manual to match the paper 
. 
. *generate share of gold loan, unsecured debt
. gen gold_loan = (b14_q12 == "05")*debt
(74,953 missing values generated)

. gen oth_secure_loan = (inlist(b14_q12,"01","02","06","07","08","09"))*debt
(74,953 missing values generated)

. gen mrtg_loan = (inlist(b14_q12,"03","04"))*debt
(74,953 missing values generated)

. 
. gen unsecure_loan = (b14_q12 == "10")*debt
(74,953 missing values generated)

. egen double secure_loan = rowtotal(mrtg_loan gold_loan oth_secure_loan) 

. 
. *collapse at household level. 
. foreach type in secure_loan mrtg_loan gold_loan oth_secure_loan unsecure_loan { 
  2. egen double total_`type' = sum(`type'), by(HHID)
  3. } 

. 
. keep HHID total*

. bys HHID: keep if _n == 1 // keep only one observation for each HH
(109,989 observations deleted)

.  
. *merge with households information
. merge 1:1 HHID using "${root}\Data Output Files\NSS70_All.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                        37,080
        from master                         0  (_merge==1)
        from using                     37,080  (_merge==2)

    matched                            73,720  (_merge==3)
    -----------------------------------------

. 
. *in paper: keep households with head older than 24.
. keep if head_age >= 24
(2,266 observations deleted)

. keep if total_debt > 0
(28,104 observations deleted)

. 
. ** Liability allocation gold (4%), unsecured loan (55%), mortgage loan (23%)
. 
. *generate share of gold loan on total liability
. gen double gold_loan_share = total_gold_loan/total_debt
(35,564 missing values generated)

. gen double unsecure_share = total_unsecure_loan/total_debt
(35,564 missing values generated)

. gen mrtg_loan_share = total_mrtg_loan/total_debt
(35,564 missing values generated)

. 
. *Need to match 4%, 55% and 23% (only for households the date of survey liability is positive) 
. sum gold_loan_share unsecure_share mrtg_loan_share total_gold_loan total_unsecure_loan total_mrtg_loan [
> aw = pwgt] if total_debt_todt > 0

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
gold_loan_~e |  44,409   626127839    .0693761   .2374889          0          1
unsecure_s~e |  44,409   626127839    .5598109   .4748745          0          1
mrtg_loan_~e |  44,409   626127839    .2351137   .4058646          0          1
total_gold~n |  44,409   626127839    10316.68   54087.59          0    2256000
total_unse~n |  44,409   626127839    59841.85   235858.7          0   1.64e+07
-------------+-----------------------------------------------------------------
total_mrtg~n |  44,409   626127839    83517.74   709485.7          0   1.83e+08

. sum gold_loan_share unsecure_share mrtg_loan_share total_gold_loan total_unsecure_loan total_mrtg_loan [
> aw = hhwgt] if total_debt_todt > 0

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
gold_loan_~e |  44,409   130553605    .0777094   .2509872          0          1
unsecure_s~e |  44,409   130553605    .5567404   .4754202          0          1
mrtg_loan_~e |  44,409   130553605    .2280975   .4017766          0          1
total_gold~n |  44,409   130553605    11091.44   55266.26          0    2256000
total_unse~n |  44,409   130553605    59636.25   278062.1          0   1.64e+07
-------------+-----------------------------------------------------------------
total_mrtg~n |  44,409   130553605    87440.74   653621.1          0   1.83e+08

. sum gold_loan_share unsecure_share mrtg_loan_share total_gold_loan total_unsecure_loan total_mrtg_loan i
> f total_debt_todt > 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gold_loan_~e |     44,409    .0516756    .2087063          0          1
unsecure_s~e |     44,409    .5390283    .4808403          0          1
mrtg_loan_~e |     44,409    .2461949    .4160992          0          1
total_gold~n |     44,409    7222.955    47253.84          0    2256000
total_unse~n |     44,409    64902.24    256857.4          0   1.64e+07
-------------+---------------------------------------------------------
total_mrtg~n |     44,409    99978.16    990700.7          0   1.83e+08

. 
. ** USE TABLE 1 to try and match mean and median of liability. Paper has Mean of 180,153 and Median of 51
> ,614
. global lbt_table "total_secure_loan total_mrtg_loan total_gold_loan total_oth_secure_loan total_unsecure
> _loan total_debt"

. 
. *Unweighted 
. tabstat total_debt_todt total_debt total_gold_loan total_unsecure_loan total_mrtg_loan , s(mean p50) for
> mat("%9.0fc") // 152,686    39,586

   stats |  total~dt  total~bt  t~d_loan  t~unse~n  t~g_loan
---------+--------------------------------------------------
    mean |   191,977   203,337     7,160    64,410    99,142
     p50 |    55,000    57,619         0    10,000         0
------------------------------------------------------------

. *Weighted
. tabstat total_debt_todt total_debt total_gold_loan total_unsecure_loan total_mrtg_loan [aw=hhwgt], s(mea
> n p50) format("%9.0fc") // 143,652    40,400

   stats |  total~dt  total~bt  t~d_loan  t~unse~n  t~g_loan
---------+--------------------------------------------------
    mean |   178,942   180,807    11,019    59,339    86,940
     p50 |    55,000    52,000         0    11,200         0
------------------------------------------------------------

. tabstat total_debt_todt total_debt total_gold_loan total_unsecure_loan total_mrtg_loan [aw=pwgt], s(mean
>  p50) format("%9.0fc") // 143,273    43,600

   stats |  total~dt  total~bt  t~d_loan  t~unse~n  t~g_loan
---------+--------------------------------------------------
    mean |   175,080   175,868    10,250    59,538    83,054
     p50 |    56,000    53,500         0    12,000         0
------------------------------------------------------------

. 
. *write to the matrix
. preserve

. clear matrix

. eststo all: quietly estpost summarize $lbt_table  [aw=hhwgt]

. 
. unab vars : $lbt_table 

. local num : word count `vars'

. matrix m = J(`num',2,0)

. local i = 1

. 
. foreach var in $lbt_table {
  2. qui sum `var' [aw=hhwgt],de
  3. matrix m[`i',1] = `r(mean)'
  4. matrix m[`i',2] = `r(p50)'
  5. local i = `i' + 1
  6. }

. 
. matrix rownames m = $lbt_table

. matrix colnames m = mean p50

. matrix list m

m[6,2]
                   mean        p50
total_secu~n  121468.01          0
total_mrtg~n  86940.096          0
total_gold~n  11018.761          0
total_oth_~n   23509.15          0
total_unse~n  59338.919      11200
  total_debt  180806.93      52000

. 
. svmat m,names(col)

. keep mean p50

. keep if !mi(mean) | !mi(p50)
(80,424 observations deleted)

. gen name = _n

. save "${r_output}\m_asset",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Data Output Files\m_asset.dta sa
> ved

. 
. *table 1 data to compare
. import excel "${r_input}\paper_tab_1.xlsx", sheet("Sheet1") firstrow clear

. save "${r_input}\tab_1.dta",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Raw Data & Dictionaries\tab_1.dt
> a saved

. 
. keep if type == "liability"
(7 observations deleted)

. ren (mean p50)(mean_tb p50_tb)

. 
. merge 1:1 name using "${r_output}\m_asset"
(note: variable name was byte, now float to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  (_merge==1)
        from using                          0  (_merge==2)

    matched                                 6  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. foreach v in mean p50 {
  2. gen double delta_`v' = (`v' - `v'_tb)/`v'_tb * 100
  3. format delta_`v' %9.0fc
  4. }
(1 missing value generated)
(5 missing values generated)

. 
. drop name type

. 
. list

     +------------------------------------------------------------------------------------+
     | mean_tb   p50_tb                name_full       mean     p50   delta_~n   delta~50 |
     |------------------------------------------------------------------------------------|
  1. | 120,845        0            Secured loans     121468       0          1          . |
  2. |  86,631        0           Mortgage loans   86940.09       0          0          . |
  3. |  10,817        0               Gold loans   11018.76       0          2          . |
  4. |  23,397        0      Other secured loans   23509.15       0          0          . |
  5. |  59,308   11,250          Unsecured loans   59338.92   11200          0         -0 |
     |------------------------------------------------------------------------------------|
  6. | 180,153   51,614               Total debt   180806.9   52000          0          1 |
  7. |  49,108    8,000   Non-institutional debt          .       .          .          . |
     +------------------------------------------------------------------------------------+

. 
. restore

. ****************************************************************************
. * Liabilitiy allocation (value weighted) on 
. * unsecured and gold (35% written in paper), mortgage loan (46% extract using )
. ****************************************************************************
. 
. use "${r_input}\Visit 1_Block 14",clear

. 
. *debt 
. gen debt = b14_q17 // 17 is on 30.06.2012
(74,953 missing values generated)

. 
. gen temp_debt_todt = (b14_q1 == "99")*b14_q16 //to date of survey the total debt. 
(2,415 missing values generated)

. egen double total_debt_todt = sum(temp_debt_todt), by(HHID)

. drop temp_debt_todt

. 
. *merge with households information
. merge m:1 HHID using "${root}\Data Output Files\NSS70_All.dta"
(note: variable debt was float, now double to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                        37,080
        from master                         0  (_merge==1)
        from using                     37,080  (_merge==2)

    matched                           183,709  (_merge==3)
    -----------------------------------------

. 
. *in paper: keep households with head older than 24.
. drop if b14_q1 == "99"
(73,266 observations deleted)

. keep if head_age >= 24
(2,455 observations deleted)

. keep if total_debt_todt > 0 & !mi(total_debt_todt) //the date of survey liability is positive. 
(37,153 observations deleted)

. 
. 
. *Recode security type 
. gen liability_type = real(b14_q12)

. recode liability_type (1 2 6 7 8 9 = 1) (3 4 = 2) (5 =3) (10=4)
(liability_type: 101239 changes made)

. label define liability_type 1 "Secured" 2 "Mortgage" 3 "Gold" 4 "Unsecured"

. 
. *Unweighted Sums
. egen double debt_type_total = sum(debt), by(liability_type)

. egen double debt_total = sum(debt)

. gen debt_share_panel_b = 100 * debt_type_total / debt_total

. table liability_type, c(mean debt_share_panel_b sd debt_share_panel_b ) format("%9.0f") // get 16, 49 (m
> ortgage), 4, 32 => so gold+unsec = 36

------------------------------------------
liability |
_type     | mean(debt_s~b)    sd(debt_s~b)
----------+-------------------------------
        1 |             16               0
        2 |             49               0
        3 |              4               0
        4 |             32               0
------------------------------------------

. 
. *Weighted Sums  
. egen double debt_type_total_wt = sum(debt * hhwgt), by(liability_type)

. egen double debt_total_wt = sum(debt*hhwgt)

. gen debt_share_panel_b_wt = 100 * debt_type_total_wt/ debt_total_wt

. table liability_type, c(mean debt_share_panel_b_wt sd debt_share_panel_b_wt ) format("%9.0f") // get 13,
>  48 (mortgage), 6, 33 => so gold+unsec = 39

------------------------------------------
liability |
_type     | mean(debt_s~t)    sd(debt_s~t)
----------+-------------------------------
        1 |             13               0
        2 |             48               0
        3 |              6               0
        4 |             33               0
------------------------------------------

. 
. 
. log close
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\02_Table of 
> Means NSS 70.log
  log type:  text
 closed on:  10 Nov 2020, 03:28:01
----------------------------------------------------------------------------------------------------------
