-----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\
> Survey_NSS\03_Import NSS70_housing_mortgage.log
  log type:  text
 opened on:  27 Oct 2020, 10:07:07

. 
. use "${r_input}\Visit 1_Block 14",clear

. drop if b14_q1 == "99" //drop the total amount
(73,266 observations deleted)

. 
. *debt, borrowed amount, repay amount.
. gen debt = b14_q17 //outstanding amout at end of June 2012
(47,671 missing values generated)

. gen borrow = b14_q5 //original borrowed amount
(1 missing value generated)

. gen repay = b14_q14 //amount (`) repaid (including interest) during 01.07.2012 to
>  date of survey
(43,996 missing values generated)

. 
. codebook debt borrow repay

-----------------------------------------------------------------------------------
debt                                                                    (unlabeled)
-----------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,1.830e+08]                units:  1
         unique values:  15,092                   missing .:  47,671/110,443

                  mean:    147054
              std. dev:    856792

           percentiles:        10%       25%       50%       75%       90%
                              7000     16000     41400    118000    320000

-----------------------------------------------------------------------------------
borrow                                                                  (unlabeled)
-----------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [150,2.000e+08]              units:  1
         unique values:  1,398                    missing .:  1/110,443

                  mean:    109220
              std. dev:    690401

           percentiles:        10%       25%       50%       75%       90%
                              5000     10000     30000     87400    250000

-----------------------------------------------------------------------------------
repay                                                                   (unlabeled)
-----------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [0,13000000]                 units:  1
         unique values:  7,182                    missing .:  43,996/110,443

                  mean:   25914.4
              std. dev:    100622

           percentiles:        10%       25%       50%       75%       90%
                                 0       825      6000     22000     60000

. 
. *** Two housing mortgage definitions 
. tab b14_q12

    Type of |
   security |      Freq.     Percent        Cum.
------------+-----------------------------------
         01 |      6,806        6.16        6.16
         02 |      1,577        1.43        7.59
         03 |      4,251        3.85       11.44
         04 |     15,648       14.17       25.61
         05 |      9,400        8.51       34.12
         06 |      1,018        0.92       35.04
         07 |        304        0.28       35.32
         08 |      2,121        1.92       37.24
         09 |      4,111        3.72       40.96
         10 |     65,201       59.04      100.00
------------+-----------------------------------
      Total |    110,437      100.00

. gen secure_type = b14_q12
(6 missing values generated)

. 
. tab b14_q11

 Purpose of |
       loan |      Freq.     Percent        Cum.
------------+-----------------------------------
         01 |      6,886        6.24        6.24
         02 |     13,660       12.37       18.60
         03 |      6,167        5.58       24.19
         04 |      4,227        3.83       28.02
         05 |         66        0.06       28.08
         06 |      1,876        1.70       29.77
         07 |        200        0.18       29.95
         08 |      3,707        3.36       33.31
         09 |      7,998        7.24       40.55
         10 |     10,068        9.12       49.67
         11 |     17,313       15.68       65.35
         12 |     38,271       34.65      100.00
------------+-----------------------------------
      Total |    110,439      100.00

. gen loan_purpose = b14_q11
(4 missing values generated)

. 
. * (A) Conservative (let's label 1)housing loan with immovable property as secure 
> type: B14_Q11 == 11 & (B14_Q12 == 3 | B14_Q12 == 4)
. gen mrtg_1_dm = (loan_purpose == "11" & (secure_type == "04"|secure_type == "03")
> )

. 
. * (B) Less conservative (let's label 2) housing loan with mortgage: B14_Q11 == 11
>  & B14_13 != 4
. gen mrtg_2_dm = (loan_purpose == "11" & (b14_q13 != "4"& b14_q13 != ""))

. 
. *houseing mortgage amount
. foreach var in debt borrow repay {
  2. gen mrtg_1_`var' = mrtg_1_dm*`var'
  3. gen mrtg_2_`var' = mrtg_2_dm*`var'
  4. }
(47,671 missing values generated)
(47,671 missing values generated)
(1 missing value generated)
(1 missing value generated)
(43,996 missing values generated)
(43,996 missing values generated)

. 
. *aggregate at household level. 
. egen double debt_total = sum(debt),by(HHID)

. egen double borrow_total = sum(borrow),by(HHID)

. drop debt borrow

. 
. *** Other laon features
. tab b14_q3 [aw = Weight_SS]

    Date of |
borrowing - |
       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1972 | .068661433        0.00        0.00
       1973 | .166560667        0.00        0.00
       1975 | .258793759        0.00        0.00
       1978 | .172179566        0.00        0.00
       1979 |  .37915914        0.00        0.00
       1980 |  .42355915        0.00        0.00
       1981 | .109710261        0.00        0.00
       1982 | .206973275        0.00        0.00
       1983 | .487978062        0.00        0.00
       1984 | 5.39291459        0.00        0.01
       1985 | 4.92282315        0.00        0.01
       1986 | .921260049        0.00        0.01
       1987 | 2.81837543        0.00        0.01
       1988 | 4.37699311        0.00        0.02
       1989 | 11.2401726        0.01        0.03
       1990 | 12.1221539        0.01        0.04
       1991 | 1.90042562        0.00        0.04
       1992 | 24.9979048        0.02        0.06
       1993 | 22.4553342        0.02        0.08
       1994 | 22.8229468        0.02        0.11
       1995 | 32.7070057        0.03        0.13
       1996 | 35.8474002        0.03        0.17
       1997 |32.74288922        0.03        0.20
       1998 | 112.428431        0.10        0.30
       1999 | 89.8188925        0.08        0.38
       2000 | 217.964276        0.20        0.58
       2001 |  193.72347        0.18        0.75
       2002 | 270.489796        0.24        1.00
       2003 | 326.364678        0.30        1.29
       2004 |472.6414318        0.43        1.72
       2005 | 777.277254        0.70        2.43
       2006 | 1,064.5175        0.96        3.39
       2007 | 1,608.6038        1.46        4.85
       2008 | 2,797.3929        2.53        7.38
       2009 | 4,171.3465        3.78       11.16
       2010 | 8,215.2498        7.44       18.59
       2011 |  15,592.81       14.12       32.71
       2012 | 54,426.567       49.28       82.00
       2013 | 19,884.262       18.00      100.00
------------+-----------------------------------
      Total |    110,439      100.00

. tab b14_q2 [aw = Weight_SS]

    Date of |
borrowing - |
      month |      Freq.     Percent        Cum.
------------+-----------------------------------
         01 |  11,816.98       10.70       10.70
         02 | 10,230.102        9.26       19.96
         03 | 10,607.117        9.61       29.57
         04 | 12,278.078       11.12       40.69
         05 | 11,572.801       10.48       51.17
         06 | 11,191.734       10.13       61.30
         07 |8,320.24461        7.53       68.84
         08 | 9,180.2643        8.31       77.15
         09 | 5,802.3886        5.25       82.40
         10 | 6,636.2567        6.01       88.41
         11 | 6,369.0017        5.77       94.18
         12 | 6,428.0317        5.82      100.00
------------+-----------------------------------
      Total |    110,433      100.00

. 
. *interest rate and type
. gen intst_rate = b14_q10
(539 missing values generated)

. gen intst_type = b14_q9
(34 missing values generated)

. 
. *loan borrowing date. 
. gen month = real(b14_q2)
(10 missing values generated)

. gen year = b14_q3
(4 missing values generated)

. 
. gen date_loan = ym(year,month)
(10 missing values generated)

. format date_loan %tmMCY

. 
. merge m:1 HHID using "${root}\Data Output Files\NSS70_All.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                        37,081
        from master                         0  (_merge==1)
        from using                     37,081  (_merge==2)

    matched                           110,443  (_merge==3)
    -----------------------------------------

. gen loan_age = date_survey - date_loan //laon from borrow to date of survey, in m
> onth.
(37,091 missing values generated)

. replace loan_age = . if loan_age < 0 
(198 real changes made, 198 to missing)

. 
. *asset and wealth feature (household level)
. egen double asset = rowtotal(land_r land_u building_all livestock trspt agri non_
> farm shares fin_other gold fin_rec) 

. egen double real_estate = rowtotal(building_resid land_r land_u)

. gen double wealth = asset - debt
(37,081 missing values generated)

. 
. gen temp_debt =  (b14_q1 == "99")*debt
(37,081 missing values generated)

. egen total_debt = sum(temp_debt), by(HHID)

. 
. save "${r_output}\b14_hse_mortgage",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Data Outp
> ut Files\b14_hse_mortgage.dta saved

. 
. ***stats: individual loans
. use "${r_output}\b14_hse_mortgage",clear

. 
. forvalues i=1/2 {
  2. tabstat real_estate mrtg_`i'_borrow mrtg_`i'_debt mrtg_`i'_repay loan_age ints
> t_rate if mrtg_`i'_dm >0 [aw = Weight_SS], s(mean median sd) format(%10.0fc) 
  3. }

   stats |  real_e~e  mrtg_1~w  mrtg_1~t  mrtg_1~y  loan_age  intst~te
---------+------------------------------------------------------------
    mean | 1,423,910   600,779   591,088    87,494        47        12
     p50 |   330,000   300,000   244,800    42,840        32        12
      sd |15,721,964   898,606   936,116   141,055        44         7
----------------------------------------------------------------------

   stats |  real_e~e  mrtg_2~w  mrtg_2~t  mrtg_2~y  loan_age  intst~te
---------+------------------------------------------------------------
    mean | 1,432,516   457,180   507,739    75,238        37        14
     p50 |   340,650   150,000   177,000    30,780        21        12
      sd |15,553,366   815,714   905,094   134,232        41         9
----------------------------------------------------------------------

. 
. ***stats: household aggregate. (narrow the sample to residential house owners)
. use "${r_output}\b14_hse_mortgage",clear

. 
. foreach type in mrtg_1_dm mrtg_2_dm mrtg_1_debt mrtg_2_debt mrtg_1_borrow mrtg_2_
> borrow mrtg_1_repay mrtg_2_repay{ 
  2. egen double total_`type' = sum(`type'), by(HHID)
  3. } 

. keep HHID total* real_estate wealth debt_total hhwgt 

. bys HHID: keep if _n == 1 // keep only one observation for each HH
(36,724 observations deleted)

. 
. foreach var in total_mrtg_1_dm total_mrtg_2_dm total_mrtg_1_debt total_mrtg_2_deb
> t total_mrtg_1_borrow total_mrtg_2_borrow total_mrtg_1_repay total_mrtg_2_repay {
>  //only focusing on real estate owner. 
  2. replace `var' = 0 if mi(`var') & real_estate > 0  //only focus on real estate 
> owner. 
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. *liability allocation to mortgage. 
. forvalues i = 1/2 {
  2. gen double mrtg_`i'_debt_share =  (total_mrtg_`i'_debt /debt_total)*100
  3. }
(65,122 missing values generated)
(65,122 missing values generated)

. 
. *borrowed mortgage to real estate value. 
. forvalues i = 1/2 {
  2. gen double mrtg_`i'_re_share =  (total_mrtg_`i'_borrow /real_estate)*100
  3. }
(12,500 missing values generated)
(12,500 missing values generated)

. 
. *stats
. forvalues i=1/2 { //household with housing mortgage
  2. tabstat real_estate total_mrtg_`i'_borrow total_mrtg_`i'_debt total_mrtg_`i'_r
> epay  ///
> mrtg_`i'_re_share mrtg_`i'_debt_share if total_mrtg_`i'_dm >0 [aw = hhwgt], s(mea
> n median sd) format(%10.0fc) 
  3. }

   stats |  real_e~e  total_..  t~1_debt  ~1_repay  mrtg_1..  mrtg_1..
---------+------------------------------------------------------------
    mean | 3,301,553   649,350   549,207    76,278        31        85
     p50 | 1,900,000   300,000   199,500    30,000        17       100
      sd | 5,741,048 1,028,951   993,518   140,896        50        27
----------------------------------------------------------------------

   stats |  real_e~e  total_..  t~2_debt  ~2_repay  mrtg_2..  mrtg_2..
---------+------------------------------------------------------------
    mean | 2,849,822   543,813   453,923    63,828        29        82
     p50 | 1,465,000   201,000   135,000    20,790        16       100
      sd | 5,204,016   973,683   945,790   133,593        48        31
----------------------------------------------------------------------

. 
. foreach var in total_mrtg_1_dm total_mrtg_2_dm  { 
  2. replace `var' = 100 if `var'>0 & real_estate > 0  //only focus on real estate 
> owner. 
  3. replace `var' = 0 if `var' == 0 & real_estate > 0
  4. }
(4,559 real changes made)
(0 real changes made)
(5,892 real changes made)
(0 real changes made)

. 
. forvalues i=1/2 { //all real estate owner
  2. tabstat real_estate total_mrtg_`i'_borrow total_mrtg_`i'_debt total_mrtg_`i'_r
> epay  ///
> mrtg_`i'_re_share mrtg_`i'_debt_share total_mrtg_`i'_dm if real_estate >0 [aw = h
> hwgt], s(mean median sd) format(%10.0fc) 
  3. }

   stats |  real_e~e  total_..  t~1_debt  ~1_repay  mrtg_1..  mrtg_1..  tot~1_dm
---------+----------------------------------------------------------------------
    mean | 1,536,939    19,229    16,278     2,276         1         7         3
     p50 |   494,900         0         0         0         0         0         0
      sd |13,246,061   209,102   195,239    27,669        10        25        17
--------------------------------------------------------------------------------

   stats |  real_e~e  total_..  t~2_debt  ~2_repay  mrtg_2..  mrtg_2..  tot~2_dm
---------+----------------------------------------------------------------------
    mean | 1,536,939    21,639    18,087     2,558         1         9         4
     p50 |   494,900         0         0         0         0         0         0
      sd |13,246,061   222,299   209,359    29,648        11        27        19
--------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\
> Survey_NSS\03_Import NSS70_housing_mortgage.log
  log type:  text
 closed on:  27 Oct 2020, 10:07:21
-----------------------------------------------------------------------------------
