------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\03_Import NSS7
> 0_housing_mortgage.log
  log type:  text
 opened on:  10 Nov 2020, 09:10:50

. 
. use "${r_input}\Visit 1_Block 14",clear

. drop if b14_q1 == "99" //drop the total amount
(73,266 observations deleted)

. 
. *debt, borrowed amount, repay amount.
. gen debt = b14_q17 //outstanding amout at end of June 2012
(47,671 missing values generated)

. gen debt_todt = b14_q16 //outstanding amout at the date of survey
(1,688 missing values generated)

. gen borrow = b14_q5 //original borrowed amount
(1 missing value generated)

. gen repay = b14_q14 //amount (`) repaid (including interest) during 01.07.2012 to date of survey
(43,996 missing values generated)

. 
. 
. *** Two housing mortgage definitions 
. tab b14_q12

    Type of |
   security |      Freq.     Percent        Cum.
------------+-----------------------------------
         01 |      6,806        6.16        6.16
         02 |      1,577        1.43        7.59
         03 |      4,251        3.85       11.44
         04 |     15,648       14.17       25.61
         05 |      9,400        8.51       34.12
         06 |      1,018        0.92       35.04
         07 |        304        0.28       35.32
         08 |      2,121        1.92       37.24
         09 |      4,111        3.72       40.96
         10 |     65,201       59.04      100.00
------------+-----------------------------------
      Total |    110,437      100.00

. gen secure_type = b14_q12
(6 missing values generated)

. 
. tab b14_q11

 Purpose of |
       loan |      Freq.     Percent        Cum.
------------+-----------------------------------
         01 |      6,886        6.24        6.24
         02 |     13,660       12.37       18.60
         03 |      6,167        5.58       24.19
         04 |      4,227        3.83       28.02
         05 |         66        0.06       28.08
         06 |      1,876        1.70       29.77
         07 |        200        0.18       29.95
         08 |      3,707        3.36       33.31
         09 |      7,998        7.24       40.55
         10 |     10,068        9.12       49.67
         11 |     17,313       15.68       65.35
         12 |     38,271       34.65      100.00
------------+-----------------------------------
      Total |    110,439      100.00

. gen loan_purpose = b14_q11
(4 missing values generated)

. 
. * (A) Conservative (let's label 1)housing loan with immovable property as secure type: B14_Q11 == 11 & (B1
> 4_Q12 == 3 | B14_Q12 == 4)
. gen mrtg_1_dm = (loan_purpose == "11" & (secure_type == "04"|secure_type == "03"))

. 
. * (B) Less conservative (let's label 2) housing loan with mortgage: B14_Q11 == 11 & B14_13 != 4
. gen mrtg_2_dm = (loan_purpose == "11" & (b14_q13 != "4"& b14_q13 != ""))

. 
. *** Housing mortgage features 
. *houseing mortgage amount
. forvalues i = 1/2 {
  2.   foreach var in debt debt_todt borrow repay {
  3.   gen mrtg_`i'_`var' = mrtg_`i'_dm*`var'
  4.   }
  5. }
(47,671 missing values generated)
(1,688 missing values generated)
(1 missing value generated)
(43,996 missing values generated)
(47,671 missing values generated)
(1,688 missing values generated)
(1 missing value generated)
(43,996 missing values generated)

. 
. *aggregate at household level. 
. egen double debt_total = sum(debt),by(HHID)

. egen double borrow_total = sum(borrow),by(HHID)

. drop debt borrow

. 
. *** Other laon features
. tab b14_q3 [aw = Weight_SS]

    Date of |
borrowing - |
       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1972 | .068661433        0.00        0.00
       1973 | .166560667        0.00        0.00
       1975 | .258793759        0.00        0.00
       1978 | .172179566        0.00        0.00
       1979 |  .37915914        0.00        0.00
       1980 |  .42355915        0.00        0.00
       1981 | .109710261        0.00        0.00
       1982 | .206973275        0.00        0.00
       1983 | .487978062        0.00        0.00
       1984 | 5.39291459        0.00        0.01
       1985 | 4.92282315        0.00        0.01
       1986 | .921260049        0.00        0.01
       1987 | 2.81837543        0.00        0.01
       1988 | 4.37699311        0.00        0.02
       1989 | 11.2401726        0.01        0.03
       1990 | 12.1221539        0.01        0.04
       1991 | 1.90042562        0.00        0.04
       1992 | 24.9979048        0.02        0.06
       1993 | 22.4553342        0.02        0.08
       1994 | 22.8229468        0.02        0.11
       1995 | 32.7070057        0.03        0.13
       1996 | 35.8474002        0.03        0.17
       1997 |32.74288922        0.03        0.20
       1998 | 112.428431        0.10        0.30
       1999 | 89.8188925        0.08        0.38
       2000 | 217.964276        0.20        0.58
       2001 |  193.72347        0.18        0.75
       2002 | 270.489796        0.24        1.00
       2003 | 326.364678        0.30        1.29
       2004 |472.6414318        0.43        1.72
       2005 | 777.277254        0.70        2.43
       2006 | 1,064.5175        0.96        3.39
       2007 | 1,608.6038        1.46        4.85
       2008 | 2,797.3929        2.53        7.38
       2009 | 4,171.3465        3.78       11.16
       2010 | 8,215.2498        7.44       18.59
       2011 |  15,592.81       14.12       32.71
       2012 | 54,426.567       49.28       82.00
       2013 | 19,884.262       18.00      100.00
------------+-----------------------------------
      Total |    110,439      100.00

. tab b14_q2 [aw = Weight_SS]

    Date of |
borrowing - |
      month |      Freq.     Percent        Cum.
------------+-----------------------------------
         01 |  11,816.98       10.70       10.70
         02 | 10,230.102        9.26       19.96
         03 | 10,607.117        9.61       29.57
         04 | 12,278.078       11.12       40.69
         05 | 11,572.801       10.48       51.17
         06 | 11,191.734       10.13       61.30
         07 |8,320.24461        7.53       68.84
         08 | 9,180.2643        8.31       77.15
         09 | 5,802.3886        5.25       82.40
         10 | 6,636.2567        6.01       88.41
         11 | 6,369.0017        5.77       94.18
         12 | 6,428.0317        5.82      100.00
------------+-----------------------------------
      Total |    110,433      100.00

. 
. *interest rate and type
. gen intst_rate = b14_q10/100/12
(539 missing values generated)

. gen intst_type = b14_q9
(34 missing values generated)

. sum intst_rate [aw = Weight_SS],de

                         intst_rate
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs             109,904
25%         .005              0       Sum of Wgt.   349416471

50%          .01                      Mean           .0152051
                        Largest       Std. Dev.      .0195639
75%          .02             .2
90%          .03             .2       Variance       .0003827
95%          .05              1       Skewness       71.32512
99%           .1            4.5       Kurtosis       16004.17

. replace intst_rate  = . if intst_rate > r(p95)
(1,481 real changes made, 1,481 to missing)

. 
. *loan borrowing date. 
. gen month = real(b14_q2)
(10 missing values generated)

. gen year = b14_q3
(4 missing values generated)

. 
. gen date_loan = ym(year,month)
(10 missing values generated)

. format date_loan %tmMCY

. 
. merge m:1 HHID using "${root}\Data Output Files\NSS70_All.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                        37,081
        from master                         0  (_merge==1)
        from using                     37,081  (_merge==2)

    matched                           110,443  (_merge==3)
    -----------------------------------------

. gen loan_age = date_survey - date_loan //laon from borrow to date of survey, in month.
(37,091 missing values generated)

. replace loan_age = . if loan_age < 0 
(198 real changes made, 198 to missing)

. 
. sum loan_age [aw = Weight_SS],de

                          loan_age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            2              0       Obs             110,235
25%            5              0       Sum of Wgt.   350170108

50%           11                      Mean           18.56219
                        Largest       Std. Dev.      24.56695
75%           23            421
90%           44            457       Variance       603.5353
95%           63            476       Skewness        3.76297
99%          123            491       Kurtosis       25.40451

. replace loan_age  = . if loan_age > r(p99)
(1,477 real changes made, 1,477 to missing)

. 
. *household feature
. replace urban = urban*100 
(64,079 real changes made)

. 
. *monthly payment. 
. gen date_temp = ym(2012,7)

. gen pay_mt = date_survey - date_temp

. drop date_temp

. tab pay_mt 

     pay_mt |      Freq.     Percent        Cum.
------------+-----------------------------------
          6 |     18,053       12.24       12.24
          7 |     22,264       15.09       27.33
          8 |     23,828       16.15       43.48
          9 |     20,417       13.84       57.32
         10 |     23,984       16.26       73.58
         11 |     22,178       15.03       88.61
         12 |     16,624       11.27       99.88
         13 |        130        0.09       99.97
         14 |         18        0.01       99.98
         15 |         28        0.02      100.00
------------+-----------------------------------
      Total |    147,524      100.00

. 
. gen repay_mt = pay_mt

. 
. forvalues i=1/2  {
  2. gen double repay_mt_`i' = mrtg_`i'_repay/pay_mt
  3. }
(81,077 missing values generated)
(81,077 missing values generated)

. 
. sum repay_mt*

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    repay_mt |    147,524    8.976106    1.915224          6         15
  repay_mt_1 |     66,447    621.9818    4556.211          0   249639.2
  repay_mt_2 |     66,447    708.7756    4940.214          0   249639.2

. 
. *loan period estimation 
. forvalues i = 1/2 {
  2. gen double loan_period_`i'= - ln(1 - mrtg_`i'_borrow *intst_rate * (1/repay_mt_`i')) / ln(1+ intst_rate
> )
  3. sum loan_period_`i' [aw = Weight_SS],de
  4. replace loan_period_`i' = . if loan_period_`i' > r(p99)
  5. }
(144,269 missing values generated)

                        loan_period_1
-------------------------------------------------------------
      Percentiles      Smallest
 1%      7.53366       2.339866
 5%     15.58093       2.729418
10%     26.20565       3.229259       Obs               3,255
25%     53.33976        3.26585       Sum of Wgt.   8,081,192

50%     102.8545                      Mean           163.7759
                        Largest       Std. Dev.      272.9406
75%     179.0596       2307.234
90%     264.3022       3532.073       Variance       74496.56
95%      371.063       3532.073       Skewness        5.84224
99%      1770.43       3813.385       Kurtosis       46.18742
(11 real changes made, 11 to missing)
(143,571 missing values generated)

                        loan_period_2
-------------------------------------------------------------
      Percentiles      Smallest
 1%      6.69942       2.339866
 5%     11.78581       2.729418
10%     22.08141       3.050778       Obs               3,953
25%     48.85596       3.229259       Sum of Wgt.   9,947,052

50%     97.10983                      Mean           170.1287
                        Largest       Std. Dev.      296.2969
75%     174.4078       2357.645
90%     272.3213       3532.073       Variance       87791.83
95%     450.2782       3532.073       Skewness       5.077065
99%      1770.43       3813.385       Kurtosis       34.51334
(17 real changes made, 17 to missing)

. 
. sum loan_period_*

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
loan_perio~1 |      3,244    145.3515    193.6086   2.339866    1770.43
loan_perio~2 |      3,936    145.2648    212.1959   2.339866    1770.43

. 
. *the loan is subsidized 
. gen loan_sub = (b14_q7 != "09")*100 

. 
. *asset and wealth feature (household level)
. egen double asset = rowtotal(land_r land_u building_all livestock trspt agri non_farm shares fin_other gol
> d fin_rec) 

. egen double real_estate = rowtotal(building_dwelling land_r_resid land_u_resid) 

. egen double land_resid = rowtotal(land_r_resid land_u_resid)

. gen double wealth = asset - debt
(37,081 missing values generated)

. 
. gen temp_debt =  (b14_q1 == "99")*debt
(37,081 missing values generated)

. egen total_debt = sum(temp_debt), by(HHID)

. 
. *label variables
. label var urban "Urban Household (%)"

. label var hhsize "Houshold Size"

. label var head_age "Household Head Age"

. label var head_female "Female Household Head (%)"

. label var loan_sub "Subsidized (%)"

. 
. save "${r_output}\b14_hse_mortgage",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Data Output Files\b14_hse_mortgage
> .dta saved

. 
. ***********************************************
. ***Table 1. Homewoners
. ***********************************************
. use "${r_output}\b14_hse_mortgage",clear

. 
. keep if building_dwelling > 0 //only focus on home owner.
(498 observations deleted)

. 
. foreach type in mrtg_1_dm mrtg_2_dm mrtg_1_debt mrtg_2_debt mrtg_1_borrow mrtg_2_borrow mrtg_1_repay mrtg_
> 2_repay{ 
  2. egen double total_`type' = sum(`type'), by(HHID)
  3. } 

. //keep HHID total* real_estate wealth asset debt_total hhwgt building_dwelling_area
. bys HHID: keep if _n == 1 // keep only one observation for each HH
(36,582 observations deleted)

. 
. foreach var in total_mrtg_1_dm total_mrtg_2_dm total_mrtg_1_debt total_mrtg_2_debt total_mrtg_1_borrow tot
> al_mrtg_2_borrow total_mrtg_1_repay total_mrtg_2_repay { //only focusing on real estate owner. 
  2. replace `var' = 0 if mi(`var') 
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. /* Table Content:
> a. Value of Residential Real Estate where HH is Dwelling
> b. Value of Land Associated with #a
> c. Value of Building with #a
> d. Size in square of feet of building of #a
> e. Total assets of these people (median median)
> f. Percent of assets of residential RE in total assets 
> g) Who are these people? (i) urban, (ii) hh size, (iii) gender, (iv) age
> h. How many (%) of these had a mortgage (paid off)
> i. how many (%) of these _have_ a mortgage (not paid off)
> */
. 
. *Variables to generate
. replace building_dwelling_area = building_dwelling_area*10.76 //change unit from sq me to sq ft
variable building_dwelling_area was int now float
(91,971 real changes made)

. 
. gen real_estate_share = real_estate/asset*100 //f. Percent of assets of residential RE in total assets 
(1,190 missing values generated)

. 
. forvalues i=1/2  {
  2. gen total_mrtg_`i' = (total_mrtg_`i'_dm > 0)*100 //h. How many (%) of these had a mortgage (paid off)
  3. }

. 
. forvalues i=1/2  {
  2. gen total_mrtg_`i'_debt_dm = (total_mrtg_`i'_debt > 0)*100 //i. how many (%) of these _have_ a mortgage
>  (not paid off)
  3. }

. 
. *label the key variables
. label var real_estate "Value of Residential Real Estate where HH is Dwelling"

. label var land_resid "Value of Land Associated"

. label var building_dwelling "Value of Building"

. label var building_dwelling_area "Size of Dwelling in sq ft"

. label var asset "Total asset"

. label var real_estate_share "Residential RE in Total Assets (%)"

. label var total_mrtg_1 "Had a mortgage_1 (%)"

. label var total_mrtg_2 "Had a mortgage_2 (%)"

. label var total_mrtg_1_debt_dm  "Have a mortgage_1 (%)"

. label var total_mrtg_2_debt_dm  "Have a mortgage_2 (%)"

. 
. *create the table 
. global var_tab_1 "building_dwelling land_resid building_resid building_dwelling_area real_estate_share urb
> an hhsize head_female head_age total_mrtg_1 total_mrtg_2 total_mrtg_1_debt_dm total_mrtg_2_debt_dm"

. 
. xtile qtl = asset [aw=hhwgt] , n(5)

. 
. qui eststo total : estpost summarize $var_tab_1 [aw = hhwgt],de

. forvalues i = 1/5 {
  2. qui eststo q`i' : estpost summarize $var_tab_1 [aw = hhwgt] if qtl == `i',de
  3. }

. 
. esttab total q1 q2 q3 q4 q5, cells(mean(fmt(%9.1fc))) label collabels(none) ///
>  mtitles("All" "Q1" "Q2" "Q3" "Q4" "Q5") stats(N, label("Observations") fmt(%9.0gc)) ///
>  title("Tabel 1.1 Summary Statistics of Homeowners (mean)")

Tabel 1.1 Summary Statistics of Homeowners (mean)
--------------------------------------------------------------------------------------------------
                              (1)          (2)          (3)          (4)          (5)          (6)
                              All           Q1           Q2           Q3           Q4           Q5
--------------------------------------------------------------------------------------------------
Value of Building       562,044.2     34,069.4     85,440.3    165,343.2    326,540.5    1836659.4
Value of Land Asso~d    285,902.9      9,407.7     47,097.3     92,187.2    202,245.3    1078616.3
building_resid          523,912.2     33,447.6     83,082.6    159,336.7    311,785.9    1695957.6
Size of Dwelling i~t        698.3        356.6        500.1        630.3        757.2      1,035.8
Residential RE in ~(         50.1         37.9         60.6         52.5         49.5         48.5
Urban Household (%)          34.9         44.2         20.1         24.7         32.4         53.0
Houshold Size                 4.4          3.3          4.3          4.6          4.9          5.0
Female Household H~)         13.9         20.6         14.4         12.6         11.8          9.9
Household Head Age           46.0         38.1         44.8         46.1         49.1         52.0
Had a mortgage_1 (%)          2.6          0.4          0.8          1.2          2.6          7.9
Had a mortgage_2 (%)          3.5          0.8          1.4          2.0          4.0          9.3
Have a mortgage_1 ~)          2.3          0.4          0.7          1.0          2.2          7.0
Have a mortgage_2 ~)          2.8          0.5          1.0          1.5          3.0          7.9
--------------------------------------------------------------------------------------------------
Observations              110,444       16,467       20,719       22,202       24,080       26,976
--------------------------------------------------------------------------------------------------

. 
. esttab total q1 q2 q3 q4 q5, cells(p50(fmt(%9.1fc))) label collabels(none) ///
>  mtitles("All" "Q1" "Q2" "Q3" "Q4" "Q5") stats(N, label("Observations") fmt(%9.0gc)) ///
>  title("Tabel 1.2 Summary Statistics of Homeowners (med)")

Tabel 1.2 Summary Statistics of Homeowners (med)
--------------------------------------------------------------------------------------------------
                              (1)          (2)          (3)          (4)          (5)          (6)
                              All           Q1           Q2           Q3           Q4           Q5
--------------------------------------------------------------------------------------------------
Value of Building       150,000.0     30,000.0     76,500.0    150,000.0    250,000.0    700,000.0
Value of Land Asso~d     45,500.0          0.0     35,000.0     55,000.0    100,000.0    327,000.0
building_resid          150,000.0     30,000.0     75,000.0    150,000.0    250,000.0    600,000.0
Size of Dwelling i~t        516.5        269.0        398.1        495.0        591.8        860.8
Residential RE in ~(         49.7          0.0         65.9         50.2         43.6         43.5
Urban Household (%)           0.0          0.0          0.0          0.0          0.0        100.0
Houshold Size                 4.0          3.0          4.0          4.0          5.0          5.0
Female Household H~)          0.0          0.0          0.0          0.0          0.0          0.0
Household Head Age           45.0         35.0         42.0         45.0         48.0         51.0
Had a mortgage_1 (%)          0.0          0.0          0.0          0.0          0.0          0.0
Had a mortgage_2 (%)          0.0          0.0          0.0          0.0          0.0          0.0
Have a mortgage_1 ~)          0.0          0.0          0.0          0.0          0.0          0.0
Have a mortgage_2 ~)          0.0          0.0          0.0          0.0          0.0          0.0
--------------------------------------------------------------------------------------------------
Observations              110,444       16,467       20,719       22,202       24,080       26,976
--------------------------------------------------------------------------------------------------

. 
. ***********************************************
. ***Table 2. Table of Mortgages
. ***********************************************
. use "${r_output}\b14_hse_mortgage",clear

. 
. *all of the mortgages are those active during survey period. 
. forvalues i = 1/2 {
  2. sum mrtg_`i'_debt mrtg_`i'_debt_todt mrtg_`i'_repay if mrtg_`i'_borrow > 0,de 
  3. }

                         mrtg_1_debt
-------------------------------------------------------------
      Percentiles      Smallest
 1%         8575              0
 5%        25000              0
10%        41000              0       Obs               4,190
25%       117000              0       Sum of Wgt.       4,190

50%       305155                      Mean           616100.5
                        Largest       Std. Dev.        932891
75%       735000       1.08e+07
90%      1501600       1.14e+07       Variance       8.70e+11
95%      2249800       1.18e+07       Skewness       4.515652
99%      4376916       1.28e+07       Kurtosis       35.97414

                      mrtg_1_debt_todt
-------------------------------------------------------------
      Percentiles      Smallest
 1%         5000              0
 5%        16617              0
10%        30000              0       Obs               4,898
25%        84500              0       Sum of Wgt.       4,898

50%       250000                      Mean           578617.1
                        Largest       Std. Dev.       1075048
75%       650000       1.30e+07
90%      1426000       1.30e+07       Variance       1.16e+12
95%      2159928       1.74e+07       Skewness       8.741708
99%      4716000       3.08e+07       Kurtosis       164.9204

                        mrtg_1_repay
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         3000              0
10%         7500              0       Obs               4,311
25%        21000              0       Sum of Wgt.       4,311

50%        47754                      Mean           83161.35
                        Largest       Std. Dev.      126881.9
75%        94008        1320000
90%       178966        1348000       Variance       1.61e+10
95%       270000        1400000       Skewness       4.866694
99%       660000        1497835       Kurtosis       36.21526

                         mrtg_2_debt
-------------------------------------------------------------
      Percentiles      Smallest
 1%         3810              0
 5%        16706              0
10%        30000              0       Obs               5,349
25%        80500              0       Sum of Wgt.       5,349

50%       233280                      Mean           534175.3
                        Largest       Std. Dev.      896807.6
75%       604167       1.14e+07
90%      1330000       1.18e+07       Variance       8.04e+11
95%      2096460       1.28e+07       Skewness       5.430516
99%      4140000       1.65e+07       Kurtosis       54.52571

                      mrtg_2_debt_todt
-------------------------------------------------------------
      Percentiles      Smallest
 1%         2220              0
 5%        10000              0
10%        18880              0       Obs               6,835
25%        50583              0       Sum of Wgt.       6,835

50%       167674                      Mean           465253.1
                        Largest       Std. Dev.      974753.7
75%       489500       1.30e+07
90%      1180903       1.51e+07       Variance       9.50e+11
95%      1863590       1.74e+07       Skewness       9.466715
99%      4060000       3.08e+07       Kurtosis       188.6786

                        mrtg_2_repay
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%         3600              0       Obs               5,441
25%        15000              0       Sum of Wgt.       5,441

50%        40000                      Mean           74695.41
                        Largest       Std. Dev.      123112.1
75%        84500        1348000
90%       165000        1400000       Variance       1.52e+10
95%       250000        1470000       Skewness       5.127586
99%       647250        1497835       Kurtosis       39.96765

. 
. tab year if mrtg_1_debt_todt == 0 & mrtg_1_borrow > 0

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1997 |          1       11.11       11.11
       2000 |          2       22.22       33.33
       2006 |          1       11.11       44.44
       2009 |          1       11.11       55.56
       2010 |          2       22.22       77.78
       2011 |          1       11.11       88.89
       2012 |          1       11.11      100.00
------------+-----------------------------------
      Total |          9      100.00

. tab year if mrtg_2_debt_todt == 0 & mrtg_2_borrow > 0

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1997 |          1        3.57        3.57
       2000 |          2        7.14       10.71
       2006 |          1        3.57       14.29
       2007 |          1        3.57       17.86
       2008 |          1        3.57       21.43
       2009 |          1        3.57       25.00
       2010 |          2        7.14       32.14
       2011 |          7       25.00       57.14
       2012 |         12       42.86      100.00
------------+-----------------------------------
      Total |         28      100.00

. 
. forvalues i = 1/2 {
  2. count if mrtg_`i'_debt_todt == 0 & mrtg_`i'_borrow > 0 & mrtg_`i'_repay<0
  3. } //though no outstanding value at the date of survey, there's repay.
  0
  0

. 
. /*
> a) value of loan taken at inception (mortgage value) - amount borrowed
> b) Term of loan (calculated) 
> c) Interest rate (given)
> d) Monthly payment (calculate)
> e) Is it subsidized (column 7)
> f) count of mortgages - 100? 200? N. Number of observations 
> g) Who are these people? (i) urban, (ii) hh size, (iii) gender, (iv) age
> */
. 
. replace intst_rate = intst_rate*100*12
(84,996 real changes made)

. 
. label var mrtg_1_borrow "Mortgage Value_1"

. label var mrtg_2_borrow "Mortgage Value_2"

. label var loan_period_1 "Term of Loan_1 (mt)"

. label var loan_period_2 "Term of Loan_2 (mt)"

. label var intst_rate "Interest rate"

. label var repay_mt_1 "Monthly Payment_1"

. label var repay_mt_2 "Monthly Payment_2"

. 
. *create the table 
. global var_tab_2 "intst_rate loan_sub urban hhsize head_female head_age"

. 
. forvalues i = 1990(6)2013 {
  2. local j = `i' + 5 
  3. dis `i' "-"`j'
  4.   forvalues x = 1/2 {
  5.   qui eststo total_`x' : estpost summarize mrtg_`x'_borrow loan_period_`x' repay_mt_`x' $var_tab_2 [aw 
> = hhwgt] if mrtg_`x'_borrow > 0,de
  6.   qui eststo yr_`j'_`x' : estpost summarize mrtg_`x'_borrow loan_period_`x' repay_mt_`x' $var_tab_2 [aw
>  = hhwgt] if inrange(year,`i',`j') & mrtg_`x'_borrow > 0,de
  7.   qui eststo yr_1990_`x' : estpost summarize mrtg_`x'_borrow loan_period_`x' repay_mt_`x' $var_tab_2 [a
> w = hhwgt] if year<1990 & mrtg_`x'_borrow > 0,de
  8.   }
  9. }
1990-1995
1996-2001
2002-2007
2008-2013

. 
. forvalues x = 1/2 {
  2. esttab total_`x' yr_2013_`x' yr_2007_`x' yr_2001_`x' yr_1995_`x' yr_1990_`x', cells(mean(fmt(%9.1fc))) 
> label collabels(none) ///
>  mtitles("All" "2013-2008" "2007-2002" "2001-1996" "1995-1990" "<1990") stats(N, label("Observations") fmt
> (%9.0gc)) ///
>  title("Tabel 2.1 Summary Statistics of Mortgages (mean)_`x'")
  3. }

Tabel 2.1 Summary Statistics of Mortgages (mean)_1
--------------------------------------------------------------------------------------------------
                              (1)          (2)          (3)          (4)          (5)          (6)
                              All    2013-2008    2007-2002    2001-1996    1995-1990        <1990
--------------------------------------------------------------------------------------------------
Mortgage Value_1        600,778.7    624,462.6    580,103.7    369,167.3    180,443.2    155,598.9
Term of Loan_1 (mt)         156.6        151.8        178.0        115.7        116.0        230.3
Monthly Payment_1        10,000.7     10,424.5      9,360.3      7,846.5      3,504.2        555.4
Interest rate                12.4         13.1         10.8         10.2          9.0         11.2
Subsidized (%)               99.5         88.2         94.9         93.8         92.7         94.2
Urban Household (%)          42.0         53.8         79.6         80.3         62.7         87.6
Houshold Size                 4.2          4.4          4.6          4.5          4.2          3.4
Female Household H~)         15.8          8.7          9.8         13.3         12.0          0.0
Household Head Age           45.4         47.9         50.5         53.6         54.7         49.9
--------------------------------------------------------------------------------------------------
Observations               42,025        3,482        1,191          227           38            6
--------------------------------------------------------------------------------------------------

Tabel 2.1 Summary Statistics of Mortgages (mean)_2
--------------------------------------------------------------------------------------------------
                              (1)          (2)          (3)          (4)          (5)          (6)
                              All    2013-2008    2007-2002    2001-1996    1995-1990        <1990
--------------------------------------------------------------------------------------------------
Mortgage Value_2        457,180.0    442,334.9    560,716.6    368,584.3    180,215.3    155,598.9
Term of Loan_2 (mt)         159.6        157.3        176.1        114.8        115.6        230.3
Monthly Payment_2         8,674.1      8,499.2      9,594.3      8,288.8      3,482.0        555.4
Interest rate                13.6         14.3         10.8         10.2          9.0         11.2
Subsidized (%)               98.8         80.5         94.2         93.3         92.8         94.2
Urban Household (%)          42.0         48.6         79.0         79.6         63.2         87.6
Houshold Size                 4.2          4.5          4.6          4.4          4.2          3.4
Female Household H~)         15.8         11.3         10.3         13.1         11.9          0.0
Household Head Age           45.5         47.6         50.6         53.6         54.8         49.9
--------------------------------------------------------------------------------------------------
Observations               43,995        5,327        1,299          242           40            6
--------------------------------------------------------------------------------------------------

. 
. forvalues x = 1/2 {
  2. esttab total_`x' yr_2013_`x' yr_2007_`x' yr_2001_`x' yr_1995_`x' yr_1990_`x', cells(p50(fmt(%9.1fc))) l
> abel collabels(none) ///
>  mtitles("All" "2013-2008" "2007-2002" "2001-1996" "1995-1990" "<1990") stats(N, label("Observations") fmt
> (%9.0gc)) ///
>  title("Tabel 2.1 Summary Statistics of Mortgages (med)_`x'")
  3. }

Tabel 2.1 Summary Statistics of Mortgages (med)_1
--------------------------------------------------------------------------------------------------
                              (1)          (2)          (3)          (4)          (5)          (6)
                              All    2013-2008    2007-2002    2001-1996    1995-1990        <1990
--------------------------------------------------------------------------------------------------
Mortgage Value_1        300,000.0    250,000.0    400,000.0    250,000.0     60,000.0     75,000.0
Term of Loan_1 (mt)         101.9         88.0        135.3         96.4        124.1        204.8
Monthly Payment_1         5,000.0      5,200.0      5,000.0      3,987.5      2,495.8          0.0
Interest rate                11.5         12.0         11.0         10.5          9.5         12.0
Subsidized (%)              100.0        100.0        100.0        100.0        100.0        100.0
Urban Household (%)           0.0        100.0        100.0        100.0        100.0        100.0
Houshold Size                 4.0          4.0          4.0          4.0          4.0          3.0
Female Household H~)          0.0          0.0          0.0          0.0          0.0          0.0
Household Head Age           45.0         46.0         49.0         54.0         56.0         49.0
--------------------------------------------------------------------------------------------------
Observations               42,025        3,482        1,191          227           38            6
--------------------------------------------------------------------------------------------------

Tabel 2.1 Summary Statistics of Mortgages (med)_2
--------------------------------------------------------------------------------------------------
                              (1)          (2)          (3)          (4)          (5)          (6)
                              All    2013-2008    2007-2002    2001-1996    1995-1990        <1990
--------------------------------------------------------------------------------------------------
Mortgage Value_2        150,000.0    140,000.0    400,000.0    250,000.0     60,000.0     75,000.0
Term of Loan_2 (mt)          97.1         86.7        134.7         96.4        124.1        204.8
Monthly Payment_2         3,934.9      3,428.6      5,000.0      3,987.5      2,475.0          0.0
Interest rate                12.0         12.0         11.0         10.5         10.0         12.0
Subsidized (%)              100.0        100.0        100.0        100.0        100.0        100.0
Urban Household (%)           0.0          0.0        100.0        100.0        100.0        100.0
Houshold Size                 4.0          4.0          4.0          4.0          4.0          3.0
Female Household H~)          0.0          0.0          0.0          0.0          0.0          0.0
Household Head Age           45.0         46.0         49.0         54.0         56.0         49.0
--------------------------------------------------------------------------------------------------
Observations               43,995        5,327        1,299          242           40            6
--------------------------------------------------------------------------------------------------

.  
. log close
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\03_Import NSS7
> 0_housing_mortgage.log
  log type:  text
 closed on:  10 Nov 2020, 09:11:26
------------------------------------------------------------------------------------------------------------
