------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\03_Import NSS70_housing_mortgage.log
  log type:  text
 opened on:  15 Nov 2020, 04:51:50

. 
. use "${r_input}\Visit 1_Block 14",clear

. drop if b14_q1 == "99" //drop the total amount
(73,266 observations deleted)

. 
. *debt, borrowed amount, repay amount.
. gen debt = b14_q17 //outstanding amout at end of June 2012
(47,671 missing values generated)

. gen debt_todt = b14_q16 //outstanding amout at the date of survey
(1,688 missing values generated)

. gen borrow = b14_q5 //original borrowed amount
(1 missing value generated)

. gen repay = b14_q14 //amount (`) repaid (including interest) during 01.07.2012 to date of survey
(43,996 missing values generated)

. 
. 
. *** Two housing mortgage definitions 
. tab b14_q12

    Type of |
   security |      Freq.     Percent        Cum.
------------+-----------------------------------
         01 |      6,806        6.16        6.16
         02 |      1,577        1.43        7.59
         03 |      4,251        3.85       11.44
         04 |     15,648       14.17       25.61
         05 |      9,400        8.51       34.12
         06 |      1,018        0.92       35.04
         07 |        304        0.28       35.32
         08 |      2,121        1.92       37.24
         09 |      4,111        3.72       40.96
         10 |     65,201       59.04      100.00
------------+-----------------------------------
      Total |    110,437      100.00

. gen secure_type = b14_q12
(6 missing values generated)

. 
. tab b14_q11

 Purpose of |
       loan |      Freq.     Percent        Cum.
------------+-----------------------------------
         01 |      6,886        6.24        6.24
         02 |     13,660       12.37       18.60
         03 |      6,167        5.58       24.19
         04 |      4,227        3.83       28.02
         05 |         66        0.06       28.08
         06 |      1,876        1.70       29.77
         07 |        200        0.18       29.95
         08 |      3,707        3.36       33.31
         09 |      7,998        7.24       40.55
         10 |     10,068        9.12       49.67
         11 |     17,313       15.68       65.35
         12 |     38,271       34.65      100.00
------------+-----------------------------------
      Total |    110,439      100.00

. gen loan_purpose = b14_q11
(4 missing values generated)

. 
. * (A) Conservative (let's label 1)housing loan with immovable property as secure type: B14_Q11 == 11 & (B14_Q12 == 3 | B14_Q12 == 
> 4)
. gen mrtg_1_dm = (loan_purpose == "11" & (secure_type == "04"|secure_type == "03"))

. 
. * (B) Less conservative (let's label 2) housing loan with mortgage: B14_Q11 == 11 & B14_13 != 4
. gen mrtg_2_dm = (loan_purpose == "11" & (b14_q13 != "4"& b14_q13 != ""))

. 
. *** Housing mortgage features 
. *houseing mortgage amount
. forvalues i = 1/2 {
  2.   foreach var in debt debt_todt borrow repay {
  3.   gen mrtg_`i'_`var' = mrtg_`i'_dm*`var'
  4.   }
  5. }
(47,671 missing values generated)
(1,688 missing values generated)
(1 missing value generated)
(43,996 missing values generated)
(47,671 missing values generated)
(1,688 missing values generated)
(1 missing value generated)
(43,996 missing values generated)

. 
. *aggregate at household level. 
. egen double debt_total = sum(debt),by(HHID)

. egen double borrow_total = sum(borrow),by(HHID)

. drop debt borrow

. 
. *** Other laon features
. tab b14_q3 [aw = Weight_SS]

    Date of |
borrowing - |
       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1972 | .068661433        0.00        0.00
       1973 | .166560667        0.00        0.00
       1975 | .258793759        0.00        0.00
       1978 | .172179566        0.00        0.00
       1979 |  .37915914        0.00        0.00
       1980 |  .42355915        0.00        0.00
       1981 | .109710261        0.00        0.00
       1982 | .206973275        0.00        0.00
       1983 | .487978062        0.00        0.00
       1984 | 5.39291459        0.00        0.01
       1985 | 4.92282315        0.00        0.01
       1986 | .921260049        0.00        0.01
       1987 | 2.81837543        0.00        0.01
       1988 | 4.37699311        0.00        0.02
       1989 | 11.2401726        0.01        0.03
       1990 | 12.1221539        0.01        0.04
       1991 | 1.90042562        0.00        0.04
       1992 | 24.9979048        0.02        0.06
       1993 | 22.4553342        0.02        0.08
       1994 | 22.8229468        0.02        0.11
       1995 | 32.7070057        0.03        0.13
       1996 | 35.8474002        0.03        0.17
       1997 |32.74288922        0.03        0.20
       1998 | 112.428431        0.10        0.30
       1999 | 89.8188925        0.08        0.38
       2000 | 217.964276        0.20        0.58
       2001 |  193.72347        0.18        0.75
       2002 | 270.489796        0.24        1.00
       2003 | 326.364678        0.30        1.29
       2004 |472.6414318        0.43        1.72
       2005 | 777.277254        0.70        2.43
       2006 | 1,064.5175        0.96        3.39
       2007 | 1,608.6038        1.46        4.85
       2008 | 2,797.3929        2.53        7.38
       2009 | 4,171.3465        3.78       11.16
       2010 | 8,215.2498        7.44       18.59
       2011 |  15,592.81       14.12       32.71
       2012 | 54,426.567       49.28       82.00
       2013 | 19,884.262       18.00      100.00
------------+-----------------------------------
      Total |    110,439      100.00

. tab b14_q2 [aw = Weight_SS]

    Date of |
borrowing - |
      month |      Freq.     Percent        Cum.
------------+-----------------------------------
         01 |  11,816.98       10.70       10.70
         02 | 10,230.102        9.26       19.96
         03 | 10,607.117        9.61       29.57
         04 | 12,278.078       11.12       40.69
         05 | 11,572.801       10.48       51.17
         06 | 11,191.734       10.13       61.30
         07 |8,320.24461        7.53       68.84
         08 | 9,180.2643        8.31       77.15
         09 | 5,802.3886        5.25       82.40
         10 | 6,636.2567        6.01       88.41
         11 | 6,369.0017        5.77       94.18
         12 | 6,428.0317        5.82      100.00
------------+-----------------------------------
      Total |    110,433      100.00

. 
. *interest rate and type
. gen intst_rate = b14_q10/100/12
(539 missing values generated)

. gen intst_type = b14_q9
(34 missing values generated)

. sum intst_rate [aw = Weight_SS],de

                         intst_rate
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs             109,904
25%         .005              0       Sum of Wgt.   349416471

50%          .01                      Mean           .0152051
                        Largest       Std. Dev.      .0195639
75%          .02             .2
90%          .03             .2       Variance       .0003827
95%          .05              1       Skewness       71.32512
99%           .1            4.5       Kurtosis       16004.17

. replace intst_rate  = . if intst_rate > r(p95)
(1,481 real changes made, 1,481 to missing)

. 
. *loan borrowing date. 
. gen month = real(b14_q2)
(10 missing values generated)

. gen year = b14_q3
(4 missing values generated)

. 
. gen date_loan = ym(year,month)
(10 missing values generated)

. format date_loan %tmMCY

. 
. merge m:1 HHID using "${root}\Data Output Files\NSS70_All.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                        37,081
        from master                         0  (_merge==1)
        from using                     37,081  (_merge==2)

    matched                           110,443  (_merge==3)
    -----------------------------------------

. gen loan_age = date_survey - date_loan //laon from borrow to date of survey, in month.
(37,091 missing values generated)

. replace loan_age = . if loan_age < 0 
(198 real changes made, 198 to missing)

. 
. sum loan_age [aw = Weight_SS],de

                          loan_age
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            1              0
10%            2              0       Obs             110,235
25%            5              0       Sum of Wgt.   350170108

50%           11                      Mean           18.56219
                        Largest       Std. Dev.      24.56695
75%           23            421
90%           44            457       Variance       603.5353
95%           63            476       Skewness        3.76297
99%          123            491       Kurtosis       25.40451

. replace loan_age  = . if loan_age > r(p99)
(1,477 real changes made, 1,477 to missing)

. 
. *household feature
. replace urban = urban*100 
(64,079 real changes made)

. 
. *monthly payment. 
. gen date_temp = ym(2012,7)

. gen pay_mt = date_survey - date_temp

. drop date_temp

. tab pay_mt 

     pay_mt |      Freq.     Percent        Cum.
------------+-----------------------------------
          6 |     18,053       12.24       12.24
          7 |     22,264       15.09       27.33
          8 |     23,828       16.15       43.48
          9 |     20,417       13.84       57.32
         10 |     23,984       16.26       73.58
         11 |     22,178       15.03       88.61
         12 |     16,624       11.27       99.88
         13 |        130        0.09       99.97
         14 |         18        0.01       99.98
         15 |         28        0.02      100.00
------------+-----------------------------------
      Total |    147,524      100.00

. 
. gen repay_mt = pay_mt

. 
. forvalues i=1/2  {
  2. gen double repay_mt_`i' = mrtg_`i'_repay/pay_mt
  3. }
(81,077 missing values generated)
(81,077 missing values generated)

. 
. sum repay_mt*

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    repay_mt |    147,524    8.976106    1.915224          6         15
  repay_mt_1 |     66,447    621.9818    4556.211          0   249639.2
  repay_mt_2 |     66,447    708.7756    4940.214          0   249639.2

. 
. *loan period estimation 
. forvalues i = 1/2 {
  2. gen double loan_period_`i'= - ln(1 - mrtg_`i'_borrow *intst_rate * (1/repay_mt_`i')) / ln(1+ intst_rate)
  3. sum loan_period_`i' [aw = Weight_SS],de
  4. replace loan_period_`i' = . if loan_period_`i' > r(p99)
  5. }
(144,269 missing values generated)

                        loan_period_1
-------------------------------------------------------------
      Percentiles      Smallest
 1%      7.53366       2.339866
 5%     15.58093       2.729418
10%     26.20565       3.229259       Obs               3,255
25%     53.33976        3.26585       Sum of Wgt.   8,081,192

50%     102.8545                      Mean           163.7759
                        Largest       Std. Dev.      272.9406
75%     179.0596       2307.234
90%     264.3022       3532.073       Variance       74496.56
95%      371.063       3532.073       Skewness        5.84224
99%      1770.43       3813.385       Kurtosis       46.18742
(11 real changes made, 11 to missing)
(143,571 missing values generated)

                        loan_period_2
-------------------------------------------------------------
      Percentiles      Smallest
 1%      6.69942       2.339866
 5%     11.78581       2.729418
10%     22.08141       3.050778       Obs               3,953
25%     48.85596       3.229259       Sum of Wgt.   9,947,052

50%     97.10983                      Mean           170.1287
                        Largest       Std. Dev.      296.2969
75%     174.4078       2357.645
90%     272.3213       3532.073       Variance       87791.83
95%     450.2782       3532.073       Skewness       5.077065
99%      1770.43       3813.385       Kurtosis       34.51334
(17 real changes made, 17 to missing)

. 
. sum loan_period_*

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
loan_perio~1 |      3,244    145.3515    193.6086   2.339866    1770.43
loan_perio~2 |      3,936    145.2648    212.1959   2.339866    1770.43

. 
. *the loan is subsidized 
. gen loan_sub = (b14_q7 != "09")*100 

. 
. *label variables
. label var urban "Urban Household (%)"

. label var hhsize "Houshold Size"

. label var head_age "Household Head Age"

. label var head_female "Female Household Head (%)"

. label var loan_sub "Subsidized (%)"

. 
. save "${r_output}\b14_hse_mortgage",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Data Output Files\b14_hse_mortgage.dta saved

. 
. ***********************************************
. ***Table 1. Homewoners
. ***********************************************
. use "${r_output}\b14_hse_mortgage",clear

. 
. //keep if building_dwelling > 0 //only focus on home owner.
. 
. foreach type in mrtg_1_dm mrtg_2_dm mrtg_1_debt mrtg_2_debt mrtg_1_borrow mrtg_2_borrow mrtg_1_repay mrtg_2_repay{ 
  2. egen double total_`type' = sum(`type'), by(HHID)
  3. } 

. //keep HHID total* real_estate wealth asset debt_total hhwgt building_dwelling_area
. bys HHID: keep if _n == 1 // keep only one observation for each HH
(36,724 observations deleted)

. 
. foreach var in total_mrtg_1_dm total_mrtg_2_dm total_mrtg_1_debt total_mrtg_2_debt total_mrtg_1_borrow total_mrtg_2_borrow total_m
> rtg_1_repay total_mrtg_2_repay { //only focusing on real estate owner. 
  2. replace `var' = 0 if mi(`var') 
  3. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. 
. /* Table Content:
> a. Value of Residential Real Estate where HH is Dwelling
> b. Value of Land Associated with #a
> c. Value of Building with #a
> d. Size in square of feet of building of #a
> e. Total assets of these people (median median) //using as quintile. 
> f. Percent of assets of residential RE in total assets 
> g) Who are these people? (i) urban, (ii) hh size, (iii) gender, (iv) age
> h. How many (%) of these had a mortgage (paid off) /Mortgage holders
> */
. 
. *Variables to generate
. replace building_dwelling_area = building_dwelling_area*10.76 //change unit from sq me to sq ft
variable building_dwelling_area was int now float
(91,985 real changes made)

. 
. gen real_estate_share = real_estate/asset*100 //f. Percent of assets of residential RE in total assets 
(1,198 missing values generated)

. 
. forvalues i=1/2  {
  2. gen total_mrtg_`i' = (total_mrtg_`i'_dm > 0)*100 //h. How many (%) of these had a mortgage (paid off)
  3. }

. 
. forvalues i=1/2  {
  2. gen total_mrtg_`i'_debt_dm = (total_mrtg_`i'_debt > 0)*100 //i. how many (%) of these _have_ a mortgage (not paid off)
  3. }

. 
. *label the key variables
. label var real_estate "Value of Residential Real Estate where HH is Dwelling"

. label var land_resid "Value of Land Associated"
variable land_resid not found
r(111);

end of do-file

r(111);

. do "C:\Users\wb500886\AppData\Local\Temp\STD268_000000.tmp"

. ****************************************************************************
. * Description: Import NSS70 from Raw Files and save dta to Output Folder
. * Date: Nov 11, 2020
. * Version 2
. * Last Editor: Aline
. ****************************************************************************
. 
. ****************************************************************************
. clear 

. clear matrix

. ****************************************************************************
. 
. ****************************************************************************
. * Determine Whose Machine is running the code and set the global directory
. ****************************************************************************
. if "`c(username)'" == "wb308830" local pc = 0

. if "`c(username)'" != "wb308830" local pc = 1

. if `pc' == 0 global root "C:\Users\wb308830\OneDrive - WBG\Documents\TN\Data\NSS 70"

. if `pc' != 0 global root "C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70"

. 
. di "$root"
C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70

. global r_input "${root}\Raw Data & Dictionaries"

. di "${r_input}"
C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Raw Data & Dictionaries

. global r_output "${root}\Data Output Files"

. 
. ****************************************************************************
. *gen date of survey 
. use "${r_input}\Visit 1_Block 1&2_Identification of sample household and particulars of field operations.dta",cl
> ear

. gen month = real(substr(Survey_Date,3,2))

. gen year = 2013 //there's 2017 and 2019 should be mistake

. 
. gen date_survey = ym(year,month)

. format date_survey %tmMCY

. 
. keep HHID date_survey

. save "${r_output}\b2",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Data Output Files\b2.dta saved

. 
. 
. *gen id, wgt (hhwgt, popwgt) b3
. use "${r_input}\Visit 1_Block 3_Household Characteristics.dta",clear

. 
. rename (b3q1 Sector) (hhsize sector)

. //gen hhwgt = MLT 
. gen hhwgt = Weight_SS 

. 
. destring(hhsize),replace
hhsize: all characters numeric; replaced as byte

. gen pwgt = hhwgt * hhsize

. 
. destring(sector), replace
sector: all characters numeric; replaced as byte

. gen urban = sector - 1

. keep HHID hhwgt pwgt hhsize sector urban Weight_SS Weight_SC

. save "${r_output}\b3",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Data Output Files\b3.dta saved

. 
. *gender from b4 (4)
. use "${r_input}\Visit 1 _Block 4_Demographic and other particulars of household members.dta",clear

. *Keep head 
. keep if b4q1 == "01" // keep heads only 
(408,795 observations deleted)

. ren b4q5 head_age 

. 
. ren  b4q4 head_gender 

. destring head_gender, replace
head_gender: all characters numeric; replaced as byte

. label define gender 1 "Male" 2 "Female"

. label values head_gender gender 

. gen head_female = (head_gender == 2)*100

. 
. keep HHID head_age head_gender head_female

. save "${r_output}\b4",replace 
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Data Output Files\b4.dta saved

. 
. *Asset non_finï¼š land from b5.1 & b5.2 (rural & urban) srl 99
. use "${r_input}\Visit 1_Block 5pt1_Details of land owned by the household as on 30.06.12.dta",clear

. sum b5_1_6

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      b5_1_6 |    223,958    630116.4     2835074          0   2.49e+08

. rename State state

. 
. egen double land_r = sum(b5_1_6*(b5_1_1 == "99")), by(HHID)

. egen double land_r_man = sum(b5_1_6*(b5_1_1 != "99")), by(HHID)

. egen double land_r_resid = sum(b5_1_6*(b5_1_1 != "99")*( b5_1_3 == "10")), by(HHID)

. duplicates drop HHID, force

Duplicates in terms of HHID

(156,468 observations deleted)

. 
. *Check the manual (man) sum with survey sum
. count if land_r > land_r_man
  0

. count if land_r < land_r_man
  15

. 
. drop land_r

. rename land_r_man land_r 

. 
. keep HHID land_r land_r_resid

. save "${r_output}\b5_1",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Data Output Files\b5_1.dta saved

. 
. use "${r_input}\Visit 1_Block 5pt2_Details of land owned by the household as on 30.06.12.dta",clear

. count if b5_2_6 < 0
  2

. replace b5_2_6 = . if b5_2_6 < 0
(2 real changes made, 2 to missing)

. 
. egen double land_u = sum(b5_2_6*(b5_2_1 == "99")), by(HHID)

. egen double land_u_man = sum(b5_2_6*(b5_2_1 != "99")), by(HHID)

. egen double land_u_resid = sum(b5_2_6*(b5_2_1 != "99")*( b5_2_3 == "10")), by(HHID)

. 
. duplicates drop HHID, force

Duplicates in terms of HHID

(41,892 observations deleted)

. 
. *Check the manual (man) sum with survey sum
. count if land_u > land_u_man
  0

. count if land_u < land_u_man
  16

. 
. drop land_u

. rename land_u_man land_u

. 
. keep HHID land_u land_u_resid

. save "${r_output}\b5_2",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Data Output Files\b5_2.dta saved

. 
. 
. 
. *Asset non_fin: building and constructions b6 srl 11
. use "${r_input}\Visit 1_Block 6_Buildings and other constructions owned by the household as on 30.06.2012.dta",c
> lear

. sum b6_q6

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       b6_q6 |    244,737    479786.6     8839515          0   1.85e+09

. 
. egen double building_all = sum(b6_q6*(b6_q3 == "11")), by(HHID)

. egen double building_all_man = sum(b6_q6*(b6_q3 != "11")),  by(HHID)

. 
. egen double building_resid = sum(b6_q6*(inlist(b6_q3,"01","02","03"))), by(HHID)

. egen double building_resid_area = sum(b6_q5*(inlist(b6_q3,"01","02","03"))), by(HHID)

. 
. egen double building_dwelling = sum(b6_q6*(b6_q3 == "01")), by(HHID)

. egen double building_dwelling_area = sum(b6_q5*(b6_q3 == "01")), by(HHID)

. 
. duplicates drop HHID,  force

Duplicates in terms of HHID

(149,298 observations deleted)

. 
. keep HHID building_all* building_resid building_resid_area building_dwelling building_dwelling_area

. 
. *Check the manual (man) sum with survey sum
. count if building_resid > building_all
  2

. count if building_resid > building_all_man
  0

. 
. drop building_all

. ren building_all_man building_all 

. 
. save "${r_output}\b6",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Data Output Files\b6.dta saved

. 
. *Asset non_fin: livestock and poultry b7 srl 22 
. use "${r_input}\Visit 1_Block 7_Livestock and poultry owned by the household on 30.06.2012.dta",clear

. destring b7_q2,replace
b7_q2: all characters numeric; replaced as byte

. sum b7_q5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       b7_q5 |    176,881    23115.77    42294.12          0    2590000

. 
. egen double livestock = sum(b7_q5*(b7_q2 == 22)), by(HHID)

. egen double livestock_man = sum(b7_q5*(inrange(b7_q2,17,21))), by(HHID)

. duplicates drop HHID, force

Duplicates in terms of HHID

(132,557 observations deleted)

. 
. *Check the manual (man) sum with survey sum
. count if livestock > livestock_man
  0

. count if livestock < livestock_man
  14

. 
. drop livestock

. rename livestock_man livestock

. 
. keep HHID livestock

. save "${r_output}\b7",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Data Output Files\b7.dta saved

. 
. *Asset non_fin: transport equipment b8: srl 8
. use "${r_input}\Visit 1_Block 8_Transport equipment owned by the household on 30.06.2012.dta",clear

. sum b8_q5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       b8_q5 |    166,428    64309.42      250881          0   2.07e+07

. 
. egen double trspt = sum(b8_q5*(b8_q2 == "08")), by(HHID)

. egen double trspt_man = sum(b8_q5*(b8_q2 != "08")), by(HHID)

. duplicates drop HHID, force

Duplicates in terms of HHID

(94,706 observations deleted)

. 
. *Check the manual (man) sum with survey sum
. count if trspt > trspt_man
  0

. count if trspt < trspt_man
  9

. 
. drop trspt

. rename trspt_man trspt

. 
. keep HHID trspt

. save "${r_output}\b8",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Data Output Files\b8.dta saved

. 
. *Asset non_fin: agricultural machinery and implements b9: srl 8 
. use "${r_input}\Visit 1_Block 9_Agricultural machinery and implements owned by the household on 30.06.2012.dta",
> clear

. sum b9_q4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       b9_q4 |    120,458    7046.966    42346.08         10    7700000

. 
. egen double agri = sum(b9_q4*(b9_q2 == "8")), by(HHID)

. egen double agri_man = sum(b9_q4*(b9_q2 != "8")), by(HHID)

. duplicates drop HHID, force

Duplicates in terms of HHID

(72,196 observations deleted)

. 
. *Check the manual (man) sum with survey sum
. count if agri > agri_man
  0

. count if agri < agri_man
  2

. 
. drop agri

. rename agri_man agri

. 
. keep HHID agri

. save "${r_output}\b9",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Data Output Files\b9.dta saved

. 
. *Asset non_fin: non-farm business equipment b10 srl 15
. use "${r_input}\Visit 1_Block 10_Non-farm business equipment owned by the household as on 30.06.2012.dta",clear

. destring b10_q2,replace
b10_q2: all characters numeric; replaced as byte

. sum b10_q3 //issue with raw-data.

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      b10_q3 |        119           0           0          0          0

. 
. egen double non_farm = sum(b10_q3*(b10_q2 == 15)), by(HHID)

. egen double non_farm_man = sum(b10_q3*inrange(b10_q2,12,14)), by(HHID)

. duplicates drop HHID, force

Duplicates in terms of HHID

(60,778 observations deleted)

. 
. *Check the manual (man) sum with survey sum
. count if non_farm > non_farm_man
  0

. count if non_farm < non_farm_man
  0

. 
. drop non_farm_man

. keep HHID non_farm

. save "${r_output}\b10",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Data Output Files\b10.dta saved

. 
. *Asset fin: shares & debentures b11 
. use "${r_input}\Visit 1_Block 11_ Shares and debentures owned by the household in co-operative  societies & comp
> anies as on 30.06.2012 .dta",clear

. 
.  *Check the manual (man) sum with survey sum
.   preserve

.   egen double shares = sum(b11_q6*(b11_q1 == "5")), by(HHID)

.   egen double shares_man = sum(b11_q6*(b11_q1 != "5")), by(HHID)

.   duplicates drop HHID, force

Duplicates in terms of HHID

(3,949 observations deleted)

.   count if shares > shares_man
  0

.   count if shares < shares_man
  0

.   restore 

. 
. sum b11_q6 if b11_q1 != "5" 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      b11_q6 |      3,931    44989.44    324279.8     -50000   1.00e+07

. replace b11_q6 = . if b11_q6<0 //filter out the non-negative colums. 
(23 real changes made, 23 to missing)

. egen double shares = sum(b11_q6*(b11_q1 == "5")), by(HHID)

. duplicates drop HHID, force

Duplicates in terms of HHID

(3,949 observations deleted)

. 
. keep HHID shares

. save "${r_output}\b11",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Data Output Files\b11.dta saved

. 
. *Asset fin: other financial assets b12 srl 11 
. use "${r_input}\Visit 1_Block 12_Financial assets other than shares and debentures owned by the household as on 
> 30.06.2012.dta",clear

. 
. destring b12_q1,replace
b12_q1: all characters numeric; replaced as byte

. count if b12_q3 < 0 
  1

. replace b12_q3 = . if b12_q3 <0
(1 real change made, 1 to missing)

. 
. egen double gold = sum(b12_q3*(b12_q1 == 12)), by(HHID)

. egen double fin_retire = sum(b12_q3*(inlist(b12_q1,6,7))), by(HHID) //retirement account

. egen double fin_other = sum(b12_q3*(inrange(b12_q1,1,5) )), by(HHID)

. 
. duplicates drop HHID, force

Duplicates in terms of HHID

(265,456 observations deleted)

.   
.   /*
> drop fin_other 
> ren fin_other_man fin_other
> */
. 
. keep HHID fin_other gold fin_retire

. save "${r_output}\b12",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Data Output Files\b12.dta saved

. 
. *Asset fin: amount receivable b13 (mortgage srl 1, total srl 7)
. use "${r_input}\Visit 1_Block 13_Amount receivable by the household against different heads as on 30.06.2012.dta
> ",clear

. sum b13_q4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      b13_q4 |     13,807    63848.05    419515.8          0   2.00e+07

. 
. egen double fin_rec = sum(b13_q4*(b13_q2 == "7")), by(HHID)

. egen double fin_rec_man = sum(b13_q4*(b13_q2 != "7")), by(HHID)

. duplicates drop HHID, force

Duplicates in terms of HHID

(7,033 observations deleted)

. 
.   *Check the manual (man) sum with survey sum
.   count if fin_rec > fin_rec_man
  0

.   count if fin_rec < fin_rec_man
  2

.  
. drop fin_rec

. ren fin_rec_man fin_rec

. keep HHID fin_rec

. save "${r_output}\b13",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Data Output Files\b13.dta saved

. 
. *Debt: cash loands payable b14: Type of loan(8) Purpose of loan (11) Type of mortgage(13) , srl 99 (total)
. use "${r_input}\Visit 1_Block 14",clear

.  
.  *debt 
. gen debt = b14_q17 // 17 is the outstanding amount on 30.06.2012
(74,953 missing values generated)

. gen debt_todt = b14_q16 //outstanding amount at the date of survey. 
(2,415 missing values generated)

. sum debt,de

                            debt
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         4200              0
10%         7420              0       Obs             108,756
25%        17990              0       Sum of Wgt.     108,756

50%        48800                      Mean           169114.3
                        Largest       Std. Dev.      931886.7
75%       140000       4.00e+07
90%       371695       4.00e+07       Variance       8.68e+11
95%       638480       1.83e+08       Skewness       142.1036
99%      1900207       1.83e+08       Kurtosis       27330.57

. 
. gen temp_debt =  (b14_q1 == "99")*debt
(74,953 missing values generated)

. egen double total_debt = sum(temp_debt), by(HHID)

. drop temp_debt

. 
. gen temp_debt =  (b14_q1 != "99")*debt_todt
(2,415 missing values generated)

. egen double total_debt_m = sum(temp_debt),by(HHID)

. drop temp_debt

. 
. gen temp_debt_todt =  (b14_q1 == "99")*debt_todt
(2,415 missing values generated)

. egen double total_debt_todt = sum(temp_debt_todt), by(HHID)

. drop temp_debt_todt

. 
. gen temp_debt_todt = (b14_q1 == "99")*debt_todt //to date of survey the total debt. 
(2,415 missing values generated)

. egen double total_debt_todt_m = sum(temp_debt_todt), by(HHID)

. drop temp_debt_todt

. 
.  *check the manual total and the survey total
. count if total_debt > total_debt_m
  57,103

. count if total_debt < total_debt_m // manual has 568 observations where it is larger 
  92,115

. 
. tab b14_q1

 Serial no. |      Freq.     Percent        Cum.
------------+-----------------------------------
         01 |     73,719       40.13       40.13
         02 |     21,945       11.95       52.07
         03 |      8,024        4.37       56.44
         04 |      3,600        1.96       58.40
         05 |      1,514        0.82       59.23
         06 |        705        0.38       59.61
         07 |        380        0.21       59.82
         08 |        212        0.12       59.93
         09 |        117        0.06       59.99
         10 |         73        0.04       60.03
         11 |         45        0.02       60.06
         12 |         33        0.02       60.08
         13 |         19        0.01       60.09
         14 |         13        0.01       60.09
         15 |         11        0.01       60.10
         16 |         10        0.01       60.11
         17 |          8        0.00       60.11
         18 |          4        0.00       60.11
         19 |          3        0.00       60.11
         20 |          3        0.00       60.12
         21 |          1        0.00       60.12
         22 |          1        0.00       60.12
         23 |          1        0.00       60.12
         24 |          1        0.00       60.12
         25 |          1        0.00       60.12
         99 |     73,266       39.88      100.00
------------+-----------------------------------
      Total |    183,709      100.00

. sort HHID

. br HHID b14* if total_debt == total_debt_m //there are hosueholds with no total liability coded.  

. //need to use the 99 total and not the manual to match the paper 
. 
.  *generate type of liabilty
. gen gold_loan = (b14_q12 == "05")*debt
(74,953 missing values generated)

. gen oth_secure_loan = (inlist(b14_q12,"01","02","06","07","08","09"))*debt
(74,953 missing values generated)

. gen mrtg_loan = (inlist(b14_q12,"03","04"))*debt
(74,953 missing values generated)

. 
. gen unsecure_loan = (b14_q12 == "10")*debt
(74,953 missing values generated)

. egen double secure_loan = rowtotal(mrtg_loan gold_loan oth_secure_loan) 

. 
.  *collapse at household level. 
. foreach type in secure_loan mrtg_loan gold_loan oth_secure_loan unsecure_loan { 
  2. egen double total_`type' = sum(`type'), by(HHID)
  3. } 

. 
. keep HHID total*

. bys HHID: keep if _n == 1 // keep only one observation for each HH
(109,989 observations deleted)

. 
. mdesc total*

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
     total_debt |           0         73,720           0.00
   total_debt_m |           0         73,720           0.00
   total_debt~t |           0         73,720           0.00
   total_d~dt_m |           0         73,720           0.00
   total_secu~n |           0         73,720           0.00
   total_mrtg~n |           0         73,720           0.00
   total_gold~n |           0         73,720           0.00
   total_oth_~n |           0         73,720           0.00
   total_unse~n |           0         73,720           0.00
----------------+-----------------------------------------------

. 
. save "${r_output}\b14",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Data Output Files\b14.dta saved

. 
. *Debt: kind of loan payable b15 col 11: housing 11
. use "${r_input}\Visit 1_Block 15_kind loans payable by the household.dta",replace

. save "${r_output}\b15",replace //late housing info
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Data Output Files\b15.dta saved

. 
. 
. *******merge to master data******************************
. use "${r_output}\b2",clear

. local flist "b3 b14 b13 b12 b11 b10 b9 b8 b7 b6 b5_1 b5_2 b4"

. 
. foreach f of local flist{
  2. merge 1:1 HHID using "${r_output}/`f'"
  3. drop _merge
  4. }

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           110,800  (_merge==3)
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                        37,080
        from master                    37,080  (_merge==1)
        from using                          0  (_merge==2)

    matched                            73,720  (_merge==3)
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                       104,025
        from master                   104,025  (_merge==1)
        from using                          0  (_merge==2)

    matched                             6,775  (_merge==3)
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                         9,388
        from master                     9,388  (_merge==1)
        from using                          0  (_merge==2)

    matched                           101,412  (_merge==3)
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                       106,964
        from master                   106,964  (_merge==1)
        from using                          0  (_merge==2)

    matched                             3,836  (_merge==3)
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                        86,248
        from master                    86,248  (_merge==1)
        from using                          0  (_merge==2)

    matched                            24,552  (_merge==3)
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                        62,530
        from master                    62,530  (_merge==1)
        from using                          0  (_merge==2)

    matched                            48,270  (_merge==3)
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                        39,051
        from master                    39,051  (_merge==1)
        from using                          0  (_merge==2)

    matched                            71,749  (_merge==3)
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,393
        from master                    66,393  (_merge==1)
        from using                          0  (_merge==2)

    matched                            44,407  (_merge==3)
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                        15,312
        from master                    15,312  (_merge==1)
        from using                          0  (_merge==2)

    matched                            95,488  (_merge==3)
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                        43,053
        from master                    43,053  (_merge==1)
        from using                          0  (_merge==2)

    matched                            67,747  (_merge==3)
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                        76,583
        from master                    76,583  (_merge==1)
        from using                          0  (_merge==2)

    matched                            34,217  (_merge==3)
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           110,800  (_merge==3)
    -----------------------------------------

. 
. *clean up missing value
. global asset "land_r land_u building_all livestock trspt agri non_farm shares fin_other fin_retire gold fin_rec 
> building_resid building_dwelling land_r_resid land_u_resid"

. global debt "total_debt total_debt_m total_debt_todt total_debt_todt_m total_secure_loan total_mrtg_loan total_g
> old_loan total_oth_secure_loan total_unsecure_loan"

. 
. mdesc $asset 

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
         land_r |      43,053        110,800          38.86
         land_u |      76,583        110,800          69.12
   building_all |      15,312        110,800          13.82
      livestock |      66,393        110,800          59.92
          trspt |      39,051        110,800          35.24
           agri |      62,530        110,800          56.44
       non_farm |      86,248        110,800          77.84
         shares |     106,964        110,800          96.54
      fin_other |       9,388        110,800           8.47
     fin_retire |       9,388        110,800           8.47
           gold |       9,388        110,800           8.47
        fin_rec |     104,025        110,800          93.89
   building_r~d |      15,312        110,800          13.82
   building_d~g |      15,312        110,800          13.82
   land_r_resid |      43,053        110,800          38.86
   land_u_resid |      76,583        110,800          69.12
----------------+-----------------------------------------------

. mdesc $debt 

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
     total_debt |      37,080        110,800          33.47
   total_debt_m |      37,080        110,800          33.47
   total_debt~t |      37,080        110,800          33.47
   total_d~dt_m |      37,080        110,800          33.47
   total_secu~n |      37,080        110,800          33.47
   total_mrtg~n |      37,080        110,800          33.47
   total_gold~n |      37,080        110,800          33.47
   total_oth_~n |      37,080        110,800          33.47
   total_unse~n |      37,080        110,800          33.47
----------------+-----------------------------------------------

. 
. foreach var in $asset $debt {
  2. replace `var' = 0 if mi(`var')
  3. }
(43,053 real changes made)
(76,583 real changes made)
(15,312 real changes made)
(66,393 real changes made)
(39,051 real changes made)
(62,530 real changes made)
(86,248 real changes made)
(106,964 real changes made)
(9,388 real changes made)
(9,388 real changes made)
(9,388 real changes made)
(104,025 real changes made)
(15,312 real changes made)
(15,312 real changes made)
(43,053 real changes made)
(76,583 real changes made)
(37,080 real changes made)
(37,080 real changes made)
(37,080 real changes made)
(37,080 real changes made)
(37,080 real changes made)
(37,080 real changes made)
(37,080 real changes made)
(37,080 real changes made)
(37,080 real changes made)

. 
. *generate asset value by type
. egen double asset = rowtotal(land_r land_u building_all livestock trspt agri non_farm shares fin_other fin_retir
> e gold fin_rec) 

. 
. egen double durable_other = rowtotal(livestock trspt agri non_farm)

. 
. egen double real_estate = rowtotal(building_all land_r land_u)

. 
. egen double asset_non_fin = rowtotal(real_estate gold durable_other)

. 
. egen double asset_fin = rowtotal(shares fin_other fin_rec) 

. 
. egen double land_resid = rowtotal(land_r_resid land_u_resid)

. 
. *generate wealth data
. gen double wealth = asset - total_debt

. sum wealth,de

                           wealth
-------------------------------------------------------------
      Percentiles      Smallest
 1%       -69900      -8.15e+07
 5%       8797.5      -3.91e+07
10%        50100       -9320388       Obs             110,800
25%       184010       -7723959       Sum of Wgt.     110,800

50%       544200                      Mean            1699471
                        Largest       Std. Dev.      1.13e+07
75%      1463800       1.00e+09
90%      3540500       1.45e+09       Variance       1.28e+14
95%      6030593       1.75e+09       Skewness       106.6886
99%     1.68e+07       1.85e+09       Kurtosis       15031.28

. gen double wealth_ln = ln(wealth) //1% negative 
(3,590 missing values generated)

. 
. *house keeping
. mdesc *

    Variable    |     Missing          Total     Percent Missing
----------------+-----------------------------------------------
           HHID |           0        110,800           0.00
    date_survey |           0        110,800           0.00
         sector |           0        110,800           0.00
         hhsize |           0        110,800           0.00
      Weight_SS |           0        110,800           0.00
      Weight_SC |           0        110,800           0.00
          hhwgt |           0        110,800           0.00
           pwgt |           0        110,800           0.00
          urban |           0        110,800           0.00
     total_debt |           0        110,800           0.00
   total_debt_m |           0        110,800           0.00
   total_debt~t |           0        110,800           0.00
   total_d~dt_m |           0        110,800           0.00
   total_secu~n |           0        110,800           0.00
   total_mrtg~n |           0        110,800           0.00
   total_gold~n |           0        110,800           0.00
   total_oth_~n |           0        110,800           0.00
   total_unse~n |           0        110,800           0.00
        fin_rec |           0        110,800           0.00
           gold |           0        110,800           0.00
     fin_retire |           0        110,800           0.00
      fin_other |           0        110,800           0.00
         shares |           0        110,800           0.00
       non_farm |           0        110,800           0.00
           agri |           0        110,800           0.00
          trspt |           0        110,800           0.00
      livestock |           0        110,800           0.00
   building_all |           0        110,800           0.00
   building_r~d |           0        110,800           0.00
   building_r~a |      15,312        110,800          13.82
   building_d~g |           0        110,800           0.00
   building_d~a |      15,312        110,800          13.82
         land_r |           0        110,800           0.00
   land_r_resid |           0        110,800           0.00
         land_u |           0        110,800           0.00
   land_u_resid |           0        110,800           0.00
    head_gender |           0        110,800           0.00
       head_age |           0        110,800           0.00
    head_female |           0        110,800           0.00
          asset |           0        110,800           0.00
   durable_ot~r |           0        110,800           0.00
    real_estate |           0        110,800           0.00
   asset_non_~n |           0        110,800           0.00
      asset_fin |           0        110,800           0.00
     land_resid |           0        110,800           0.00
         wealth |           0        110,800           0.00
      wealth_ln |       3,590        110,800           3.24
----------------+-----------------------------------------------

. 
. qui compress

. save "${r_output}\NSS70_All",replace
file C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Data Output Files\NSS70_All.dta saved

. 
end of do-file

. do "C:\Users\wb500886\AppData\Local\Temp\STD268_000000.tmp"

. ****************************************************************************
. * Description: Generate a summary table of NSS 70, compare to published stats
. * Date: Nov 15, 2020
. * Version 3
. * Last Editor: Aline 
. ****************************************************************************
. 
. ****************************************************************************
. clear 

. clear matrix

. ****************************************************************************
. 
. ****************************************************************************
. * Determine Whose Machine is running the code and set the global directory
. ****************************************************************************
. if "`c(username)'" == "wb308830" local pc = 0

. if "`c(username)'" != "wb308830" local pc = 1

. if `pc' == 0 global root "C:\Users\wb308830\OneDrive - WBG\Documents\TN\Data\NSS 70\"

. if `pc' != 0 global root "C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70"

. if `pc' != 0 global script "C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS"

. 
. di "$root"
C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70

. global r_input "${root}\Raw Data & Dictionaries"

. di "${r_input}"
C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\nss_data\NSS70\Raw Data & Dictionaries

. global r_output "${root}\Data Output Files"

. 
. log using "${script}\02_Table of Means NSS 70.log",replace
log file already open
r(604);

end of do-file

r(604);

. log close
      name:  <unnamed>
       log:  C:\Users\wb500886\OneDrive - WBG\7_Housing\survey_all\Housing_git\nss\Survey_NSS\03_Import NSS70_hous
> ing_mortgage.log
  log type:  text
 closed on:  15 Nov 2020, 04:55:47
------------------------------------------------------------------------------------------------------------------
